package com.example.admin.police1;


public class QuestionLibrary2018_4 {

       //2018 3월 24일  경찰 형소법


    public   static  String mQuestions [] = {



            "1. " +
                    "｢헌법｣ 제12조에서 형사절차와 관련하여 명시적으로 규정한 것을 모두 고른 것은?" +
                    "\n\n\n㉠누구든지 체포 또는 구속을 당한 때에는 적부의 심사를 법원에 청구할 권리를 가진다.\n" +
                    "\n㉡체포·구속·압수 또는 수색을 할 때에는 적법한 절차에 따라 검사의 신청에 의하여 법관이 발부한 영장을 제시하여야 한다. 다만, 현행범인인 경우와 장기 3년 이상의 형에 해당하는 죄를 범하고 도피 또는 증거인멸의 염려가 있을 때에는 사후에 영장을 청구할 수 있다.\n" +
                    "\n㉢적법한 절차에 따르지 아니하고 수집한 증거는 증거로 할 수 없다.\n" +
                    "\n㉣재판장은 검사의 의견을 들은 후 피고인과 변호인에게 최종의 의견을 진술할 기회를 주어야 한다.\n" +
                    "\n㉤모든 국민은 고문을 받지 아니하며, 형사상 자기에게 불리한 진술을 강요당하지 아니한다.",


            "2." +
                    "｢형사소송법｣의 이념에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",



            "3." +
                    "고소에 대한 설명으로 옳은 것을 모두 고른 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠｢형사소송법｣ 제236조의 대리인에 의한 고소의 경우, 대리권이 정당한 고소권자에 의하여 수여되었음이 실질적으로 증명되면 충분하고 그 방식에 특별한 제한은 없지만, 고소를 할 때 반드시 위임장을 제출하거나 ‘대리’라는 표시를 하여야 한다.\n" +
                    "\n㉡고소장에 명예훼손죄의 죄명을 붙이고 그 죄에 관한 사실을 적었으나 그 사실이 명예훼손죄를 구성하지 않고 모욕죄를 구성하는 경우 위 고소는 모욕죄에 대한 고소로서의 효력은 갖지 않는다.\n" +
                    "\n㉢친고죄의 공범 중 그 1인 또는 수인에 대한 고소 또는 그 취소는 다른 공범자에 대하여는 효력이 없다.\n" +
                    "\n㉣고소능력은 피해를 입은 사실을 이해하고 고소에 따른 사회생활상의 이해관계를 알아차릴 수 있는 사실상의 의사능력으로 충분하지만, 민법상 행위능력이 없는 사람은 위와 같은 능력을 갖추었더라도 고소능력이 인정되지 않는다.",


            "4. " +
                    "반의사불벌죄에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",





            "5. " +
                    "｢형사소송법｣ 및 ｢형사소송규칙｣상 영상녹화에 대한 내용으로 가장 적절하지 않은 것은?",





            "6. " +
                    "긴급체포에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",



            "7. " +
                    "구속에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)" ,





            "8. " +
                    "｢형사소송법｣상 압수물의 환부 및 가환부에 대한 설명으로 옳은 것을 모두 고른 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠수사기관의 압수물의 환부에 관한 처분의 취소를 구하는 준항고는 소송 계속 중 준항고로써 달성하고자 하는 목적이 이미 이루어졌거나 시일의 경과 또는 그 밖의 사정으로 인하여 그 이익이 상실된 경우에도 적법하다.\n" +
                    "\n㉡검사는 사본을 확보한 경우 등 압수를 계속할 필요가 없다고 인정되는 압수물 및 증거에 사용할 압수물에 대하여 공소제기 전이라도 소유자, 소지자, 보관자 또는 제출인의 청구가 있는 때에는 환부 또는 가환부할 수 있다. \n" +
                    "\n㉢증거에만 공할 목적으로 압수한 물건으로서 그 소유자 또는 소지자가 계속 사용하여야 할 물건은 사진촬영 기타 원형보존의 조치를 취하고 신속히 가환부하여야 한다.\n" +
                    "\n㉣압수한 장물로서 피해자에게 환부할 이유가 명백한 것은 판결로써 피해자에게 환부하는 선고를 하여야 한다.",




            "9. " +
                    "검사 A는 공소사실의 일부가 되는 범죄일람표를 컴퓨터 프로그램을 통하여 열어보거나 출력할 수 있는 전자적 형태의 문서로 작성한 후, 종이문서로 출력하여 제출하지 아니하고 전자적 형태의 문서가 저장된 저장매체 자체를 서면인 공소장에 첨부하여 제출하였다. 이에 대한 설명으로 옳고 그름의 표시(O, X)가 바르게 된 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠서면인 공소장에 기재된 부분에 한하여 공소가 제기된 것으로 볼 수 있을 뿐이고, " +
                    "\n\n㉡ 저장매체에 저장된 전자적 형태의 문서 부분까지 공소가 제기된 것이라고 할 수는 없다. " +
                    "\n\n㉢ 이러한 형태의 공소제기를 허용하는 별도의 규정이 없을 뿐만 아니라, 저장매체나 전자적 형태의 문서를 공소장의 일부로서의 ‘서면’으로 볼 수도 없기 때문이다. " +
                    "\n\n㉣ 이는 전자적 형태의 문서의 양이 방대하여 그와 같은 방식의 공소제기를 허용해야 할 현실적인 필요가 있다거나 피고인과 변호인이 이의를 제기하지 않고 변론에 응하였다고 하여 달리 볼 것도 아니다.",



            "10. " +
                    "공소시효에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",





            "11." +
                    "공동피고인에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",




            "12." +
                    "증인신문에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",




            "13. " +
                    "간이공판절차에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",




            "14. " +
                    "엄격한 증명의 대상이면서 검사에게 거증책임이 있는 것으로 가장 적절한 것은?(다툼이 있는 경우 판례에 의함)",


            "15." +
                    "자백배제법칙에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",



            "16. " +
                    "사법경찰관 작성 피의자신문조서의 증거능력에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",



            "17. " +
                    "탄핵증거에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",





            "18. " +
                    "불이익변경금지원칙에 대한 설명 중 옳고 그름의 표시(O, X)가 바르게 된 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠제1심에서 징역형의 집행유예를 선고한 데 대하여 제2심이 그 징역형의 형기를 단축하여 실형을 선고하는 것도 불이익변경금지원칙에 위배된다.\n" +
                    "\n\n㉡아동·청소년 대상 성폭력범죄의 피고인에게 ‘징역 15년 및 5년 동안의 위치추적 전자장치 부착명령’을 선고한 제1심판결을 파기한 후 ‘징역 9년, 5년 동안의 공개명령 및 6년 동안의 위치추적 전자장치 부착명령’을 선고한 원심의 조치는 불이익변경금지원칙에 위배된다.\n" +
                    "\n\n㉢피고인만이 항소한 사건에서 항소심법원이 제1심판결을 파기하고 새로운 형을 선고함에 있어 피고인에 대한 주형에서 그 형기를 감축하고 제1심판결이 선고하지 아니한 압수장물을 피해자에게 환부하는 선고를 추가하였더라도 그것만으로는 불이익변경금지원칙에 위배되지 않는다.\n" +
                    "\n\n㉣원심이 유기징역형을 선택한 1심보다 중하게 무기징역형을 선택한 경우에는 결과적으로 선고형이 중하게 변경되지 않았더라도 불이익변경금지 원칙에 위배된다.",





            "19. " +
                    "약식절차에 대한 설명으로 가장 적절한 것은?(다툼이 있는 경우 판례에 의함)",




            "20. " +
                    " 불복기간이 3일인 것을 모두 고른 것은?" +
                    "\n\n\n㉠｢형사보상 및 명예회복에 관한 법률｣ 제20조의 형사보상결정에 대한 즉시항고\n" +
                    "\n㉡｢즉결심판에 관한 절차법｣ 제14조의 즉결심판에 대한 정식재판청구\n" +
                    "\n㉢｢형사소송법｣ 제23조의 기피신청기각결정에 대한 즉시항고\n" +
                    "\n㉣｢소년법｣ 제43조의 보호처분결정에 대한 항고\n" +
                    "\n㉤｢형사소송법｣ 제184조의 증거보전청구기각결정에 대한 항고",


    };





    public  static String mChoices [][] = {


         //1~5

            {"㉠㉡㉣",
                    "㉠㉡㉤",
                    "㉡㉣㉤",
                    "㉢㉣㉤"},




            {"검사와 피고인 쌍방이 항소한 경우에 1심선고형기 경과후 2심공판이 개정되었다면 이를 위법이라 할 수 있고 신속한 재판을 받을 권리를 박탈한 것이라고 할 수 있다.",
                    "심리에 2일 이상이 필요한 경우에는 부득이한 사정이 없는 한 매일 계속 개정하여야 한다. 재판장은 부득이한 사정으로 매일 계속 개정하지 못하는 경우에도 특별한 사정이 없는 한 전회의 공판기일부터 14일 이내로 다음 공판기일을 지정하여야 한다.",
                    "소송의 지연을 목적으로 함이 명백한 경우에 기피신청을 받은 법원 또는 법관이 이를 기각할 수 있도록 규정한 ｢형사소송법｣ 제20조 제1항은 헌법상 보장되는 공정한 재판을 받을 권리를 침해하였다고 할 수 없다. ",
                    "구속사건에 대해서는 법원이 구속기간내에 재판을 하면 되는 것이고 구속만기 25일을 앞두고 제1회 공판이 있었다 하여 헌법에 정한 신속한 재판을 받을 권리를 침해하였다고 할 수 없다."},


            {"㉠㉢",
                    "㉡㉣",
                    "㉡㉢㉣",
                    "없음"},


            {"폭행죄는 피해자의 명시한 의사에 반하여 공소를 제기할 수 없는 반의사불벌죄로서 처벌불원의 의사표시는 의사능력이 있는 피해자가 단독으로 할 수 있는 것이고, 피해자가 사망한 후 그 상속인이 피해자를 대신하여 처벌불원의 의사표시를 할 수는 없다고 보아야 한다.",
                    "반의사불벌죄에 있어서 처벌불원의 의사표시의 부존재는 소위 소극적 소송조건으로서 직권조사사항이라 할 것이므로 당사자가 항소이유로 주장하지 아니하였다고 하더라도 원심은 이를 직권으로 조사·판단하여야 한다.",
                    "｢형사소송법｣ 제233조에서 고소와 고소취소의 불가분에 관한 규정을 함에 있어서 반의사불벌죄에 이를 준용하는 규정을 두지 아니한 것은 입법의 불비로 볼 것은 아니다.",
                    "｢형사소송법｣ 제232조 제1항 및 제3항에 의하면, 반의사불벌죄에 있어서 처벌을 희망하는 의사표시의 철회는 제1심 판결선고 전까지 이를 할 수 있다고 규정하고 있는데, 항소심에 이르러 비로소 반의사불벌죄가 아닌 죄에서 반의사불벌죄로 공소장변경이 있었다면 항소심인 제2심을 제1심으로 볼 수 있다."},


            {"검사 또는 사법경찰관은 수사에 필요한 때에는 피의자가 아닌 자의 출석을 요구하여 진술을 들을 수 있다. 이 경우 그의 동의를 받아 영상녹화할 수 있다.",
                    "검사는 피의자가 아닌 자가 공판준비 또는 공판기일에서 조서가 자신이 검사 또는 사법경찰관 앞에서 진술한 내용과 동일하게 기재되어 있음을 인정하지 아니하는 경우 그 부분의 성립의 진정을 증명하기 위하여 영상녹화물의 조사를 신청할 수 있다.",
                    "법원은 검사가 영상녹화물의 조사를 신청한 경우 이에 관한 결정을 함에 있어 피고인 또는 변호인으로 하여금 그 영상녹화물이 적법한 절차와 방식에 따라 작성되어 봉인된 것인지 여부에 관한 의견을 진술하게 하여야 한다.",
                    "법원은 공판준비 또는 공판기일에서 봉인을 해체하고 영상녹화물의 전부 또는 일부를 재생하는 방법으로 조사하여야 한다. 이 때 영상녹화물은 그 재생과 조사에 필요한 전자적 설비를 갖춘 법정 외의 장소에서는 이를 재생할 수 없다."},




      //6~10

            {"｢형사소송법｣ 제200조의4 제3항은 영장 없이는 긴급체포 후 석방된 피의자를 동일한 범죄사실에 관하여 체포하지 못한다는 규정으로, 위와 같이 석방된 피의자는 법원으로부터 구속영장을 발부받아도 구속할 수 없다.",
                    "사법경찰관이 ｢형사소송법｣ 제200조의3(긴급체포) 제1항의 규정에 의하여 피의자를 긴급체포한 경우에는 즉시 검사의 승인을 얻어야 한다.",
                    "긴급체포의 요건을 갖추었는지 여부는 사후에 밝혀진 사정을 기초로 판단하는 것이 아니라 체포 당시의 상황을 기초로 판단하여야 한다.",
                    "긴급체포 후 석방된 자 또는 그 변호인·법정대리인·배우자·직계친족·형제자매는 통지서 및 관련 서류를 열람하거나 등사할 수 있다."},


            //7

            {"구속영장 발부에 의하여 적법하게 구금된 피의자가 피의자신문을 위한 출석요구에 응하지 아니하면서 수사기관 조사실에 출석을 거부한다면 수사기관은 그 구속영장의 효력에 의하여 피의자를 조사실로 구인할 수 있다.",
                    "구인한 피고인을 법원에 인치한 경우에 구금할 필요가 없다고 인정한 때에는 그 인치한 때로부터 24시간 내에 석방하여야 한다.",
                    "검사의 체포영장 또는 구속영장 청구에 대한 지방법원판사의 재판은 ｢형사소송법｣ 제402조의 규정에 의하여 항고의 대상이 되는 ‘법원의 결정’에 해당하지 않지만, 제416조 제1항의 규정에 의하여 준항고의 대상이 되는 ‘재판장 또는 수명법관의 구금 등에 관한 재판’에는 해당한다.",
                    "검사의 구속영장 청구 전 피의자 대면조사는 강제수사가 아니므로 피의자는 검사의 출석 요구에 응할 의무가 없고, 피의자가 검사의 출석 요구에 동의한 때에 한하여 사법경찰관리는 피의자를 검찰청으로 호송하여야 한다."},



            //8
            {"㉠㉡",
                    "㉡㉣",
                    "㉢㉣",
                    "㉠㉡㉢"},

            //9
            {"㉠(O)      ㉡(O)          ㉢(O)          ㉣(O)",
                    "㉠(O)      ㉡(X)          ㉢(O)          ㉣(X)",
                    "㉠(X)      ㉡(O)          ㉢(X)          ㉣(O)",
                    "㉠(X)      ㉡(X)          ㉢(O)          ㉣(X)"},

             //10
            {"장기 10년 미만의 징역 또는 금고에 해당하는 범죄의 공소시효 기간은 7년이다.",
                    "｢형사소송법｣ 제253조 제3항이 정한 ‘범인이 형사처분을 면할 목적으로 국외에 있는 경우’는 범인이 국외에서 범죄를 저지르고 형사처분을 면할 목적으로 국외에서 체류를 계속하는 경우도 포함된다.",
                    "범죄의 증명이 없다는 이유로 공범 중 1인이 무죄의 확정판결을 선고받은 경우에는 그를 공범이라고 할 수 없어 그에 대하여 제기된 공소로써는 진범에 대한 공소시효정지의 효력이 없다.",
                    "공무원이 취급하는 사건에 관하여 청탁 또는 알선을 할 의사와 능력이 없음에도 청탁 또는 알선을 한다고 기망하여 금품을 교부받은 경우에 성립하는 사기죄와 변호사법 위반죄는 변호사법 위반죄의 공소시효가 완성되었다면 그 죄와 상상적 경합관계에 있는 사기죄의 공소시효도 완성된다."},


            //11


            {"공동피고인과 피고인이 뇌물을 주고 받은 사이로 필요적 공범관계에 있다면 검사는 수사단계에서 피고인에 대한 증거를 미리 보전하기 위하여 필요한 경우라도 판사에게 공동피고인을 증인으로 신문할 것을 청구할 수 없다.",
                    "피고인과 별개의 범죄사실로 기소되어 병합심리되고 있던 공동피고인은 피고인에 대한 관계에서는 증인의 지위에 있음에 불과하므로 선서없이 한 그 공동피고인의 법정 및 검찰진술은 피고인에 대한 공소범죄사실을 인정하는 증거로 할 수 없다.",
                    "법원은 공소제기 후부터 공판준비기일이 종결된 다음날까지 공범 관계에 있는 피고인들 중 일부가 국민참여재판을 원하지 아니하여 국민참여재판의 진행에 어려움이 있다고 인정되는 경우에는 국민참여재판을 하지 아니하기로 하는 결정을 할 수 있다.",
                    "피고인을 위하여 원심판결을 파기하는 경우에 파기의 이유가 항소한 공동피고인에게 공통되는 때에는 그 공동피고인에게 대하여도 원심판결을 파기하여야 한다."},



             //12
            {"｢헌법｣ 제109조, ｢법원조직법｣ 제57조 제1항에서 정한 공개금지사유가 없음에도 불구하고 재판의 심리에 관한 공개를 금지하기로 결정하였다면 그러한 공개금지결정은 피고인의 공개재판을 받을 권리를 침해한 것으로서 그 증인신문절차에 의하여 이루어진 증인의 증언은 증거능력이 없고, 변호인의 반대신문권이 보장되었더라도 달리 볼 수는 없다.",
                    "법원은 범죄의 성질, 증인의 연령, 심신의 상태, 피고인과의 관계, 그 밖의 사정으로 인하여 피고인 등과 대면하여 진술하는 경우 심리적인 부담으로 정신의 평온을 현저하게 잃을 우려가 있다고 인정되는 자를 증인으로 신문하는 경우 상당하다고 인정하는 때에는 검사와 피고인 또는 변호인의 의견을 들어 비디오 등 중계장치에 의한 중계시설을 통하여 신문하거나 차폐시설 등을 설치하고 신문할 수 있다.",
                    "자신에 대한 유죄판결이 확정된 증인이 공범에 대한 피고사건에서 증언할 당시 앞으로 재심을 청구할 예정이라면, 이를 이유로 증인에게는 ｢형사소송법｣ 제148조에 의한 증언거부권이 인정된다.",
                    "법원은 범죄로 인한 피해자를 증인으로 신문하는 경우 당해 피해자·법정대리인 또는 검사의 신청에 따라 피해자의 사생활의 비밀이나 신변보호를 위하여 필요하다고 인정하는 때에는 결정으로 심리를 공개하지 아니할 수 있다."},


            //13
            {"피고인이 공소사실에 대하여 검사가 신문을 할 때에는 공소사실을 모두 사실과 다름없다고 진술하였으나 변호인이 신문을 할 때에는 범의나 공소사실을 부인하였다면 그 공소사실은 간이공판절차에 의하여 심판할 대상은 아니다.",
                    "피고인이 공판준비절차에서 공소사실에 대하여 자백한 경우는 간이공판절차가 허용된다.",
                    "간이공판절차의 결정의 요건인 공소사실의 자백이라 함은 공소장 기재사실을 인정하고 나아가 위법성이나 책임조각사유가 되는 사실을 진술하지 아니하는 것으로 충분하고 명시적으로 유죄를 자인하는 진술이 있어야 하는 것은 아니다.",
                    "국민참여재판에는 간이공판절차에 관한 규정을 적용하지 아니한다."},




           //14
            {"｢형사소송법｣ 제312조 제4항에서 정한 ‘특히 신빙할 수 있는 상태’의 존재 입증",
                    "몰수대상이 되는지 여부나 추징액의 인정 등 ‘몰수·추징의 사유’ 입증",
                    "명예훼손죄의 위법성조각사유인「형법」제310조 규정 중 ‘진실한 사실로서 오로지 공공의 이익에 관한 것’인지 여부에 대한 입증",
                    "｢형법｣ 제6조 단서의 ‘행위지 법률에 의하여 범죄를 구성하는지’ 여부에 대한 입증"},


            //15
            {"임의성이 인정되지 아니하여 증거능력이 없는 진술증거는 피고인이 증거로 함에 동의하더라도 증거로 삼을 수 없다.",
                    "일정한 증거가 발견되면 피의자가 자백하겠다고 한 약속이 검사의 강요나 위계에 의하여 이루어졌다던가 또는 불기소나 경한 죄의 소추 등 이익과 교환조건으로 된 것으로 인정되지 않는다면 위와 같은 자백의 약속하에 된 자백이라 하여 곧 임의성 없는 자백이라고 단정할 수는 없다.",
                    "｢형사소송법｣ 제309조는 “피고인의 자백이 고문, 폭행, 협박, 신체구속의 부당한 장기화 또는 기망 기타의 방법으로 임의로 진술한 것이 아니라고 의심할 만한 이유가 있을 때에는 이를 유죄의 증거로 하지 못한다”고 규정하고 있는데, 위 법조에서 규정된 피고인의 진술의 자유를 침해하는 위법사유는 원칙적으로 예시사유로 보아야 한다.",
                    "피고인이 수사기관에서 가혹행위 등으로 인하여 임의성 없는 자백을 하고 그 후 법정에서도 임의성 없는 심리상태가 계속되어 동일한 내용의 자백을 하였더라도 법정에서의 자백은 임의성 없는 자백이라고 볼 수 없다."},

            //16

            {"사법경찰관이 작성한 피의자신문조서는 적법한 절차와 방식에 따라 작성된 것으로서 공판준비 또는 공판기일에 그 피의자였던 피고인 또는 변호인이 그 내용을 인정할 때에 한하여 증거로 할 수 있다.",
                    "피의자의 진술을 녹취 내지 기재한 서류 또는 문서가 수사기관에서의 조사 과정에서 작성된 것이지만 그것이 진술서라는 형식을 취하였다면 피의자신문조서와 달리 보아야 한다.",
                    "당해 피고인과 공범관계가 있는 다른 피의자에 대한 사법경찰관 작성 피의자신문조서에 대하여는 사망 등 사유로 인하여 법정에서 진술할 수 없는 때에 예외적으로 증거능력을 인정하는 규정인｢형사소송법｣ 제314조가 적용되지 아니한다. ",
                    "형사소송법｣ 제312조 제3항은 사법경찰관이 작성한 당해 피고인에 대한 피의자신문조서를 유죄의 증거로 하는 경우뿐만 아니라 사법경찰관이 작성한 당해 피고인과 공범관계에 있는 다른 피고인이나 피의자에 대한 피의자신문조서를 당해 피고인에 대한 유죄의 증거로 채택할 경우에도 적용된다."},

           //17
            {"탄핵증거는 진술의 증명력을 감쇄하기 위하여 인정되는 것이고 범죄사실 또는 그 간접사실의 인정의 증거로서는 허용되지 않는다.",
                    "피고인의 진술을 내용으로 하는 영상녹화물은 공판준비 또는 공판기일에 피고인 진술의 증명력을 다투기 위한 증거로 사용할 수 없다.",
                    "탄핵증거의 제출에 있어서도 상대방에게 이에 대한 공격방어의 수단을 강구할 기회를 사전에 부여하여야 한다는 점에서 그 증거와 증명하고자 하는 사실과의 관계 및 입증취지 등을 미리 구체적으로 명시하여야 할 것이므로, 증명력을 다투고자 하는 증거의 어느 부분에 의하여 진술의 어느 부분을 다투려고 한다는 것을 사전에 상대방에게 알려야 한다.",
                    "탄핵증거는 범죄사실을 인정하는 증거가 아니므로 엄격한 증거조사를 거쳐야 할 필요가 없으며, 법정에서 이에 대한 탄핵증거로서의 증거조사도 필요하지 않다."},




           //18
            {"㉠(O)      ㉡(X)        ㉢(O)        ㉣(O)",
                    "㉠(O)      ㉡(X)        ㉢(O)        ㉣(X)",
                    "㉠(X)      ㉡(O)        ㉢(X)        ㉣(X)",
                    "㉠(O)      ㉡(O)        ㉢(O)        ㉣(O)"},




           //19
            {"지방법원은 그 관할에 속한 사건에 대하여 검사의 청구가 있는 때에는 공판절차없이 약식명령으로 피고인을 벌금, 구류, 과료 또는 몰수에 처할 수 있다.",
                    "변호인이 약식명령에 대해 정식재판청구서를 제출할 것으로 믿고 피고인이 스스로 적법한 정식재판의 청구기간 내에 정식재판청구서를 제출하지 못하였다면 그것은 피고인 또는 대리인이 책임질 수 없는 사유로 인하여 정식재판의 청구기간 내에 정식재판을 청구하지 못한 때에 해당한다.",
                    "약식명령의 고지는 검사와 피고인에 대한 재판서의 송달에 의하도록 규정하고 있으므로 약식명령은 그 재판서를 피고인에게 송달함으로써 효력이 발생하고, 변호인이 있는 경우에는 반드시 변호인에게 약식명령 등본을 송달해야 한다.",
                    "피고인이 정식재판을 청구한 사건에 대하여는 약식명령의 형보다 중한 종류의 형을 선고하지 못한다. 피고인이 정식재판을 청구한 사건에 대하여 약식명령의 형보다 중한 형을 선고하는 경우에는 판결서에 양형의 이유를 적어야 한다."},

           //20
            {"㉠㉡",
                    "㉠㉢㉤",
                    "㉢㉤",
                    "㉢㉣㉤"},





    };


    public static String mCorrectAnswers[] =
            //1
            {"㉠㉡㉤",

                    //2
                    "검사와 피고인 쌍방이 항소한 경우에 1심선고형기 경과후 2심공판이 개정되었다면 이를 위법이라 할 수 있고 신속한 재판을 받을 권리를 박탈한 것이라고 할 수 있다.",

                    //3
                    "없음",

                   //4
            "｢형사소송법｣ 제232조 제1항 및 제3항에 의하면, 반의사불벌죄에 있어서 처벌을 희망하는 의사표시의 철회는 제1심 판결선고 전까지 이를 할 수 있다고 규정하고 있는데, 항소심에 이르러 비로소 반의사불벌죄가 아닌 죄에서 반의사불벌죄로 공소장변경이 있었다면 항소심인 제2심을 제1심으로 볼 수 있다.",

                    //5
            "법원은 공판준비 또는 공판기일에서 봉인을 해체하고 영상녹화물의 전부 또는 일부를 재생하는 방법으로 조사하여야 한다. 이 때 영상녹화물은 그 재생과 조사에 필요한 전자적 설비를 갖춘 법정 외의 장소에서는 이를 재생할 수 없다.",


               //6
            "｢형사소송법｣ 제200조의4 제3항은 영장 없이는 긴급체포 후 석방된 피의자를 동일한 범죄사실에 관하여 체포하지 못한다는 규정으로, 위와 같이 석방된 피의자는 법원으로부터 구속영장을 발부받아도 구속할 수 없다.",

              //7
            "검사의 체포영장 또는 구속영장 청구에 대한 지방법원판사의 재판은 ｢형사소송법｣ 제402조의 규정에 의하여 항고의 대상이 되는 ‘법원의 결정’에 해당하지 않지만, 제416조 제1항의 규정에 의하여 준항고의 대상이 되는 ‘재판장 또는 수명법관의 구금 등에 관한 재판’에는 해당한다.",

                    //8
            "㉢㉣",

                    //9
            "㉠(O)      ㉡(O)          ㉢(O)          ㉣(O)",


                    //10
            "공무원이 취급하는 사건에 관하여 청탁 또는 알선을 할 의사와 능력이 없음에도 청탁 또는 알선을 한다고 기망하여 금품을 교부받은 경우에 성립하는 사기죄와 변호사법 위반죄는 변호사법 위반죄의 공소시효가 완성되었다면 그 죄와 상상적 경합관계에 있는 사기죄의 공소시효도 완성된다.",

                    //11

                    "공동피고인과 피고인이 뇌물을 주고 받은 사이로 필요적 공범관계에 있다면 검사는 수사단계에서 피고인에 대한 증거를 미리 보전하기 위하여 필요한 경우라도 판사에게 공동피고인을 증인으로 신문할 것을 청구할 수 없다.",


                    //12
                    "자신에 대한 유죄판결이 확정된 증인이 공범에 대한 피고사건에서 증언할 당시 앞으로 재심을 청구할 예정이라면, 이를 이유로 증인에게는 ｢형사소송법｣ 제148조에 의한 증언거부권이 인정된다.",

                    //13
                    "피고인이 공판준비절차에서 공소사실에 대하여 자백한 경우는 간이공판절차가 허용된다.",

                    //14
                    "｢형법｣ 제6조 단서의 ‘행위지 법률에 의하여 범죄를 구성하는지’ 여부에 대한 입증",


                    //15
                    "피고인이 수사기관에서 가혹행위 등으로 인하여 임의성 없는 자백을 하고 그 후 법정에서도 임의성 없는 심리상태가 계속되어 동일한 내용의 자백을 하였더라도 법정에서의 자백은 임의성 없는 자백이라고 볼 수 없다.",


                   //16
                    "피의자의 진술을 녹취 내지 기재한 서류 또는 문서가 수사기관에서의 조사 과정에서 작성된 것이지만 그것이 진술서라는 형식을 취하였다면 피의자신문조서와 달리 보아야 한다.",

                    //17
                    "탄핵증거는 범죄사실을 인정하는 증거가 아니므로 엄격한 증거조사를 거쳐야 할 필요가 없으며, 법정에서 이에 대한 탄핵증거로서의 증거조사도 필요하지 않다.",

                    //18
                    "㉠(O)      ㉡(X)        ㉢(O)        ㉣(X)",

                    //19
                    "피고인이 정식재판을 청구한 사건에 대하여는 약식명령의 형보다 중한 종류의 형을 선고하지 못한다. 피고인이 정식재판을 청구한 사건에 대하여 약식명령의 형보다 중한 형을 선고하는 경우에는 판결서에 양형의 이유를 적어야 한다.",

                    //20
                    "㉢㉤",
    };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


