package com.example.admin.police1;


import java.io.OptionalDataException;

public class QuestionLibrary2018_1 {

       //2018 3월 24일 시행  경찰 한국사


    public   static  String mQuestions [] = {
            "1. " +
                    "청동기 시대에 대한 설명으로 가장 적절하지 않은 것은? ",
            "2." +
                    "(가)와 (나)의 나라에 대한 설명으로 가장 적절한 것은?" +
                    "\n\n\n(가) 고구려 개마대산 동쪽에 있는데 개마대산은 큰 바닷가에 맞닿아 있다. …… 그 나라 풍속에 여자 나이 10살이 되기 전에 혼인을 약속한다. 신랑 집에서 맞이하여 장성하도록 길러 아내를 삼는다. 성인이 되면 다시 친정으로 돌아가게 한다. 여자의 친정에서는 돈을 요구하는데, 돈을 지불한 후 다시 신랑 집으로 돌아온다.\n" +
                    "(나) 남쪽으로는 진한과, 북쪽으로는 고구려·옥저와 맞닿아 있고 동쪽으로는 큰 바다에 닿았다. …… 해마다 10월이면 하늘에 제사를 지내는데 밤낮으로 술마시며 노래 부르고 춤추니, 이를 ‘무천’이라고 한다.",
            "3." +
                    "다음 빈칸에 들어갈 단어가 바르게 짝지어진 것은? " +
                    "\n\n\n삼국 중에서 가장 먼저 국가 체제를 정비한 것은 고구려였다. \n졸본성에서" +
                    "(가)으로 도읍을 옮긴 고구려는 1세기 후반 태조왕 때에 이르러 정복 활동을 활발히 전개하였다. 이러한 정복 활동 과정에서 커진 군사력과 경제력을 토대로 왕권이 안정되어 왕위가 독점적으로 세습되었고, 통합된 여러 집단은 5부 체제로 발전하였다. 이후 2세기 후반 \n" +
                    "\n(나)때에는 부족적인 전통을 지녀 온 5부가 행정적 성격의 5부로 개편되었다. 이후 왕위 계승도 형제 상속에서 부자 상속으로 바뀌었으며, 족장들이 중앙 귀족으로 편입되는 등 왕권 강화와 중앙 집권화가 더욱 진전되었다.\n" +
                    " 백제는 기원 후 1세기 중엽에 마한을 공격하고, 3세기 중엽 " +
                    "\n(다)" +
                    " 때에는 위(魏) 지배하의 낙랑군과 대방군 그리고 말갈족을 북으로 밀어 내면서 영토를 넓히고, 국가 체제를 새롭게 정비했다. 즉 중앙에 6개의 좌평(佐平)을 두어 업무를 분장시키고, 16품의 관등제와 백관의 공복(公服)을 제정하여 지방 족장들을 차등 있게 중앙관료로 흡수함으로써 정비된 고대 왕국의 모습을 갖추었다.\n" +
                    " 신라가 세습왕권을 확립하고 지금의 경상북도 일대를 장악하게 된 것은 4세기 후반의 \n" +
                    "\n(라)" +
                    " 때부터이다. 이때부터 3성교대가 끝나고 김씨가 세습적인 왕권을 확립하고 군장의 칭호도 이사금에서 마립간으로 바꾸었다. 부족 집단인 6촌도 이 무렵 행정적인 6부로 개편되었다.",
            "4. " +
                    "신라 말 사회 모습에 대한 설명으로 가장 적절하지 않은 것은?",
            "5. " +
                    "다음 개혁안이 등장한 왕의 재위기에 있었던 일로 가장 적절한 것은?" +
                    "\n\n\n우리 태조께서 통일하신 후에 외관을 두고자 하셨으나, 대개 초창기였으므로 일이 번잡하여 미처 그럴 겨를이 없었습니다. 이에 제가 보건대 향리 토호들이 늘 공무를 빙자하여 백성들을 침해하고 학대하므로 백성들이 명령을 감당하지 못하니, 청하건대 외관을 두시옵소서. ",





            "6. " +
                    "고려의 지방행정 조직에 대한 설명으로 가장 적절하지 않은 것은?"
            ,
            "7. " +
                    "고려 시대의 역사적 사실을 시대 순으로 나열한 것은?" +
                    "\n\n\n㉠ 몽골에 저항하던 고려 정부가 개경으로 환도하였다.\n" +
                    "\n㉡ 강화도와 진주에 도감을 설치하고 새로이 대장경을 판각하여 완성하였다.\n" +
                    "\n㉢『상정고금예문』이 금속 활자로 인쇄되었다.\n" +
                    "\n㉣ 일연이 불교사를 중심으로 고대의 민간 설화와 전래기록을 수록한 역사서를 저술하였다. ",
            "8. " +
                    "고려 시대의 예술에 대한 설명으로 가장 적절하지 않은 것은? ",
            "9. " +
                    "고려의 대외 항쟁과 관련된 설명으로 가장 적절하지 않은 것은? ",
            "10. " +
                    "다음 시와 관련된 인물에 대한 설명으로 가장 적절한 것은?" +
                    "\n\n\n좋은 말 살지게 먹여 시냇물에 씻겨 타고" +
                    "\n서릿발 같은 칼 잘 갈아 어깨에 둘러메고" +
                    "\n대장부의 위국충절을 세워 볼까 하노라\n\n" +
                    "「호기가(豪氣歌)」 ",





            "11." +
                    "조선 시대의 토지 제도에 대한 설명으로 가장 적절하지 않은 것은? ",
            "12." +
                    "조선 시대의 과거 제도에 대한 설명으로 가장 적절하지 않은 것은? ",
            "13. " +
                    "다음은 임진왜란과 관련된 설명이다. 이를 시간 순으로 나열한 것은? " +
                    "\n\n\n㉠ 신립 장군이 충주의 탄금대에서 왜군과 싸웠으나 패배하였다.\n" +
                    "\n㉡ 군민들이 첨사 정발의 지휘 아래 왜군과 싸웠으나 패배하였다.\n" +
                    "\n㉢ 조선 수군이 옥포에서 첫 승리를 거두었다.\n" +
                    "\n㉣ 왜군이 평양을 점령하였다.",
            "14. " +
                    " 조선 후기 노론 내부에 주기설과 주리설의 분파가 생겨 이른바 ‘호락시비(湖洛是非)’로 불리는 큰 논쟁이 일어났다. 이 호락(湖洛) 논쟁에 대한 설명으로 가장 적절하지 않은 것은? ",
            "15. " +
                    "다음 인조반정 이후 17세기에 발생한 사실을 순서대로 나열한 것은? " +
                    "\n\n\n㉠ 삼학사(三學士)가 심양에 끌려가 죽임을 당하였다.\n" +
                    "\n㉡ 이괄이 평안북도에서 반란을 일으켜 서울까지 점령하는 사태가 벌어졌다.\n" +
                    "\n㉢ 후금의 태종은 광해군을 위하여 보복한다는 명분을 내걸고 ‘정묘호란’을 일으켰다.\n" +
                    "\n㉣ 후금이 국호를 청(淸)이라 고치고 조선에 대하여 군신(君臣)의 관계를 맺을 것을 요구해 왔다",





            "16. " +
                    "다음과 관련된 설명으로 가장 적절하지 않은 것은? " +
                    "\n\n\n“나는 천리(千里)를 끌어다 지척(咫尺)으로 삼겠으며, 태산(泰山)을 깎아 내려 평지(平地)를 만들고, 또한 남대문(南大門)을 3층으로 높이려 한다.”\n" +
                    "\n\n『매천야록』",
            "17. " +
                    "다음 내용과 관련된 설명으로 가장 적절한 것은? " +
                    "\n\n\n러시아 공사관에 머물던 고종은 환궁하여 1897년 10월 12일 황제 즉위식을 거행하고, 국호는 ‘대한(大韓)’으로 바꾸었다. 또한 1899년 ‘대한국국제(大韓國國制)’를 발표하여 만국공법(국제법)상 근대 국가의 모습을 갖추었다.",
            "18. " +
                    "다음은 어느 애국계몽단체와 관련된 자료이다. 이 단체보다 먼저 결성되어 활동했던 단체로 바르게 짝지어진 것은? " +
                    "\n\n\n 무릇 우리나라의 독립은 자강에 있음이라. 오늘날 우리 한국은 3천리 강토와 2천만 동포가 있으니 힘써 자강하여 단체가 합하면 앞으로 부강한 전도를 바랄 수 있고 국권을 능히 회복할 수 있을 것이다. 자강의 방법으로는 교육을 진작하고 산업을 일으켜 흥하게 하면 되는 것이다. 무릇 교육이 일지 못하면 민지(民智)가 열리지 못하고 산업이 늘지 못하면 국부가 부강할 수 없다. 그런즉 민지를 개발하고 국력을 기르는 길은 무엇보다도 교육과 산업을 발달시키는 데 있지 않겠는가? " +
                    "\n\n\n㉠ 헌정연구회   ㉡ 대한협회   \n㉢ 보안회   ㉣ 대한자강회",
            "19. " +
                    "1910년대 일제의 식민통치에 대한 설명으로 가장 적절하지 않은 것은? ",
            "20. " +
                    " 다음 내용을 시간 순서대로 나열한 것은? " +
                    "\n\n\n㉠ 한국문제를 언급하여 ‘적당한 시기(in due course)’에 한국을 독립시킬 것을 결의하였다.\n" +
                    "\n㉡ ‘조선 건국 동맹’이 조직되었다.\n" +
                    "\n㉢ ‘한국문제에 관한 4개항의 결의서’를 결정하였다. \n" +
                    "\n㉣ 3국 정상들은 독일에 모여 한국의 독립을 재확인하였다.",



    };


    public  static String mChoices [][] = {
            {"청동기 시대에는 미송리식 토기, 팽이형 토기, 민무늬 토기, 붉은 간 토기 등이 제작되었다.", "청동기 시대 후기에 이르면서 한반도 내에서는 비파형 동검이 세형 동검으로, 거친무늬 거울이 잔무늬 거울로 바뀌었다.", "식량 생산이 늘어나고 인구가 증가하면서 빈부 격차와 사회 분화가 나타났다.", "보리, 밀, 팥, 콩, 조, 기장 등이 재배되었으나, 아직 벼농사는 이루어지지 않았다."},
            {"(가) 신부의 집 뒤에 서옥을 짓고 훗날 자녀가 태어나 성장하면 아내와 함께 신랑 집으로 돌아가는 풍습이 있었다.", "(가)중대한 범죄자가 있으면 제가회의를 통해 사형시키고 그 가족은 노비로 삼았다.","(나) 족장들은 저마다 따로 행정 구획인 사출도를 다스렸다.","(나) 씨족끼리는 혼인하지 않는 족외혼 풍습과 다른 읍락의 경계를 침범하면 소, 말, 노비로 보상하는 책화라는 풍습이 있었다."},
            {"(가) 국내성, (나) 고국천왕, (다) 고이왕,   (라) 지증왕", "(가) 평양성, (나) 고국원왕, (다) 근초고왕, (라) 내물왕", "(가) 국내성, (나) 고국천왕, (다) 고이왕,   (라) 내물왕","(가) 평양성, (나) 고국원왕, (다) 근초고왕, (라) 지증왕"},
            {" 8세기 후반 혜공왕이 피살된 이후 150여 년 동안 20여 명의  왕이 교체되는 등 진골 귀족의 왕위 쟁탈전이 심화되었다.", "당에서 돌아온 6두품 계열의 유학생들이 제시한 개혁안이 정치에 반영되었다.", "농민에 대한 수탈이 심해지면서 원종과 애노의 난을 시작으로 농민 봉기가 전국 각지에서 일어났다.","견훤은 완산주에 도읍을 정하고 후백제를 세웠고, 궁예는 송악에 도읍을 정하고 후고구려를 세웠다.\n"},
            {"적극적인 북진정책의 결과로 북쪽 국경선이 대동강을 넘어 청천강 선으로, 동북으로는 원산만에서 영흥(永興)까지 확대되었다.", "자색(紫色), 단색(丹色), 비색(緋色), 녹색(綠色)으로 백관의 공복을 제정하였다.", "중앙문관에게는 문산계를, 지방호족인 향리와 노병 등에게는 무산계를 부여하는 등 관료와 호족들의 서열화를 더욱 확실하게 만들었다.","교종과 선종의 불교계를 정리하기 위해 교종의 여러 종파를 화엄종을 중심으로 통합하고, 선종의 여러 종파를 법안종을 중심으로 정리하고자 했다."},


            {" 전국을 크게 5도와 양계, 경기로 나누고, 그 안에 3경, 4도호부, 8목을 비롯하여 군·현·진을 설치하였다.", "경은 중앙과 지방의 군현을 잇는 중간 역할을 담당한 기구의 하나로, 서경(평양), 동경(경주), 남경(양주, 지금의 서울)이 설치되었다.", "지방 출신 고급 관리를 사심관으로 임명하여 향리를 견제하도록 한 한편, 상수리제도를 실시하여 향리 자제를 개경에 강제로 이주시켜 지방 일의 자문에 응하게 했다.","북방의 국경 지대에는 동계·북계의 양계를 설치하여 병마사를 파견하고, 국방상의 요충지에는 진을 설치하였는데, 이것은 군사적인 특수 지역이었다."},
            {"㉢ → ㉡ → ㉠ → ㉣", "㉣ → ㉠ → ㉡ → ㉢", "㉣ → ㉡ → ㉠ → ㉢","㉢ → ㉠ → ㉡ → ㉣"},
            {"다포 양식은 공포가 기둥 위뿐만 아니라 기둥 사이에도 짜여져 있는 양식으로 황해도 사리원의 성불사 응진전은 대표적인 고려 시대 다포 양식의 건물이다.", "신라 불상의 양식을 계승한 논산 관촉사 석조 미륵보살 입상은 균형미가 뛰어난 걸작이다.", "서예는 고려 전기 구양순체가 주류를 이루었고, 후기에는 송설체가 유행했다.","고려 후기 왕실과 권문세족의 구복적 요구에 따라 극락왕생을 기원하는 아미타불도와 지장보살도 같은 불화가 많이 그려졌다."},
            {"12세기 초 윤관의 건의로 별무반을 편성하여 여진족을 북방으로 밀어 내고 동북 지방 일대에 9개의 성을 쌓았다.", "몽골의 침입으로 황룡사 9층탑, 부인사 대장경을 비롯한 많은 문화재가 소실되는 피해를 입었다.", "고려 정부가 개경으로 환도하자, 삼별초는 진도와 제주도로 근거지를 옮기면서 대몽 항쟁을 계속하였다.","몽골의 침입으로 공민왕이 복주(안동)까지 피난하는 등 국가적 위기가 찾아왔다."},
            {"침입하는 왜구를 홍산에서 격퇴하였다.", "화통도감에서 각종 화기를 제조하여 왜구 격퇴에 사용하였다", "황산에서 적장 아지발도를 사살하는 등 왜구를 섬멸하였다.","관음포 앞바다에서 왜선 120여 척을 격침시켰다."},

            {"조선 성종 때 시행된 관수관급제는 수조권자의 과다한 수취를 막기 위해 국가가 수조를 대행하는 제도이다.", "조선 명종 때 직전법이 폐지됨에 따라 자영농의 숫자가 급속히 늘어나게 되었다.", "과전의 세습 등으로 관료에게 지급할 토지가 부족해지자 현직 관리에게만 토지를 지급하는 직전법을 시행하였다.","과전법 체제에서는 관료가 사망한 이후 수신전과 휼양전이 죽은 관료의 가족에게 지급되기도 하였다."},
            {"문과(대과)의 복시에서는 33명을 뽑았고, 이들은 다시 전시를 보았다.", "문과(대과)의 최종 합격자는 지역과 상관없이 성적에 따라 갑·을·병으로 나뉘었다.", "무과는 문과처럼 대과와 소과의 구별은 없었으나 초시·복시·전시를 치르는 것은 문과와 마찬가지였다.","소과 복시의 합격자 수는 각 도의 인구 비율로 배분되었다."},
            {" ㉠ → ㉡ → ㉢ → ㉣", " ㉠ → ㉡ → ㉢ → ㉣", "㉠ → ㉡ → ㉣ → ㉢","㉡ → ㉠ → ㉣ → ㉢"},
            {"영조 때에 한원진과 윤봉구로 대표되는 충청도 노론은 인성(人性)과 물성(物性)은 다르다고 보는 ‘인물성이론(人物性異論)’을 내세웠다.", "호론의 주장에는 청나라를 중화로 보려는 대의명분론이 깔려 있었다.", "이간, 김창협 등으로 대표되는 서울 중심의 노론은 인성과 물성이 같다는 ‘인물성동론(人物性同論)’을 주장하였다.","낙론의 주장은 북학파의 과학기술 존중과 이용후생사상으로 이어졌다."},
            {"㉠ → ㉡ → ㉢ → ㉣", "㉡ → ㉢ → ㉣ → ㉠", "㉢ → ㉠ → ㉡ → ㉣","㉣ → ㉢ → ㉡ → ㉠"},

            {"만동묘를 철폐하고 폐단이 큰 서원을 철폐하도록 하였다.", "만동묘를 철폐하고 폐단이 큰 서원을 철폐하도록 하였다.만동묘를 철폐하고 폐단이 큰 서원을 철폐하도록 하였다.", "임진왜란 때 소실된 경복궁을 재건하고, 광화문 앞의 육조 거리 등 한양의 도시 구조를 복원하였다.","정치 제도를 개혁하기 위하여 비변사의 기능을 강화하였다."},
            {"대한제국의 헌법인 ‘대한국국제’는 국민의 기본권과 통치권에 대한 규정을 두었다.", "대한제국의 헌법인 ‘대한국국제’는 국민의 기본권과 통치권에 대한 규정을 두었다.", "‘대한국국제’는 황제에게 육·해군의 통수권이 있음을 명시하였다.","대한제국은 입헌군주제와 의회 설립을 통한 민주주의 체제를 지향하였다."},
            {"㉠, ㉣", "㉡, ㉣", "㉠, ㉢","㉡, ㉢"},
            {"일본은 국권침탈 이후 본격적으로 토지침탈정책을 추진하기 위하여 ‘토지조사사업’을 실시하였다.", "중추원은 총독부 자문기구로서 1919년 3·1 운동이 일어나기 전까지는 수시로 개최되어 식민 행정에 간여하였다.", "우리 민족 기업을 탄압하고 조선인의 회사 설립을 통제하기 위하여 ‘회사령’을 공포하여 회사를 설립할 경우 총독부의 허가를 받도록 하였다.","일본은 광산·어장·산림 등 자원에 대해서도 수탈을 강화하였다."},
            {"㉠ → ㉡ → ㉢ → ㉣", "㉠ → ㉡ → ㉣ → ㉢", "㉡ → ㉠ → ㉢ → ㉣","㉡ → ㉠ → ㉣ → ㉢"},



    };







    public static String mCorrectAnswers[] =
            {"보리, 밀, 팥, 콩, 조, 기장 등이 재배되었으나, 아직 벼농사는 이루어지지 않았다.",
            "(나) 씨족끼리는 혼인하지 않는 족외혼 풍습과 다른 읍락의 경계를 침범하면 소, 말, 노비로 보상하는 책화라는 풍습이 있었다.",
            "(가) 국내성, (나) 고국천왕, (다) 고이왕,   (라) 내물왕",
            "당에서 돌아온 6두품 계열의 유학생들이 제시한 개혁안이 정치에 반영되었다.",
            "중앙문관에게는 문산계를, 지방호족인 향리와 노병 등에게는 무산계를 부여하는 등 관료와 호족들의 서열화를 더욱 확실하게 만들었다.",


            "지방 출신 고급 관리를 사심관으로 임명하여 향리를 견제하도록 한 한편, 상수리제도를 실시하여 향리 자제를 개경에 강제로 이주시켜 지방 일의 자문에 응하게 했다.",
            "㉢ → ㉡ → ㉠ → ㉣",
            "신라 불상의 양식을 계승한 논산 관촉사 석조 미륵보살 입상은 균형미가 뛰어난 걸작이다.",
            "몽골의 침입으로 공민왕이 복주(안동)까지 피난하는 등 국가적 위기가 찾아왔다.",
            "침입하는 왜구를 홍산에서 격퇴하였다.",

            "조선 명종 때 직전법이 폐지됨에 따라 자영농의 숫자가 급속히 늘어나게 되었다.",
            "소과 복시의 합격자 수는 각 도의 인구 비율로 배분되었다.",
            "㉠ → ㉡ → ㉢ → ㉣",
            "호론의 주장에는 청나라를 중화로 보려는 대의명분론이 깔려 있었다.",
            "㉡ → ㉢ → ㉣ → ㉠",

            "정치 제도를 개혁하기 위하여 비변사의 기능을 강화하였다.",
            "‘대한국국제’는 황제에게 육·해군의 통수권이 있음을 명시하였다.",
            "㉠, ㉢",
            "중추원은 총독부 자문기구로서 1919년 3·1 운동이 일어나기 전까지는 수시로 개최되어 식민 행정에 간여하였다.",
            "㉠ → ㉡ → ㉣ → ㉢"
    };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


