package com.example.admin.police1;


public class QuestionLibrary2016_1 {

    //2018 3월 24일  경찰 경찰학개론


    public   static  String mQuestions [] = {



            "1." +
                    "선사시대의 생활상과 문화에 대한 설명으로 가장 적절하지 않은 것은?",


            "2." +
                    "다음 설명 중 옳은 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 부여에서는 가족이 죽으면 시체를 가매장하였다가 나중에 그 뼈를 추려서 가족 공동 무덤인 커다란 목곽에 안치하는 풍속이 있었다.\n" +
                    "\n㉡ 고구려에서는 수렵사회의 전통을 보여 주는 제천행사가 12월에 열렸다.\n" +
                    "\n㉢ 옥저에서는 전쟁이 일어났을 때 제천 의식을 행하고, 소를 죽여 그 굽으로 길흉을 점치는 풍속이 있었다.\n" +
                    "\n㉣ 동예에서는 명주와 삼베를 짜는 방직 기술이 발달하였고, 특산물로는 말, 주옥, 모피 등이 유명하였다.\n" +
                    "\n㉤ 삼한의 지배자 중에서 세력이 큰 것은 신지, 작은 것은 읍차 등으로 불렸다.",



            "3." +
                    "음은 신라의 어느 왕에 대한 기록이다. 이 왕의 재위기간에 있었던 일로 가장 적절한 것은?" +
                    "\n\n\n여러 신하들이 아뢰기를 “시조께서 나라를 세우신 이래 국호(國號)를 정하지 않아 사라(斯羅)라고도 하고 혹은 사로(斯盧) 또는 신라(新羅)라고도 칭하였습니다. 신들의 생각으로는 신(新)은 ‘덕업이 날로 새로워진다.’는 뜻이고 나(羅)는 ‘사방을 망라한다.’는 뜻이므로, 이를 국호로 삼는 것이 마땅하다고 여겨집니다. …… 이제 뭇 신하들이 한 마음으로 삼가 신라국왕이라는 칭호를 올립니다.”라고 하니, 왕이 이에 따랐다.\n" +
                    "\n\n\n- 삼국사기 -",


            "4. " +
                    "다음 중 역사 편찬에 관한 설명으로 가장 적절하지 않은 것은?",





            "5. " +
                    "다음에 제시된 역사적 사건들을 시기 순으로 바르게 나열한 것은?" +
                    "\n\n\n㉠ 발해가 거란에 의하여 멸망하였다.\n" +
                    "\n㉡ 신라의 경순왕이 왕건에게 항복하였다.\n" +
                    "\n㉢ 왕건이 후백제를 정벌하여 후삼국을 통일하였다.\n" +
                    "\n㉣ 왕건은 고구려 계승을 내세워 국호를 고려라 하고 송악으로 도읍을 옮겼다.",





            "6. " +
                    "고려시대의 토지 제도에 대한 설명으로 가장 적절한 것은?",



            "7. " +
                    "고려시대의 통치 체제에 대한 설명으로 가장 적절하지 않은 것은?" ,





            "8. " +
                    "다음의 ㉠~㉢과 관련된 설명으로 가장 적절한 것은?" +
                    "\n\n\n심하도다. (  ㉠  )의 환란이여. 잔인한 것은 말할 것도 없고, 지극히 어리석기는 짐승보다 심하니, 어찌 천하에서 공경하는 바를 알겠으며, 불법(佛法)이 있음을 알겠습니까? 그들은 지나가는 곳마다 불상과 불서를 모두 불태워 ㉡부인사에 소장된 대장경 판본도 남기지 않고 쓸어버렸습니다. …… 이런 큰 보물이 없어졌는데 어찌 감히 역사(役事)가 클 것을 염려하며, ㉢고쳐 만드는 일을 주저할 수 있겠습니까?                    \n" +
                    "\n\n- 이규보, 「동국이상국집」-",




            "9. " +
                    "고려시대의 불교에 대한 설명으로 가장 적절하지 않은 것은?",



            "10. " +
                    "다음 (가)~(다)는 조선시대의 토지 제도에 대한 내용이다. 이에 대한 설명으로 가장 적절한 것은?" +
                    "\n\n\n(가) 국가재정을 확충하고 신진 사대부의 경제적 기반을 확보하기 위해 만들었다.\n" +
                    "\n(나) 과전의 세습 등으로 관료에게 지급할 토지가 부족해지자 현직 관리에게만 수조권을 지급하였다.\n" +
                    "\n(다) 지방 관청에서 그 해의 생산량을 조사하여 거두고 관리들에게 나누어 주었다.",





            "11." +
                    "다음 중 조선시대 향촌 사회의 모습에 대한 설명으로 옳은 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 유향소는 수령을 보좌하고 향리를 감찰하며 향촌 사회의 풍속을 바로잡기 위한 기구였다.\n" +
                    "\n㉡ 경재소는 중앙 정부가 현직 관료로 하여금 연고지의 유향소를 통제하게 하는 제도로서, 중앙과 지방의 연락 업무를 맡았다.\n" +
                    "\n㉢ 향촌 사회에서 지주로 농민을 지배하던 계층은 사족(士族)이었다.\n" +
                    "\n㉣ 향약은 중종 때 조광조가 처음 시행한 이후 전국적으로 확산되었다.",




            "12." +
                    "다음은 조선의 어느 왕에 대한 기록이다. 이 왕의 재위기간에 있었던 일로 가장 적절하지 않은 것은?" +
                    "\n\n\n상왕(단종)이 어려서 무릇 조치하는 바는 모두 대신에게 맡겨 논의 시행하였다. 지금 내가 명을 받아 왕통을 계승하여 군국 서무를 아울러 모두 처리하며, 조종의 옛 제도를 모두 복구한다.",




            "13. " +
                    " 다음 중 조선시대 성리학자에 대한 설명으로 틀린 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 이황은 군주 스스로가 성학을 따라야 한다는 「성학집요」를 저술하였다.\n" +
                    "\n㉡ 이이의 저서「주자사절요」는 임진왜란 이후 일본에 전해져 일본 성리학 발달에 많은 영향을 주었다.\n" +
                    "\n㉢ 서경덕은 이(理)보다는 기(氣)를 중심으로 세계를 이해하고 불교와 노장사상에 대해서 개방적인 태도를 지녔다.\n" +
                    "\n㉣ 이언적은 이(理)보다는 기(氣)를 중심으로 자신의 이론을 전개하여 후대에 큰 영향을 끼쳤다.\n" +
                    "\n㉤ 조식은 노장 사상에 포용적이었으며 학문의 실천성을 특히 강조하였다.",




            "14. " +
                    "다음은 조선의 어느 왕에 대한 시책문이다. 이 왕의 재위기간에 있었던 일로 가장 적절한 것은?" +
                    "\n\n\n적전(籍田)을 가는 쟁기를 잡으시니 근본을 중시하는 거동이 아름답고, 혹독한 형벌을 없애라는 명을 내리시니 살리기를 좋아하는 덕이 성대하였다. …… 정포(丁布)를 고루 줄이신 은혜로 말하면 천명을 받아 백성을 보전할 기회에 크게 부합되었거니와 위를 덜어 아래를 더하며 어염세(魚鹽稅)도 아울러 감면되고, 여자·남자가 기뻐하여 양잠·농경이 각각 제자리를 얻었습니다. ",


            "15." +
                    "조선시대의 국학 연구에 대한 설명으로 가장 적절하지 않은 것은?",



            "16. " +
                    "다음은 근대 변혁 운동 과정에서 발표된 개혁안 중 일부이다. 이를 시기 순으로 바르게 나열한 것은?" +
                    "\n\n\n㉠ 조세의 징수와 경비 지출은 모두 탁지아문에서 관할한다.\n" +
                    "\n㉡ 지조법을 개정하여 관리의 부정을 막고 백성을 구제하며 국가 재정을 충실케 한다.\n" +
                    "\n㉢ 국가 재정은 탁지부가 전관하고 예산과 결산을 인민에게 공포할 것.\n" +
                    "\n㉣ 무명 잡세는 일체 거두지 않는다.",



            "17. " +
                    "다음 중 개화기 언론에 대한 설명으로 옳은 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 국·한문 혼용체를 사용한 황성 신문은 장지연의 ‘시일야방성대곡’을 실어 을사조약을 비판하고 민족의식을 고취하였다.\n" +
                    "\n㉡ 순 한글로 간행된 제국 신문은 창간 이듬해 이인직이 인수하였고, 이후 제국 신문은 친일지로 개편되었다.\n" +
                    "\n㉢ 대한 매일 신보는 영국인 베델과 양기탁에 의하여 설립되었고, 경제적 국권 회복 운동인 국채 보상 운동에도 앞장섰다.\n" +
                    "\n㉣ 우리나라 최초의 신문인 한성 순보는 관보적 성격을 띠고 한문으로 발행되었다.\n" +
                    "\n㉤ 일본은 1909년 신문지법을 제정하여 언론에 대한 탄압을 강화하였다.",





            "18. " +
                    "다음은 대한제국과 일본이 체결한 각 조약의 내용을 일부 발췌한 것이다. 이를 시기 순으로 바르게 나열한 것은?" +
                    "\n\n\n㉠ 한국 황제 밑에 1명의 통감을 두되 통감은 오로지 외교에 관한 사항을 관리하기 위해 경성에 주재하고 친히 한국 황제폐하를 만날 수 있는 권리를 가진다.\n" +
                    "\n㉡ 대한제국 정부는 대일본제국 정부가 추천하는 일본인 1명을 재정 고문으로 삼아 재무에 관한 사항은 모두 그의 의견을 따른다.\n" +
                    "\n㉢ 한국 고등 관리의 임면은 통감의 동의로써 이를 행할 것.\n" +
                    "\n㉣ 한일 양국 간에 오래도록 변하지 않는 친교를 유지하고 동양 평화를 확립하기 위하여, 대한제국 정부는 대일본제국 정부를 확신하여 시정 개선에 관한 충고를 받아들인다.",





            "19. " +
                    "다음 선언을 지침으로 삼았던 애국 단체에 대한 설명으로 가장 적절하지 않은 것은?" +
                    "\n\n\n강도 일본이 우리의 국호를 없이하며, 우리의 정권을 빼앗으며, 우리 생존적 필요조건을 다 박탈하였다. …… 이상의 사실에 의하여 우리는 일본 강도 정치, 곧 다른 민족의 통치가 우리 조선 민족 생존의 적임을 선언하는 동시에, 우리는 혁명 수단으로 우리 생존의 적인 강도 일본을 살상하는 것이 곧 우리의 정당한 수단임을 선언하노라.",




            "20. " +
                    "(가)가 발표된 시점과 (나)가 발표된 시점 사이에 있었던 사실로 가장 적절하지 않은 것은?" +
                    "\n\n\n(가) 첫째, 통일은 외세에 의존하거나 외세의 간섭을 받음이 없이 자주적으로 해결하여야 한다. \n" +
                    "    둘째, 통일은 서로 상대방을 반대하는 무력행사에 의거하지 않고 평화적인 방법으로 실현하여야 한다. \n" +
                    "    셋째, 사상과 이념, 제도의 차이를 초월하여 우선 하나의 민족으로서 민족적 대단결을 도모하여야 한다.\n" +
                    "\n" +
                    "\n(나) 제1조 남과 북은 서로 상대방의 체제를 인정하고 존중한다.\n" +
                    "    제4조 남과 북은 상대방을 파괴·전복하려는 일체 행위를 하지 아니한다. \n" +
                    "    제15조 남과 북은 민족 경제의 통일적이며 균형적인 발전과 민족 전체의 복리 향상을 도모하기 위하여 자원의 공동 개발, 민족 내부 교류로서의 물자 교류, 합작 투자 등 경제 교류와 협력을 실시한다.",


    };





    public  static String mChoices [][] = {


            //1

            {"슴베찌르개는 주로 구석기 시대 후기에 사용하였는데, 이것은 창의 기능을 하였다.",
                    "황해도 봉산 지탑리와 평양 남경의 유적에서는 탄화된 좁쌀이 발견되는 것으로 보아 신석기 시대에 잡곡류를 경작하였음을 알 수 있다.",
                    "신석기 시대의 집터는 대개 움집 자리로, 바닥은 원형이나 모서리가 둥근 사각형이며, 움집의 중앙에 화덕이 위치하였다.",
                    "청동기 시대의 토기로는 미송리식 토기, 이른 민무늬 토기, 덧무늬 토기가 대표적이다."},



            //2

            {"1개",
                    "2개",
                    "3개",
                    "4개"},


            //3

            {"우산국을 복속시켜 영토로 편입하였다.",
                    "율령의 반포, 공복의 제정 등을 통하여 통치 질서를 확립하였다.",
                    "화랑도를 국가적인 조직으로 개편하였다.",
                    "유교 교육을 위하여 국학을 설립하였다."},

            //4

            {"고구려에서는 일찍부터 「유기」가 편찬되었으며, 영양왕 때 이문진이 이를 간추려 「신집」5권을 편찬하였다.",
                    "백제에서는 근초고왕 때 고흥이 「서기」를 편찬하였다.",
                    "신라에서는 진흥왕 때 거칠부가 「국사」를 편찬하였다.",
                    "삼국 통일 이후, 김대문은 「화랑세기」, 「고승전」, 「제왕연대력」을 편찬하였다."},


            //5

            {"㉠ - ㉣ - ㉡ - ㉢",
                    "㉠ - ㉣ - ㉢ - ㉡",
                    "㉣ - ㉠ - ㉡ - ㉢",
                    "㉣ - ㉠ - ㉢ - ㉡"},



            //6

            {"경종 때 처음 전시과 제도를 만들었으며, 문종 때에는 지급 대상을 현직 관료로 제한하였다.",
                    "개정전시과에서는 관등의 고하와 인품을 함께 반영하여 토지를 지급하였다.",
                    "중앙과 지방의 각 관청에는 내장전(內莊田)을 지급하여 경비를 충당하게 하였다.",
                    "군인의 유가족에게는 군인전(軍人田)을, 6품 이하 하급관료의 자제로서 관직에 오르지 못한 사람에게는 구분전(口分田)을 지급하였다."},


            //7

            {"중서문하성은 국가의 정책을 심의하는 재신과 정치의 잘못을 비판하는 낭사로 구성되었다.",
                    "중추원은 군사기밀을 담당하는 추밀과 왕명의 출납을 담당하는 승선으로 구성되었다.",
                    "대간은 왕의 잘못을 논하는 간쟁과 잘못된 왕명을 시행하지 않고 되돌려 보내는 봉박, 관리의 임명과 법령의 개정이나 폐지 등에 동의하는 서경권을 가지고 있었다.",
                    "원 간섭기에 중서문하성과 중추원을 합쳐 첨의부로 하고, 6부는 4사로 통폐합되었다."},


            //8

            {"㉠은 송과 연합하여 요를 멸망시킨 후 송을 침략하여 강남으로 몰아냈다.",
                    "㉠과의 전쟁이 끝난 후 고려는 개경에 나성을 쌓아 도성 수비를 강화하였으며, 북쪽 국경 일대에 천리장성을 쌓았다.",
                    "㉡은 부처의 도움으로 여진을 퇴치하려고 만든 금속활자 인쇄본이다.",
                    "㉢에 따라 만들어진 대장경판은 현재 합천 해인사에 보관되어 있다."},

            //9

            {"광종 때부터 승과 제도를 실시하여 합격한 자에게는 승계(僧階)를 주고 승려의 지위를 보장하였다.",
                    "공민왕 때 개혁 정치를 추진한 신돈은 9산선문의 통합을 주장하였다.",
                    "지눌은 승려 본연의 자세로 돌아가 독경과 선 수행, 노동에 고루 힘쓰자는 개혁운동인 수선사 결사를 제창하였다.",
                    "고려 초기에는 화엄 사상을 정비하고 보살의 실천행을 폈던 균여의 화엄종이 성행하였다."},

            //10

            {"(가)는 경기 지방을 비롯한 전국의 토지로 지급하였는데, 받은 사람이 죽거나 반역을 하면 국가에 반환하도록 정해져 있었다.",
                    "(가)는 관료에게 전지와 시지에 대한 수조권을 함께 지급하였다.",
                    "(나)는 (다)가 시행된 이후에 폐지되었다.",
                    "(다)가 실시되어 국가의 토지 지배권이 약화되었다."},

            //11


            {"1개",
                    "2개",
                    "3개",
                    "4개"},


            //12

            {"집현전을 혁파하고 경연제도를 폐지하였다.",
                    "통치 규범을 마련하려는 목적에서 조선경국전, 경제육전 등의 법전을 편찬하였다.",
                    "강력한 왕권을 행사하기 위하여 통치 체제를 다시 6조 직계제로 고쳤다.",
                    "간경도감을 설치하여 불교 경전을 한글로 번역하여 간행·보급하였고, 원각사지 10층 석탑을 건립하였다."},

            //13

            {"1개",
                    "2개",
                    "3개",
                    "4개"},




            //14

            {"속대전을 편찬하여 법전 체계를 정리하였다.",
                    "신진 인물이나 중·하급관리 중에서 유능한 인사를 재교육하는 초계문신 제도를 시행하였다.",
                    "김육, 김상범의 노력으로 청나라를 통해 시헌력을 도입하였다.",
                    "홍문관을 두어 관원 모두에게 경영관을 겸하게 함으로써 집현전을 계승하였다."},


            //15

            {"유득공은 「발해고」를 저술하여 발해사 연구를 심화하였다.",
                    "안정복은 「동사강목」을 저술하여 조선시대의 정치와 문화를 야사를 중심으로 정리하였다.",
                    "김정희는 「금석과안록」을 지어 북한산비가 진흥왕 순수비임을 밝혔다.",
                    "한치윤은 500여 종의 중국 및 일본의 자료를 참고하여 기전체 형식의 「해동역사」를 저술하였다."},


            //16

            {"㉠ - ㉢ - ㉡ - ㉣",
                    "㉠ - ㉢ - ㉣ - ㉡",
                    "㉡ - ㉣ - ㉠ - ㉢",
                    "㉡ - ㉣ - ㉢ - ㉠"},
            //17

            {"1개",
                    "2개",
                    "3개",
                    "4개"},



            //18

            {"㉡ - ㉣ - ㉠ - ㉢",
                    "㉡ - ㉣ - ㉢ - ㉠",
                    "㉣ - ㉠ - ㉢ - ㉡",
                    "㉣ - ㉡ - ㉠ - ㉢"},




            //19

            {"3·1 운동 이후 만주 길림에서 김원봉, 윤세주 등이 조직한 단체이다.",
                    "혁명 투사·독립 운동 지도자를 양성하기 위한 조선 혁명 간부 학교를 설립·운영하였다.",
                    "위 단체의 단원 나석주는 조선총독부에 폭탄을 투척하였다.",
                    "원들이 황포 군관 학교에 입학하여 군사 교육을 받았다."},
            //20

            {"6·23 평화통일외교정책선언이 발표되었다.",
                    "통일을 위한 남측의 연합제 안과 북측의 낮은 단계의 연방제 안의 공통성을 인정하는 선언을 발표하였다.",
                    "남북한이 동시에 유엔에 가입하였다.",
                    "분단 이후 최초로 남북한 이산가족의 상봉이 실현되었다."},





    };


    public static String mCorrectAnswers[] =
            //1
            {"청동기 시대의 토기로는 미송리식 토기, 이른 민무늬 토기, 덧무늬 토기가 대표적이다.",

                    //2

                    "1개",

                    //3

                    "우산국을 복속시켜 영토로 편입하였다.",

                    //4

                    "삼국 통일 이후, 김대문은 「화랑세기」, 「고승전」, 「제왕연대력」을 편찬하였다.",

                    //5
                    "㉣ - ㉠ - ㉡ - ㉢",


                    //6
                    "경종 때 처음 전시과 제도를 만들었으며, 문종 때에는 지급 대상을 현직 관료로 제한하였다.",

                    //7
                    "원 간섭기에 중서문하성과 중추원을 합쳐 첨의부로 하고, 6부는 4사로 통폐합되었다.",

                    //8

                    "㉢에 따라 만들어진 대장경판은 현재 합천 해인사에 보관되어 있다.",

                    //9

                    "공민왕 때 개혁 정치를 추진한 신돈은 9산선문의 통합을 주장하였다.",


                    //10

                    "(나)는 (다)가 시행된 이후에 폐지되었다.",

                    //11

                    "4개",


                    //12
                    "통치 규범을 마련하려는 목적에서 조선경국전, 경제육전 등의 법전을 편찬하였다.",

                    //13
                    "3개",

                    //14
                    "속대전을 편찬하여 법전 체계를 정리하였다.",


                    //15
                    "안정복은 「동사강목」을 저술하여 조선시대의 정치와 문화를 야사를 중심으로 정리하였다.",


                    //16
                    "㉡ - ㉣ - ㉠ - ㉢",

                    //17
                    "3개",

                    //18
                    "㉣ - ㉡ - ㉠ - ㉢",

                    //19
                    "위 단체의 단원 나석주는 조선총독부에 폭탄을 투척하였다.",

                    //20
                    "통일을 위한 남측의 연합제 안과 북측의 낮은 단계의 연방제 안의 공통성을 인정하는 선언을 발표하였다.",
            };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


