package com.example.admin.police1;


public class QuestionLibrary2016_4 {

    //2018 3월 24일  경찰 경찰학개론


    public   static  String mQuestions [] = {



            "1." +
                    "형사소송법의 적용범위에 관한 다음 설명 중 가장 적절하지 않은 것은?(다툼이 있으면 판례에 의함)",


            "2." +
                    "고소와 관련한 다음 설명 중 가장 적절하지 않은 것은? (다툼이 있으면 판례에 의함)",



            "3." +
                    "피의자신문에 관한 다음 설명 중 가장 적절한 것은?(다툼이 있으면 판례에 의함)",


            "4. " +
                    "현행범인 또는 준현행범인 체포에 관한 다음 설명 중 옳은 것은 모두 몇 개인가?(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 현행범인은 누구든지 영장 없이 체포할 수 있는데, 현행범인으로 체포하기 위하여는 행위의 가벌성, 범죄의 현행성·시간적 접착성, 범인·범죄의 명백성 이외에 체포의 필요성 즉, 도망 또는 증거인멸의 염려가 있어야 하는 것은 아니다.\n" +
                    "\n㉡‘범죄의 실행행위를 종료한 직후’라고 함은 범죄행위를 실행하여 끝마친 순간 또는 이에 아주 접착된 시간적 단계를 의미하는 것으로 해석되므로, 시간적으로나 장소적으로 보아 체포를 당하는 자가 방금 범죄를 실행한 범인이라는 점에 관한 죄증이 명백히 존재하는 것으로 인정되는 경우에만 현행범인으로 볼 수 있다. \n" +
                    "\n㉢ 경찰관의 현행범인 체포경위 및 그에 관한 현행범인체포서와 범죄사실의 기재에 다소 차이가 있더라도, 그것이 논리와 경험칙상 장소적·시간적 동일성이 인정되는 범위 내라면 그 체포행위가 공무집행방해죄의 요건인 적법한 공무집행에 해당한다.\n" +
                    "\n㉣ 다액 50만원 이하의 벌금, 구류 또는 과료에 해당하는 죄의 현행범인에 대하여는 범인의 주거가 분명하지 아니한 때에 한하여 현행범인으로 체포할 수 있다.\n" +
                    "\n㉤ 사법경찰관리가 현행범인의 인도를 받은 때에는 체포자의 성명, 주거, 체포의 사유를 물어야 하고 필요하더라도 체포자에 대하여 경찰관서에 동행함을 요구할 수는 없다.",





            "5. " +
                    "구속에 관한 다음 설명 중 가장 적절하지 않은 것은?(다툼이 있으면 판례에 의함)",





            "6. " +
                    "접견교통권에 관한 다음 설명 중 틀린 것은 모두 몇 개인가? (다툼이 있으면 판례에 의함)",



            "7. " +
                    "체포·구속적부심사에 관한 다음 설명 중 가장 적절하지 않은 것은?(다툼이 있으면 판례에 의함)" ,





            "8. " +
                    "압수·수색에 관한 다음 설명 중 틀린 것은 모두 몇 개인가?(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 압수·수색영장에서 압수할 물건을 ‘압수장소에 보관중인 물건’이라고 기재하고 있는 것을 ‘압수장소에 현존하는 물건’으로 해석할 수는 없다.\n" +
                    "\n㉡ 소유자, 소지자 또는 보관자가 아닌 자로부터 제출받은 물건을 영장없이 압수한 ‘압수물’및 ‘압수물을 찍은 사진’은 이를 유죄 인정의 증거로 사용할 수 없지만 피고인이나 변호인이 이를 증거로 함에 동의하였다면 증거능력이 인정된다.\n" +
                    "\n㉢ 수사기관이 압수·수색에 착수하면서 그 장소의 관리책임자에게 영장을 제시하였다면 물건을 소지하고 있는 다른 사람으로부터 이를 압수하고자 하는 때 그 사람에게 따로 영장을 제시할 필요는 없다.\n" +
                    "\n㉣ 검사가 공소제기 후  형사소송법 제215조에 따라 수소법원 이외의 지방법원 판사에게 청구하여 발부받은 영장에 의하여 압수·수색을 하였다면, 그와 같이 수집된 증거는 원칙적으로 유죄의 증거로 삼을 수 없다.\n" +
                    "\n㉤ 전자정보에 대한 압수·수색에 있어 저장매체 자체를 외부로 반출하거나 하드카피·이미징 등의 형태로 복제본을 만들어 외부에서 저장매체나 복제본에 대하여 압수·수색이 허용되는 예외적인 경우에도 혐의사실과 관련된 전자정보 이외에 이와 무관한 전자정보를 탐색·복제·출력하는 것은 원칙적으로 위법한 압수·수색에 해당하므로 허용될 수 없다.",




            "9. " +
                    "공소시효에 관한 다음 설명 중 가장 적절한 것은?(다툼이 있으면 판례에 의함)",



            "10. " +
                    "형사소송법」상 공소장변경에 관한 다음 설명 중 틀린 것은 모두 몇 개인가?(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 피고인의 방어권 행사에 실질적인 불이익을 초래할 염려가 없는 경우에는 공소사실과 기본적 사실이 동일한 범위 내에서 법원이 공소장변경절차를 거치지 아니하고 다르게 사실을 인정하더라도 불고불리 원칙에 위배되지 아니한다.\n" +
                    "\n㉡ 공소장변경 절차 없이도 법원이 심리·판단할 수 있는 죄가 한 개가 아니라 여러 개인 경우에는, 법원으로서는 그 중 하나를 임의로 선택할 수 있고, 검사에게 공소사실 및 적용법조에 관한 석명을 구하여 공소장을 보완하게 한 다음 이에 따라 심리·판단하여야 할 것은 아니다.\n" +
                    "\n㉢ 공소사실 또는 적용법조의 추가, 철회 또는 변경의 허가에 관한 결정은 판결전의 소송절차에 관한 결정이라 할 것이므로, 그 결정을 함에 있어서 저지른 위법이 판결에 영향을 미친 경우에 한하여 그 판결에 대하여 상소를 하여 다툼으로써 불복하는 외에는 당사자가 이에 대하여 독립하여 상소할 수 없다.\n" +
                    "\n㉣ 검사가 단순사기의 공소사실에 형법 제347조 제1항을 적용하여 기소한 경우에는 비록 상습성이 인정된다고 하더라도 공소장의 변경 없이는 법원이 상습사기로 인정하여 처벌할 수는 없다.\n" +
                    "\n㉤ 검사가 형법 제307조 제1항의 사실적시 명예훼손죄로 기소한 공소사실에 대하여 법원이 공소장의 변경 없이 그보다 형이 중한 형법 제307조 제2항의 허위사실적시 명예훼손죄를 인정하는 것은 피고인의 방어권 행사에 불이익을 주는 것으로서 허용될 수 없다.",





            "11." +
                    "｢형사소송법｣ 상 증거개시제도에 관한 다음 설명 중 옳은 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 피고인 또는 변호인은 검사에게 공소제기된 사건에 관한 서류 또는 물건(이하 ‘서류등’이라 한다)의 목록을 열람·등사 또는 서면의 교부를 신청할 수 있으며, 피고인에게 변호인이 있는 경우에도 피고인은 열람·등사 또는 서면의 교부를 신청할 수 있다.\n" +
                    "\n㉡ 검사는 피고인 또는 변호인의 신청이 있는 경우 서류 등의 목록에 대하여는 열람 또는 등사를 거부할 수 없다.\n" +
                    "\n㉢ 위 ㉠의 서류등은 도면·사진·녹음테이프·비디오테이프·컴퓨터용 디스크, 그 밖에 정보를 담기 위하여 만들어진 물건으로서 문서가 아닌 특수매체를 포함한다. \n" +
                    "\n㉣ 검사는 열람·등사 또는 서면의 교부를 거부하거나 그 범위를 제한하는 때에는 7일 이내에 피고인 또는 그 변호인에게 그 이유를 서면 또는 구두의 방법으로 통지하여야 한다.",




            "12." +
                    "「형사소송법」상 공판준비절차에 관한 다음 설명 중 가장 적절하지 않은 것은?",




            "13. " +
                    "증거조사에 관한 다음 설명 중 가장 적절한 것은?(다툼이 있으면 판례에 의함)",




            "14. " +
                    "다음 중 엄격한 증명의 대상인 것은?(다툼이 있으면 판례에 의함)",


            "15." +
                    "위법수집증거배제법칙에 관한 다음 설명 중 가장 적절하지 않은 것은?(다툼이 있으면 판례에 의함)",



            "16. " +
                    "피의자신문조서에 관한 다음 설명 중 틀린 것은 모두 몇 개인가?(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 당해 피고인과 공범관계에 있는 공동피고인에 대해 검사 이외의 수사기관이 작성한 피의자신문조서는 그 공동피고인의 법정진술에 의하여 성립의 진정이 인정되더라도 당해 피고인이 공판기일에서 그 조서의 내용을 부인하면 증거능력이 부정된다.\n" +
                    "\n㉡ 형사소송법 제312조 제3항의‘그 내용을 인정할 때’라 함은 피의자신문조서의 기재 내용이 진술 내용대로 기재되어 있다는 의미이고, 그와 같이 진술한 내용이 실제 사실과 부합한다는 것을 의미하는 것은 아니다. \n" +
                    "\n㉢ 피고인이 그 진술을 기재한 검사 작성의 피의자신문조서 중 일부에 관하여만 실질적 진정성립을 인정하는 경우에는 법원은 당해 조서 중 어느 부분이 그 진술대로 기재되어 있고 어느 부분이 달리 기재되어 있는지 여부를 구체적으로 심리함이 없이 전체 피의자신문조서의 증거능력을 부정하여야 한다.\n" +
                    "\n㉣ 피의자의 진술을 녹취 내지 기재한 서류 또는 문서가 수사기관에서의 조사 과정에서 작성된 것이라면, 그것이‘진술조서, 진술서, 자술서’라는 형식을 취하였다고 하더라도 피의자신문조서와 달리 볼 수 없다.",



            "17. " +
                    "탄핵증거에 관한 다음 설명 중 가장 적절하지 않은 것은? (다툼이 있는 경우 판례에 의함)",





            "18. " +
                    "보기의 사례에 관한 다음 설명 중 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n 甲과 乙은 공동으로 공원에서 술에 취하여 잠을 자고 있는 피해자 丙의 손목시계를 절취하였다는 공소사실로 기소되어 공동피고인으로 재판을 받고 있다. 공판정에서 甲은 공소사실을 자백하고 있으나, 乙은 공소사실을 부인하고 있다.",





            "19. " +
                    "재판의 효력에 관한 다음 설명 중 가장 적절하지 않은 것은?(다툼이 있으면 판례에 의함)",




            "20. " +
                    "재심에 관한 다음 설명 중 옳은 것은 모두 몇 개인가? (다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 특별사면으로 형 선고의 효력이 상실된 유죄의 확정판결도 형사소송법 제420조의‘유죄의 확정판결’에 해당하여 재심청구의 대상이 될 수 있다.\n" +
                    "\n㉡ 특별사면으로 형 선고의 효력이 상실된 유죄의 확정판결에 대하여 재심개시결정이 이루어져 재심심판법원이 심급에 따라 다시 심판한 결과 무죄로 인정되는 경우라면 무죄를 선고하여야 하겠지만, 그와 달리 유죄로 인정되는 경우에는, 재심심판법원으로서는‘피고인에 대하여 다시 형을 선고한다’는 주문을 선고할 수밖에 없다.\n" +
                    "\n㉢ 형사소송법 제420조 제7호의 재심사유 해당 여부를 판단함에 있어 사법경찰관 등이 범한 직무에 관한 죄가 사건의 실체관계에 관계된 것인지 여부나 당해 사법경찰관이 직접 피의자에 대한 조사를 담당하였는지 여부는 고려할 사정이 아니다.\n" +
                    "\n㉣ 재심청구인이 재심의 청구를 한 후 청구에 대한 결정이 확정되기 전에 사망한 경우라도 재심청구절차는 재심청구인의 사망으로 당연히 종료하게 되는 것은 아니다.",


    };





    public  static String mChoices [][] = {


            //1

            {"미합중국 국적을 가진 미합중국 군대의 군속인 피고인이 범행 당시 10년 넘게 대한민국에 머물면서 한국인 아내와 결혼하여 가정을 마련하고 직장 생활을 하는 등 생활근거지를 대한민국에 두고 있었던 경우에도 미합중국 군대의 군속에 관한 형사재판권 관련 조항이 적용될 수 있다.",
                    "캐나다 시민권자인 피고인이 캐나다에서 위조사문서를 행사하였다는 내용으로 기소된 사안에서, 피고인의 행위에 대하여는 우리나라에 재판권이 없다.",
                    "국회의원의 면책특권 대상이 되는 행위는 국회의 직무수행에 필수적인 국회의원의 국회 내에서의 직무상 발언과 표결이라는 의사표현행위 자체에만 국한되지 아니하고 이에 통상적으로 부수하여 행하여지는 행위까지 포함하며, 그와 같은 부수행위인지 여부는 구체적인 행위의 목적·장소·태양 등을 종합하여 개별적으로 판단하여야 한다.",
                    "항소심이 신법 시행을 이유로 구법이 정한 바에 따라 적법하게 진행된 제1심의 증거조사절차 등을 위법하다고 보아 그 효력을 부정하고 다시 절차를 진행하는 것은 허용되지 아니하며, 다만 이미 적법하게 이루어진 소송행위의 효력을 부정하지 않는 범위 내에서 신법의 취지에 따라 절차를 진행하는 것은 허용된다."},



            //2

            {"친고죄에서 고소는 서면뿐만 아니라 구술로도 할 수 있고, 다만 구술에 의한 고소를 받은 검사 또는 사법경찰관은 조서를 작성하여야 하지만 그 조서가 독립된 조서일 필요는 없다.",
                    "고소권자가 비친고죄로 고소한 사건을 검사가 친고죄로 구성하여 공소를 제기하였다면 공소장 변경절차를 거쳐 공소사실이 비친고죄로 변경되지 아니하는 한, 법원으로서는 친고죄에서 소송조건이 되는 고소가 유효하게 존재하는지를 직권으로 조사·심리하여야 하고, 만일 그 공소사실에 대하여 피고인과 공범관계에 있는 자에 대한 적법한 고소취소가 있다면 그 고소취소의 효력은 피고인에 대하여도 미친다.",
                    "친고죄의 공범 중 그 일부에 대하여 제1심 판결이 선고된 후에는 제1심 판결을 선고하기 이전의 다른 공범자에 대하여 고소취소를 할 수 없고 고소의 취소가 있더라도 그 효력이 발생하지 않는다.",
                    "형사소송법 제230조 제1항 규정에서 범인을 알게 된다 함은 통상인의 입장에서 보아 고소권자가 고소를 할 수 있을 정도로 범죄사실과 범인을 아는 것을 의미하고, 여기서 범죄사실을 안다는 것은 고소권자가 친고죄에 해당하는 범죄의 피해가 있었다는 사실관계에 관하여 미필적 인식이 있음을 말한다."},


            //3

            {"수사기관이 피의자의 진술을 영상녹화 하는 경우에는 반드시 피의자 내지 변호인의 동의를 받아야 하고, 피의자가 아닌 자의 진술을 영상녹화 하는 경우에는 미리 영상녹화 사실을 고지하면 되고 그의 동의를 요하지는 않는다.",
                    "피의자가 변호인의 참여를 원한다는 의사를 명백하게 표시하였음에도 수사기관이 정당한 사유 없이 변호인을 참여하게 하지 아니한 채 피의자를 신문하여 작성한 피의자신문조서라도 증거능력 자체가 부정되는 것은 아니나, 증명력이 낮게 평가될 수밖에 없다.",
                    "피의자와 동석한 신뢰관계에 있는 사람이 피의자를 대신하여 진술한 부분이 조서에 기재되어 있다면 그 부분은 피의자의 진술을 기재한 것이 아니라 동석한 사람의 진술을 기재한 조서에 해당하므로, 그 사람에 대한 진술조서로서의 증거능력을 취득하기 위한 요건을 충족하지 못하는 한 이를 유죄의 증거로 사용할 수 없다.",
                    "검사 또는 사법경찰관은 피의자 또는 그 변호인·법정대리인·배우자·직계친족·형제자매의 신청에 따라 변호인을 피의자와 접견하게 하거나 정당한 사유가 없는 한 피의자에 대한 신문에 참여하게 할 수 있다."},

            //4

            {"1개",
                    "2개",
                    "3개",
                    "4개"},


            //5

            {"수사기관이 관할 지방법원 판사가 발부한 구속영장에 의하여 피의자를 구속하는 경우, 구속영장 발부에 의하여 적법하게 구금된 피의자가 피의자신문을 위한 출석요구에 응하지 아니하면서 수사기관 조사실에 출석을 거부한다면 수사기관은 그 구속영장의 효력에 의하여 피의자를 조사실로 구인할 수 있다.",
                    "형사소송법 제88조는 ‘피고인을 구속한 때에는 즉시 공소사실의 요지와 변호인을 선임할 수 있음을 알려야 한다.’고 규정하고 있는 바, 이를 위반할 경우 구속영장의 효력이 상실된다.",
                    "구속영장에는 청구인을 구금할 수 있는 장소로 특정 경찰서 유치장으로 기재되어 있었는데, 그 신병이 조사차 국가안전기획부 직원에게 인도된 후 위 경찰서 유치장에 인도된 바 없이 계속하여 국가안전기획부 청사에 사실상 구금되어 있다면, 청구인의 방어권이나 접견교통권의 행사에 중대한 장애를 초래하는 것이므로 위법하다.",
                    "구인한 피고인을 법원에 인치한 경우에 구금할 필요가 없다고 인정한 때에는 그 인치한 때로부터 24시간 내에 석방하여야 한다."},



            //6

            {"0개",
                    "1개",
                    "2개",
                    "3개"},


            //7

            {"체포·구속적부심사결정에 의하여 석방된 피의자가 도망하거나 죄증을 인멸하는 경우를 제외하고는 동일한 범죄사실에 관하여 재차 체포 또는 구속하지 못한다.",
                    "체포·구속적부심사청구에 대한 기각결정에 대하여는 3일 이내 항고할 수 있다.",
                    "법원이 수사 관계 서류와 증거물을 접수한 때부터 결정 후 검찰청에 반환된 때까지의 기간은 형사소송법 제202조·제203조 및 제205조의 적용에 있어서는 그 구속기간에 산입하지 아니한다.",
                    "구속적부심절차에서 피구속자의 변호를 맡은 변호인은 수사기록 중 고소장과 피의자신문조서를 열람·등사할 권리가 있다."},


            //8

            {"1개",
                    "2개",
                    "3개",
                    "4개"},

            //9

            {"공소시효를 정지·연장·배제하는 내용의 특례조항을 신설하면서 소급적용에 관한 명시적인 경과규정을 두지 아니한 경우에도 그 조항을 소급하여 적용할 수 있다고 볼 것인지에 관하여는 이를 해결할 보편타당한 일반원칙이 존재한다.",
                    "공소시효의 정지를 위해서는‘형사처분을 면할 목적’이 있을 것을 요구한다. 여기에서 ‘형사처분을 면할 목적’은 국외 체류의 유일한 목적으로 되는 것에 한정된다.",
                    "형사소송법 제253조 제3항의 ‘범인이 형사처분을 면할 목적으로 국외에 있는 경우’는 범인이 국내에서 범죄를 저지르고 형사처분을 면할 목적으로 국외로 도피한 경우에 한정되고, 범인이 국외에서 범죄를 저지르고 형사처분을 면할 목적으로 국외에서 체류를 계속하는 경우는 포함되지 않는다.",
                    "피고인이 당해 사건으로 처벌받을 가능성이 있음을 인지하였다고 보기 어려운 경우라면 피고인이 다른 고소사건과 관련하여 형사처분을 면할 목적으로 국외에 있은 경우라고 하더라도 당해 사건의 형사처분을 면할 목적으로 국외에 있었다고 볼 수 없다."},

            //10

            {"1개",
                    "2개",
                    "3개",
                    "4개"},

            //11


            {"1개",
                    "2개",
                    "3개",
                    "4개"},


            //12

            {"원은 필요하다고 인정하는 때에는 피고인을 소환할 수 있으며, 피고인은 법원의 소환이 없는 때에도 공판준비기일에 출석할 수 있다.",
                    "공판준비기일은 원칙적으로 비공개한다.",
                    "법원은 쟁점 및 증거의 정리를 위하여 필요한 경우에는 제1회 공판기일 후에도 사건을 공판준비절차에 부칠 수 있다.",
                    "공판준비기일에서 신청하지 못한 증거는 중대한 과실 없이 공판준비기일에 제출하지 못하는 등 부득이한 사유를 소명한 때에는 공판기일에 신청할 수 있다."},

            //13

            {"형사소송법 제318조에 규정된 증거동의의 의사표시는 증거조사가 완료된 뒤에도 취소 또는 철회가 인정되므로, 취소 또는 철회 이전에 이미 취득한 증거능력은 상실된다.",
                    "피고인이 철회한 증인을 법원이 직권 신문하고 이를 채증하더라도 위법이 아니다.",
                    "피고인이 출석한 공판기일에서 증거로 함에 부동의한다는 의견이 진술된 경우에도 그 후 피고인이 출석하지 아니한 공판기일에 변호인만이 출석하여 종전 의견을 번복하여 증거로 함에 동의하였다면 이는 특별한 사정이 없는 한 효력이 있다.",
                    "증거물이지만 증거서류의 성질도 가지고 있는 이른바 ‘증거물인 서면’을 조사하기 위해서는 증거서류의 조사방식인 낭독·내용고지 또는 열람의 절차와 증거물의 조사방식인 제시의 절차가 함께 이루어져야 하는 것은 아니다."},




            //14

            {"피고인의 검찰 진술의 임의성의 유무",
                    "친고죄에서 적법한 고소가 있었는지 여부",
                    "형사소송법 제312조 제4항에서 ‘특히 신빙할 수 있는 상태’",
                    "합동범에 있어서의 공모나 모의"},


            //15

            {"형사소송법 제217조 제2항, 제3항에 위반하여 압수·수색영장을 청구하여 이를 발부받지 아니하고도 즉시 반환하지 아니한 압수물은 이를 유죄의 증거로 사용할 수 없는 것이나, 피고인이나 변호인이 이를 증거로 함에 동의하면 유죄의 증거로 사용할 수 있다.",
                    "수사기관이 영장 또는 감정처분허가장을 발부받지 아니한 채 피의자의 동의 없이 피의자의 신체로부터 혈액을 채취하고 사후에도 지체 없이 영장을 발부받지 않았다면, 그 혈액 중 알코올농도에 관한 감정의뢰회보는 원칙적으로 유죄의 증거로 사용할 수 없다.",
                    "피고인이 범행 후 피해자에게 전화를 걸어오자 피해자가 증거를 수집하려고 그 전화내용을 녹음한 경우, 그 녹음테이프가 피고인 모르게 녹음된 것이라 하여 이를 위법하게 수집된 증거라고 할 수 없다.",
                    "수사기관이 피의자 甲의 ｢공직선거법｣위반 범행을 영장 범죄사실로 하여 발부받은 압수·수색영장의 집행과정에서 乙, 丙 사이의 대화가 녹음된 녹음파일(이하 ‘녹음파일’이라 한다)을 압수하여 乙, 丙의 ｢공직선거법｣ 위반 혐의사실을 발견한 사안에서, 압수·수색영장에 기재된 ‘피의자’ 甲이 녹음파일에 의하여 의심되는 혐의사실과 무관한 이상, 수사기관이 별도의 압수·수색영장을 발부받지 않고 압수한 위 녹음파일은 위법수집증거로서 증거능력이 없다."},


            //16

            {"0개",
                    "1개",
                    "2개",
                    "3개"},
            //17

            {"검사가 유죄의 자료로 제출한 사법경찰리 작성의 피고인에 대한 피의자신문조서는 피고인이 그 내용을 부인하는 이상 증거능력이 없으나, 그것이 임의로 작성된 것이 아니라고 의심할 만한 사정이 없는 한 피고인의 법정에서의 진술을 탄핵하기 위한 반대증거로 사용할 수 있다.",
                    "탄핵증거는 범죄사실을 인정하는 증거가 아니므로 엄격한 증거조사를 거쳐야 할 필요가 없음은 형사소송법 제318조의2의 규정에 따라 명백하고 법정에서 이에 대한 탄핵증거로서의 증거조사도 필요 없다.",
                    "탄핵증거의 제출에 있어서도 상대방에게 이에 대한 공격방어의 수단을 강구할 기회를 사전에 부여하여야 한다는 점에서 그 증거와 증명하고자 하는 사실과의 관계 및 입증취지 등을 미리 구체적으로 명시하여야 할 것이므로, 증명력을 다투고자 하는 증거의 어느 부분에 의하여 진술의 어느 부분을 다투려고 한다는 것을 사전에 상대방에게 알려야 한다.",
                    "형사소송법 제318조의2에 규정된 이른바 탄핵증거는 범죄사실을 인정하는 증거가 아니어서 엄격한 증거능력을 요하지 아니하는 것이다."},



            //18

            {"형사소송법 제310조의 피고인의 자백에는 공범인 공동피고인의 진술은 포함되지 않는다.",
                    "乙의 진술은 甲에 대한 범죄사실을 인정하는데 있어서 증거로 쓸 수 있다.",
                    "위 ②항의 경우 그에 대한 보강증거의 요부는 법관의 자유심증에 맡긴다.",
                    "甲이 범행을 자백하는 것을 들었다는 丁의 진술내용은 형사소송법 제310조의 피고인의 자백에는 포함되지 아니하나 이는 피고인의 자백의 보강증거로는 될 수 있다."},




            //19

            {"범칙행위와 같은 시간과 장소에서 이루어진 행위라 하더라도 범칙행위의 동일성을 벗어난 형사범죄행위에 대하여는 범칙금의 납부에 따라 확정판결에 준하는 일사부재리의 효력이 미치지 아니한다.",
                    "피고인이 동일한 행위에 관하여 외국에서 형사처벌을 과하는 확정판결을 받았다 하더라도 이런 외국판결은 우리나라에서는 기판력이 없으므로 여기에 일사부재리의 원칙이 적용될 수 없다.",
                    "검사의 불기소처분에는 확정재판에 있어서의 확정력과 같은 효력이 없어 일단 불기소처분을 한 후에도 공소시효가 완성되기 전이면 언제라도 공소를 제기할 수 있다.",
                    "구(舊) 행형법상의 징벌은 형법 법령에 위반한 행위에 대한 형사책임과 그 목적, 성격을 달리하는 것이 아니므로, 징벌을 받은 뒤에 형사처벌을 하는 것은 일사부재리의 원칙에 반하는 것이다."},
            //20

            {"1개",
                    "2개",
                    "3개",
                    "4개"},





    };


    public static String mCorrectAnswers[] =
            //1
            {"미합중국 국적을 가진 미합중국 군대의 군속인 피고인이 범행 당시 10년 넘게 대한민국에 머물면서 한국인 아내와 결혼하여 가정을 마련하고 직장 생활을 하는 등 생활근거지를 대한민국에 두고 있었던 경우에도 미합중국 군대의 군속에 관한 형사재판권 관련 조항이 적용될 수 있다.",

                    //2

                    "형사소송법 제230조 제1항 규정에서 범인을 알게 된다 함은 통상인의 입장에서 보아 고소권자가 고소를 할 수 있을 정도로 범죄사실과 범인을 아는 것을 의미하고, 여기서 범죄사실을 안다는 것은 고소권자가 친고죄에 해당하는 범죄의 피해가 있었다는 사실관계에 관하여 미필적 인식이 있음을 말한다.",

                    //3

                    "피의자와 동석한 신뢰관계에 있는 사람이 피의자를 대신하여 진술한 부분이 조서에 기재되어 있다면 그 부분은 피의자의 진술을 기재한 것이 아니라 동석한 사람의 진술을 기재한 조서에 해당하므로, 그 사람에 대한 진술조서로서의 증거능력을 취득하기 위한 요건을 충족하지 못하는 한 이를 유죄의 증거로 사용할 수 없다.",

                    //4

                    "3개",

                    //5
                    "형사소송법 제88조는 ‘피고인을 구속한 때에는 즉시 공소사실의 요지와 변호인을 선임할 수 있음을 알려야 한다.’고 규정하고 있는 바, 이를 위반할 경우 구속영장의 효력이 상실된다.",


                    //6
                    "2개",

                    //7
                    "체포·구속적부심사청구에 대한 기각결정에 대하여는 3일 이내 항고할 수 있다.",

                    //8

                    "2개",

                    //9

                    "피고인이 당해 사건으로 처벌받을 가능성이 있음을 인지하였다고 보기 어려운 경우라면 피고인이 다른 고소사건과 관련하여 형사처분을 면할 목적으로 국외에 있은 경우라고 하더라도 당해 사건의 형사처분을 면할 목적으로 국외에 있었다고 볼 수 없다.",


                    //10

                    "1개",

                    //11

                    "2개",


                    //12
                    "공판준비기일은 원칙적으로 비공개한다.",

                    //13
                    "피고인이 철회한 증인을 법원이 직권 신문하고 이를 채증하더라도 위법이 아니다.",

                    //14
                    "합동범에 있어서의 공모나 모의",


                    //15
                    "형사소송법 제217조 제2항, 제3항에 위반하여 압수·수색영장을 청구하여 이를 발부받지 아니하고도 즉시 반환하지 아니한 압수물은 이를 유죄의 증거로 사용할 수 없는 것이나, 피고인이나 변호인이 이를 증거로 함에 동의하면 유죄의 증거로 사용할 수 있다.",


                    //16
                    "2개",

                    //17
                    "탄핵증거는 범죄사실을 인정하는 증거가 아니므로 엄격한 증거조사를 거쳐야 할 필요가 없음은 형사소송법 제318조의2의 규정에 따라 명백하고 법정에서 이에 대한 탄핵증거로서의 증거조사도 필요 없다.",

                    //18
                    "甲이 범행을 자백하는 것을 들었다는 丁의 진술내용은 형사소송법 제310조의 피고인의 자백에는 포함되지 아니하나 이는 피고인의 자백의 보강증거로는 될 수 있다.",

                    //19
                    "구(舊) 행형법상의 징벌은 형법 법령에 위반한 행위에 대한 형사책임과 그 목적, 성격을 달리하는 것이 아니므로, 징벌을 받은 뒤에 형사처벌을 하는 것은 일사부재리의 원칙에 반하는 것이다.",

                    //20
                    "2개",
            };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


