package com.example.admin.police1;


public class QuestionLibrary2017_1 {

    //2017 3월 18일  경찰 경찰학개론


    public   static  String mQuestions [] = {



            "1." +
                    "선사 시대에 대한 설명으로 가장 적절하지 않은 것은?",


            "2." +
                    "고대 국가들에 대한 설명으로 가장 적절하지 않은 것은?",



            "3." +
                    "고대 국가들에 대한 설명 중 옳지 않은 것을 모두 고른 것은?" +
                    "\n\n\n㉠ 2세기 고구려 고국천왕 때에는 왕위계승이 형제상속에서 부자상속으로 바뀌었으며, 부족적인 전통을 지녀온 5부에서 수도와 그 주변지역의 행정단위를 의미하는 5부로 개편되었다.\n" +
                    "\n\n㉡ 5세기 백제 동성왕은 고구려를 피해 남쪽 금강 유역의 웅진으로 도읍을 옮겼다.\n" +
                    "\n\n㉢ 신라 법흥왕은 병부의 설치와 상대등의 설치 등을 통하여 통치 질서를 확립하였다.\n" +
                    "\n\n㉣ 고구려 태조왕은 계루부 고씨의 왕위세습권을 확립하였으며, 옥저를 복속시켰다.\n" +
                    "\n\n㉤ 백제 성왕 때에는 수도를 사비로 천도하고 국호를 ‘남부여’로 바꾸었으며, 아직기가 일본에 건너가서 태자에게 한자를 가르쳤다.\n" +
                    "\n\n㉥ 3세기 고구려 동천왕은 서안평을 공격하였다.",


            "4. " +
                    "다음 시대의 상황에 대한 설명으로 가장 적절한 것은?" +
                    "\n\n\n진성 여왕 3년, 나라 안의 여러 주·군에서 공부(貢賦)를 바치지 않으니, 창고가 비고 나라의 쓰임이 궁핍해졌다. 왕이 사신을 보내어 독촉하였지만, 이로 말미암아 곳곳에서 도적이 벌떼같이 일어났다.",





            "5. " +
                    "고려시대 사건들을 발생한 순서대로 가장 적절하게 나열한 것은?" +
                    "\n\n\n㉠ 「삼국유사」 편찬" +
                    "\n\n㉡ 「상정고금예문」 간행" +
                    "\n\n㉢ 박서의 귀주성 전투" +
                    "\n\n㉣ 만권당 설치" +
                    "\n\n㉤ 원종의 개경 환도",





            "6. " +
                    "고려시대에 대한 설명으로 가장 적절한 것은?",



            "7. " +
                    "고려시대 문화에 대한 설명 중 옳은 것을 모두 고른 것은?" +
                    "㉠ 임춘은 술을 의인화한 「국순전」을 저술하여 현실을 풍자했다.\n" +
                    "\n\n\n㉡ 이제현은 삼국시대부터 고려시대까지의 유명한 시화를 모은 「백운소설」을 저술하였다. \n" +
                    "\n㉢ 이규보는 흥미 있는 사실, 불교, 부녀자들의 이야기를 수록한 「보한집」을 저술하였다.\n" +
                    "\n㉣ 이인로는 「파한집」에서 개경, 평양, 경주 등 역사적 유적지의 풍속과 풍경 등을 묘사하였다.\n" +
                    "\n㉤ 박인량의 「역옹패설」은 고려시대의 대표적 설화문학에 해당한다." ,





            "8. " +
                    "고려시대 사회 모습에 대한 설명으로 가장 적절하지 않은 것은?",




            "9. " +
                    "조선 전기 사회 모습에 대한 설명으로 가장 적절하지 않은 것은?",



            "10. " +
                    "조선시대 문화에 대한 ㉠부터 ㉣까지의 설명 중 옳고 그름의 표시(O, X)가 바르게 된 것은?" +
                    "\n\n\n㉠세종 때에는 촌로들의 실제 경험을 존중하여 우리나라의 기후풍토에 알맞은 독자적인 농법을 정리한 「농사직설」이 편찬되었다.\n" +
                    "\n㉡강희맹은 성종 때 「양화소록」을 저술하여 화초재배법을 소개하였다.\n" +
                    "\n㉢문종 때에는 김종서의 주도하에 중국과 우리나라의 역대 전쟁사를 정리한 「병장도설」이 편찬되었다.\n" +
                    "\n㉣15세기에는 성현에 의해 평양, 개성, 경주 등 옛 도읍지를 배경으로 남녀 간의 사랑과 불의에 대한 비판 등 민중의 생활 감정과 역사의식을 담은 「필원잡기」가 간행되었다.",





            "11." +
                    "다음 중 제시된 사건과 가장 가까운 시기인 것은?" +
                    "\n\n\n대금국(大金國) 한(汗)은 조선국왕(朝鮮國王) 제(弟)에게 글을 전한다.(「인조실록」 권17, 인조 5년 8월 14일 정미)",




            "12." +
                    " 조선시대 사림 세력의 분화 과정에 대한 설명이다. ㉠부터 ㉣까지의 설명 중 가장 적절하지 않은 것은?" +
                    "\n\n\n선조가 즉위하면서 사림 세력이 대거 중앙 정계로 진출하여 정국을 주도하게 되었다. 사림 세력은 척신 정치의 잔재를 어떻게 청산할 것인가를 둘러싸고 갈등을 겪다가 김효원을 지지하는 ( ㉠ )세력과 심의겸을 지지하는 ( ㉡ )세력으로 나뉘었다. 이 후 ( ㉠ )세력은 정여립 모반 사건 등을 계기로 온건파인 ( ㉢ )세력과 급진파인 ( ㉣ )세력으로 나뉘었다.",




            "13. " +
                    "조선시대 각 왕에 대한 설명으로 가장 적절하지 않은 것은?" +
                    "\n\n\n㉠ 인사 관리를 통하여 세력 균형을 유지하려는 탕평론을 제시하였으나, 명목상의 탕평에 그쳤다.\n" +
                    "\n㉡ 각 붕당의 주장이 옳은지 그른지를 명백히 가리는 적극적인 탕평책을 추진하였다.\n" +
                    "\n㉢ 왕과 신하 사이의 의리를 바로 세워야 한다며, 붕당을 없애자는 논리에 동의하는 탕평파를 중심으로 정국을 운영하였다.",




            "14. " +
                    "조선시대 각 인물에 대한 설명으로 가장 적절하지 않은 것은?",


            "15." +
                    "다음 각 조약에 대한 설명으로 가장 적절하지 않은 것은?" +
                    "\n\n\n㉠ 우리 나라 최초의 근대적 조약으로 치외법권과 해안측량권 등을 내주었다.\n" +
                    "\n㉡ 조선이 서양 국가와 맺은 최초의 조약으로 치외법권과 최혜국 대우를 규정하고 있다.\n" +
                    "\n㉢북경과 한성, 양화진에서 양국 상인의 무역을 허용하고, 지방관이 발행한 여행 허가증이 있으면 내지행상도 할 수 있다고 규정하고 있다.",



            "16. " +
                    "동학 농민 운동에 대한 설명으로 가장 적절하지 않은 것은?",



            "17. " +
                    "다음 밑줄 친 제국에서 추진한 정책에 대한 설명으로 가장 적절한 것은?" +
                    "\n\n\n제1조 대한국은 세계만국에 공인된 자주 독립한 (제국)이니라.",





            "18. " +
                    "다음 단체들에 대한 설명으로 가장 적절하지 않은 것은?" +
                    "\n\n\n㉠ 의병장으로 활동하였던 임병찬이 1912년 고종 황제의 비밀 지령을 받아 의병들을 규합하여 결성하였다.\n" +
                    "\n㉡ 1919년 만주에서 일본의 요인 암살과 식민 통치 기관 파괴를 목적으로 소수 정예의 대원으로 구성되었다.\n" +
                    "\n㉢ 1931년 대한민국 임시 정부의 침체를 극복하기 위해 김구가 결성하였다.\n" +
                    "\n㉣ 1940년 만주와 시베리아 지역에서 활동하고 있던 신흥 무관 학교 출신의 독립군 간부와 중국 대륙에 흩어져 있던 수많은 애국 청년을 모아 창설하였다.",





            "19. " +
                    "대한민국 임시정부의 개헌 과정이다. ㉠부터 ㉤까지의 내용 중 옳지 않은 것을 모두 고른 것은?" +

                    "\n\n\n1차 1919년 ㉠ 대통령제" +
                    "\n\n2차 1925년 ㉡ 국무위원 집단 지도 체제" +
                    "\n\n3차 1927년 ㉢ 국무령중심의 내각책임제" +
                    "\n\n4차 1940년 ㉣ 주석제" +
                    "\n\n5차 1944년 ㉤ 주석·부주석제",




            "20. " +
                    "대한민국의 현대사 사건들을 발생한 순서대로 가장 적절하게 나열한 것은?" +
                    "\n\n\n㉠ 국제노동기구(ILO) 가입\n" +
                    "\n㉡ 금융실명제 실시\n" +
                    "\n㉢ 경제협력개발기구(OECD) 가입 \n" +
                    "\n㉣ 대한민국 제14대 대통령 선거 실시",


    };





    public  static String mChoices [][] = {


            //1

            {"구석기 중기에는 큰 몸돌에서 떼어 낸 돌조각인 격지들을 가지고 잔손질을 하여 석기를 만들었다.",
                    "강원 양양 지경리 유적은 신석기 시대 사람들이 살았던 움집 자리로, 동그란 모양의 바닥 중앙에 화덕 자리가 있다.",
                    "신석기 시대는 아직 지배와 피지배의 관계가 발생하지 않았고, 연장자나 경험이 많은 자가 자기 부족을 이끌어 나가는 평등 사회였다.",
                    "신석기 시대에는 민무늬 토기 이외에 입술 단면에 원형, 방형, 삼각형의 덧띠를 붙인 덧띠 토기, 검은 간토기 등도 사용되었다."},



            //2

            {"기원전 1세기 경에는 고구려, 백제, 신라의 삼국과 더불어 부여, 동예, 옥저 등이 공존하고 있었다.",
                    "옥저에는 혼인을 정한 뒤 신부집 뒤꼍에 조그만 집을 짓고, 거기서 자식을 낳아 장성하면 아내를 데리고 신랑집으로 돌아가는 풍습이 있었다.",
                    "동예는 명주와 삼베를 짜는 등 방직 기술이 발달하였으며, 다른 부족의 생활권을 침범하면 노비와 소, 말로 변상하게 하였다.",
                    "삼한 중에서 마한의 세력이 가장 컸으며, 마한을 이루고 있는 소국의 하나인 목지국의 지배자가 마한왕 또는 진왕으로 추대되어 삼한 전체의 주도 세력이 되었다."},


            //3

            {"㉠㉡",
                    "㉢㉤",
                    "㉡㉤",
                    "㉣㉤㉥"},

            //4

            {"공주 명학소에서 망이·망소이가 봉기하였다.",
                    "홍경래의 지휘 하에 영세 농민, 중소 상인, 광산 노동자 등이 합세하여 봉기하였다.",
                    "원종, 애노의 난이 발생하자 왕이 나마 벼슬의 영기에게 진압하라고 명하였다.",
                    "김흠돌의 모역 사건을 계기로 귀족에 대해 대대적인 숙청이 행해졌다."},


            //5

            {"㉢→㉡→㉤→㉠→㉣",
                    "㉡→㉢→㉣→㉤→㉠",
                    "㉡→㉢→㉤→㉠→㉣",
                    "㉢→㉡→㉤→㉣→㉠"},


            //6


            {"충렬왕 때에는 경사교수도감을 설치하여 경학과 사학을 장려하였고, 유교 교육기관에 공자 사당인 문묘를 새로 건립하여 유교 교육의 진흥에 나섰다.",
                    "충선왕 때에는 원의 선명력을 채용하고 그 이론과 계산법을 충분히 소화하였다.",
                    "예산 수덕사 대웅전은 고려시대의 대표적인 다포식 양식 건물에 해당한다.",
                    "의상은 흥왕사를 근거지로 삼아 화엄종을 중심으로 교종을 통합하려 하였다."},


            //7

            {"㉠㉢",
                    "㉡㉣",
                    "㉠㉣",
                    "㉠㉢㉤"},


            //8

            {"개경, 서경 및 각 12목에는 상평창을 두어 물가의 안정을 꾀하였다.",
                    "향도는 고려 후기에 이르러 자신들의 이익을 위하여 조직되는 향도에서 점차 신앙적인 향도로 변모되었다.",
                    "기금을 마련한 뒤 이자로 빈민을 구제하는 제위보가 설치되었다.",
                    "귀양형을 받은 사람이 부모상을 당하였을 때에는 유형지에 도착하기 전에 7일간의 휴가를 주어 부모상을 치를 수 있도록 하였다."},

            //9

            {"중앙과 지방에 있는 관청의 서리와 향리 및 기술관은 직역을 세습하고, 같은 신분 안에서 혼인하였으며, 관청에서 가까운 곳에 거주하였다.",
                    "밭농사는 조, 보리, 콩의 2년 3작이 널리 행해졌으며, 일부 남부지방에서는 모내기가 보급되어 벼와 보리의 이모작이 가능해 생산량을 증가시킬 수 있었다.",
                    "양반 첩에게서 태어난 서얼은 중서라고도 불리었으며, 이들은 문과 응시에 제한이 없었다.",
                    "관습법으로 사회 질서를 유지한 고려시대와 달리, 경국대전과 대명률로 대표되는 법전에 의해 형벌과 민사에 관한 사항을 규율하였으며, 이 중에서 형벌에 관한 사항은 대부분 대명률의 적용을 받았다."},

            //10

            {"㉠(O)        ㉡(X)        ㉢(O)        ㉣(X)",
                    "㉠(O)        ㉡(O)        ㉢(X)        ㉣(O)",
                    "㉠(O)        ㉡(X)        ㉢(X)        ㉣(X)",
                    "㉠(X)        ㉡(O)        ㉢(O)        ㉣(O)"},

            //11


            {"후금(金)의 건국",
                    "대보단(大報壇) 설치",
                    "가도(椵島) 사건",
                    "삼전도(三田渡)의 항복"},


            //12

            {"㉠과 ㉡은 이조 전랑 자리를 놓고 서로 경쟁하였다.",
                    "㉢이 ㉡을 역모로 몰아 정권을 독점한 경신환국 이후 ㉢은 ㉡에 대한 처벌 등의 문제로 분열되었다.",
                    "현종 때 두 차례의 예송이 발생하면서 ㉡과 ㉢사이에 대립이 격화되었고, 이때 ㉡은 상대적으로 신권을 강조하였다.",
                    "임진왜란이 끝난 뒤 ㉣이 집권하여 광해군 때까지 정국을 주도하였다."},

            //13

            {"㉠은 상황에 따라 한 당파를 일거에 내몰고 상대 당파에게 정권을 모두 위임하는 편당적인 인사 관리로 일관하여 환국이 일어나는 빌미를 제공하기도 하였다.",
                    "㉡은 친위부대인 장용영을 설치하여 왕권을 뒷받침하는 군사적 기반을 갖추었다.",
                    "㉡은 초계문신 제도를 실시하고, 규장각을 정치기구로 육성하였다.",
                    "㉢은 서얼과 노비에 대한 차별을 완화하였으며, 상공업을 진흥시키기 위하여 자유로운 상업 행위를 허락하는 통공 정책을 시행하였다."},




            //14

            {"지원은 청에 다녀와 「열하일기」를 저술하고 상공업의 진흥을 강조하면서 수레와 선박의 이용, 화폐 유통의 필요성 등을 주장하였다.",
                    "이익은 토지제도 개혁론으로 한전론을 주장하고, 나라를 좀먹는 여섯 가지의 폐단을 지적하였다.",
                    "정약용은 지방 행정의 개혁에 대하여 쓴 「경세유표」, 중앙 행정의 개혁에 대하여 쓴 「목민심서」 등을 비롯하여 500여 권의 저술을 남겼다.",
                    "이종휘는 「동사」에서 고구려 역사 연구를, 유득공은 「발해고」에서 발해사 연구를 심화하였다. 이들은 고대사 연구의 시야를 만주 지방까지 확대시킴으로써 한반도 중심의 협소한 사관을 극복하는 데 힘썼다."},


            //15

            {"㉠으로 부산에 이어 인천, 원산 순으로 개항되었다.",
                    "㉡은 ㉠과 달리 관세 조항이 들어있었다.",
                    "㉢ 체결 이후 청과 일본의 상권 경쟁이 치열해졌다.",
                    "㉠, ㉡, ㉢ 모두 조선에 불평등한 조약이었다."},


            //16

            {"동학 농민 운동은 1894년 전라도 고부에서 시작되었다.",
                    "전주화약 이후 동학 농민군은 내정을 개혁할 목적으로 전라도 53개 군에 집강소를 설치하여 한 사람의 집강과 그 아래 서기, 성찰, 집사, 동몽 등의 임원을 두었다.",
                    "한성 조약을 빙자하여 조선에 파견된 일본군에게 농민군은 공주 우금치에서 패하였고, 지도부가 체포되면서 이 운동은 실패로 끝났다.",
                    "당시의 집권 세력과 일본 침략 세력의 탄압으로 실패하였지만, 이들의 요구는 갑오개혁에 부분적으로 반영되었다."},
            //17

            {"군국기무처를 설치하고 국가의 주요 정책에 대한 개혁을 추진하였다.",
                    "양전 사업과 상공업 진흥책을 적극 추진하였고 양전 사업에 의하여 근대적 토지소유권 제도라 할 수 있는 지계가 일부 지역에 발급되었다.",
                    "지조법을 실시하고, 호조로 재정을 일원화하였으며, 혜상공국을 폐지하여 자유로운 상업의 발전을 꾀하였다.",
                    "정책을 전담할 기구로 통리기무아문을 설치하였고, 신식 군대인 별기군을 창설하였다."},



            //18

            {"㉠은 일본 정부와 조선 총독부에 한국 침략의 부당성을 밝히고 국권 반환을 요구하는 서신을 보냈다.",
                    "1923년에 김원봉이 작성한 「조선혁명선언」에는 ㉡의 노선이 잘 제시되어 있다.",
                    "㉢에서 활동한 사람으로는 이봉창과 윤봉길이 있다.",
                    "㉣은 연합군과 공동으로 인도와 미얀마 전선에 참전하였고, 미국과 협조하여 국내 진공 작전을 준비하였으나, 일본의 패망으로 실현하지 못하였다."},




            //19

            {"㉠㉡",
                    "㉡㉢",
                    "㉢㉣",
                    "㉣㉤"},
            //20

            {"㉠→㉡→㉢→㉣",
                    "㉣→㉠→㉡→㉢",
                    "㉣→㉡→㉢→㉠",
                    "㉠→㉣→㉡→㉢"},





    };


    public static String mCorrectAnswers[] =
            //1
            {"신석기 시대에는 민무늬 토기 이외에 입술 단면에 원형, 방형, 삼각형의 덧띠를 붙인 덧띠 토기, 검은 간토기 등도 사용되었다.",

                    //2

                    "옥저에는 혼인을 정한 뒤 신부집 뒤꼍에 조그만 집을 짓고, 거기서 자식을 낳아 장성하면 아내를 데리고 신랑집으로 돌아가는 풍습이 있었다.",

                    //3

                    "㉡㉤",

                    //4

                    "원종, 애노의 난이 발생하자 왕이 나마 벼슬의 영기에게 진압하라고 명하였다.",

                    //5
                    "㉢→㉡→㉤→㉠→㉣",


                    //6
                    "충렬왕 때에는 경사교수도감을 설치하여 경학과 사학을 장려하였고, 유교 교육기관에 공자 사당인 문묘를 새로 건립하여 유교 교육의 진흥에 나섰다.",

                    //7
                    "㉠㉣",

                    //8

                    "향도는 고려 후기에 이르러 자신들의 이익을 위하여 조직되는 향도에서 점차 신앙적인 향도로 변모되었다.",

                    //9

                    "양반 첩에게서 태어난 서얼은 중서라고도 불리었으며, 이들은 문과 응시에 제한이 없었다.",


                    //10

                    "㉠(O)        ㉡(X)        ㉢(X)        ㉣(X)",

                    //11

                    "가도(椵島) 사건",


                    //12
                    "㉢이 ㉡을 역모로 몰아 정권을 독점한 경신환국 이후 ㉢은 ㉡에 대한 처벌 등의 문제로 분열되었다.",

                    //13
                    "㉢은 서얼과 노비에 대한 차별을 완화하였으며, 상공업을 진흥시키기 위하여 자유로운 상업 행위를 허락하는 통공 정책을 시행하였다.",

                    //14
                    "정약용은 지방 행정의 개혁에 대하여 쓴 「경세유표」, 중앙 행정의 개혁에 대하여 쓴 「목민심서」 등을 비롯하여 500여 권의 저술을 남겼다.",


                    //15
                    "㉠으로 부산에 이어 인천, 원산 순으로 개항되었다.",


                    //16
                    "한성 조약을 빙자하여 조선에 파견된 일본군에게 농민군은 공주 우금치에서 패하였고, 지도부가 체포되면서 이 운동은 실패로 끝났다.",

                    //17
                    "양전 사업과 상공업 진흥책을 적극 추진하였고 양전 사업에 의하여 근대적 토지소유권 제도라 할 수 있는 지계가 일부 지역에 발급되었다.",

                    //18
                    "1923년에 김원봉이 작성한 「조선혁명선언」에는 ㉡의 노선이 잘 제시되어 있다.",

                    //19
                    "㉡㉢",

                    //20
                    "㉠→㉣→㉡→㉢",
            };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}



