package com.example.admin.police1;


public class QuestionLibrary2017_4 {

    //2017 3월 18일  경찰 형사소송법


    public   static  String mQuestions [] = {



            "1." +
                    "법원의 관할에 대한 설명으로 가장 적절하지 않은 것은?",


            "2." +
                    "변호인에 대한 설명 중 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",



            "3." +
                    "수사에 대한 설명 중 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",


            "4. " +
                    "다음 각 빈 칸에 들어갈 숫자의 합은?" +
                    "\n\n\n㉠체포한 피의자를 구속하고자 할 때에는 체포한 때부터 (    )시간 이내에 「형사소송법」 제201조의 규정에 의하여 구속영장을 청구하여야 하고, 그 기간 내에 구속영장을 청구하지 아니하는 때에는 피의자를 즉시 석방하여야 한다. \n" +
                    "\n㉡지방검찰청 검사장 또는 지청장은 불법체포·구속의 유무를 조사하기 위하여 검사로 하여금 매월 (    )회 이상 관하수사관서의 피의자의 체포·구속 장소를 감찰하게 하여야 한다.\n" +
                    "\n㉢사법경찰관이 피의자를 구속한 때에는 (    )일 이내에 피의자를 검사에게 인치하지 아니하면 석방하여야 한다.",





            "5. " +
                    "체포에 대한 설명 중 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",





            "6. " +
                    "아래 사례에 대한 설명 중 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n검사가 압수·수색영장을 발부받아 甲 주식회사 빌딩 내 乙의 사무실을 압수·수색하였는데, 저장매체에 범죄혐의와 관련된 정보(이하 ‘유관정보’)와 범죄혐의와 무관한 정보(이하 ‘무관정보’)가 혼재된 것으로 판단하여 甲 회사의 동의를 받아 저장매체를 수사기관 사무실로 반출한 다음 乙 측의 참여하에 저장매체에 저장된 전자정보파일 전부를 ‘이미징’의 방법으로 다른 저장매체로 복제(이하 ‘제1처분’)하고, 乙 측의 참여 없이 이미징한 복제본을 외장 하드디스크에 재복제(이하 ‘제2처분’)하였으며, 乙 측의 참여 없이 하드디스크에서 유관정보를 탐색하는 과정에서 甲 회사의 별건 범죄혐의와 관련된 전자정보 등 무관정보도 함께 출력(이하 ‘제3처분’)하였다.",



            "7. " +
                    "고소 또는 고발에 대한 설명 중 옳고 그름의 표시(O, X)가 가장 바르게 된 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠고소할 수 있는 자가 수인인 경우에는 1인의 기간의 해태는 타인의 고소에 영향이 있다.\n" +
                    "\n㉡고소와 고발의 대리는 허용된다.\n" +
                    "\n㉢피해자가 사망한 때에는 그 배우자, 직계친족 또는 형제자매는 피해자의 명시한 의사에 반하여 고소할 수 있다. \n" +
                    "\n㉣피해자의 법정대리인이 피의자이거나 법정대리인의 친족이 피의자인 때에는 피해자의 친족은 독립하여 고소할 수 있다. \n" +
                    "\n㉤출판사 대표인 피고인이 도서의 저작권자인 피해자와 전자도서에 대하여 별도의 출판계약 등을 체결하지 않고 전자도서를 제작하여 인터넷서점 등을 통해 판매하였다고 하여 구 저작권법위반으로 기소된 사안에서, 피해자가 경찰청 인터넷 홈페이지에 ‘피고인을 철저히 조사해 달라’는 취지의 민원을 접수하는 형태로 피고인에 대한 조사를 촉구하는 의사표시를 한 것은 형사소송법에 따른 적법한 고소로 볼 수 있다." ,





            "8. " +
                    "피의자신문에 대한 설명 중 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",




            "9. " +
                    "전문심리위원에 대한 설명 중 가장 적절하지 않은 것은?",



            "10. " +
                    "「형사소송법」에 대한 내용으로 가장 적절하지 않은 것은?",





            "11." +
                    "「형사소송법」 상 공판준비절차에 대한 설명으로 가장 적절하지 않은 것은?",




            "12." +
                    "위법수집증거배제법칙에 대한 설명이다. 아래 ㉠부터 ㉣까지의 설명 중 옳고 그름의 표시(O, X)가 가장 바르게 된 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠수사기관으로부터 통신제한조치의 집행을 위탁받은 통신기관 등이 집행에 필요한 설비가 없을 때에는 수사기관에 설비의 제공을 요청하여야 하는데, 그러한 요청 없이 통신제한조치허가서에 기재된 사항을 준수하지 아니한 채 통신제한조치를 집행하였더라도, 그러한 집행으로 취득한 전기통신의 내용 등은 유죄 인정의 증거로 할 수 있다. \n" +
                    "\n㉡선거관리위원회 위원·직원이 관계인에게 진술이 녹음된다는 사실을 미리 알려 주지 아니한 채 진술을 녹음하였다면, 그와 같은 조사절차에 의하여 수집한 녹음파일 내지 그에 터 잡아 작성된 녹취록은 「형사소송법」 제308조의2에서 정하는 ‘적법한 절차에 따르지 아니하고 수집한 증거’에 해당하여 원칙적으로 유죄의 증거로 쓸 수 없다. \n" +
                    "\n㉢범죄의 피해자인 검사가 그 사건의 수사에 관여하거나, 압수·수색영장의 집행에 참여한 검사가 다시 수사에 관여하였다는 이유만으로 바로 그 수사가 위법하다거나 그에 따른 참고인이나 피의자의 진술에 임의성이 없다고 볼 수는 없다.\n" +
                    "\n㉣수사기관이 피의자를 신문함에 있어서 피의자에게 미리 진술거부권을 고지하지 않은 때에는 그 피의자의 진술은 위법하게 수집된 증거로서 진술의 임의성이 인정되는 경우라도 증거능력이 부인되어야 한다.",




            "13. " +
                    "증거능력에 대한 설명이다. 아래 ㉠부터 ㉣까지의 설명 중 옳고 그름의 표시(O, X)가 가장 바르게 된 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠ 검사 작성의 피의자신문조서에 대한 실질적 진정성립을 증명할 수 있는 수단으로서 「형사소송법」 제312조 제2항에 규정된 ‘영상녹화물이나 그 밖의 객관적인 방법’이란 조사관 또는 조사 과정에 참여한 통역인 등의 증언도 이에 해당한다.\n" +
                    "\n㉡ 피의자 아닌 자의 진술을 기재한 조서는 공판정에서 원진술자의 진술에 의하여 그 성립의 진정함이 인정된 것이 아니면 설사 공판정에서 피고인이 그 성립을 인정하여도 이를 증거로 할 수 있음에 동의한 것이 아닌 이상 증거로 할 수 없다.\n" +
                    "\n㉢ 사법경찰관이 작성한 검증조서에 피의자이던 피고인이 검사 이외의 수사기관 앞에서 자백한 범행내용을 현장에 따라 진술·재연한 내용이 기재되고 그 재연 과정을 촬영한 사진이 첨부되어 있다면, 그러한 기재나 사진은 피고인이 공판정에서 그 진술내용 및 범행재연의 상황을 모두 부인하더라도 증거능력이 있다.\n" +
                    "\n㉣ 디지털 저장매체 원본을 대신하여 저장매체에 저장된 자료를‘하드카피’ 또는 ‘이미징’한 매체로부터 출력한 문건의 경우에는 디지털 저장매체 원본과 ‘하드카피’ 또는 ‘이미징’한 매체 사이에 자료의 동일성이 인정되어야 하는 것은 아니다. ",




            "14. " +
                    "증인에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",


            "15." +
                    "기판력에 대한 설명이다. 아래 ㉠부터 ㉣까지의 설명 중 옳고 그름의 표시(O, X)가 가장 바르게 된 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠피고인이 ‘1997. 4. 3. 21:50경 서울 용산구 이태원동에 있는 햄버거 가게 화장실에서 피해자 甲을 칼로 찔러 乙과 공모하여 甲을 살해하였다’는 내용으로 기소되었는데, 선행사건에서‘1997. 2. 초순부터 1997. 4. 3. 22:00경까지 정당한 이유 없이 범죄에 공용될 우려가 있는 위험한 물건인 휴대용 칼을 소지하였고, 1997. 4. 3. 23:00경 乙이 범행 후 햄버거 가게 화장실에 버린 칼을 집어들고 나와 용산 미8군영 내 하수구에 버려 타인의 형사사건에 관한 증거를 인멸하였다’는 내용의 범죄사실로 유죄판결을 받아 확정된 사안에서, 살인죄의 공소사실과 선행사건에서 유죄로 확정된 폭력행위 등 처벌에 관한 법률 위반(우범자)죄와 증거인멸죄의 범죄사실 사이에는 기본적 사실관계의 동일성이 있다.\n" +
                    "\n㉡과실로 교통사고를 발생시켰다는 각 ‘교통사고처리 특례법 위반죄’와 고의로 교통사고를 낸 뒤 보험금을 청구하여 수령하거나 미수에 그쳤다는 ‘사기 및 사기미수죄’는 그 기본적 사실관계가 동일하다고 볼 수 없다.\n" +
                    "\n㉢회사의 대표이사가 업무상 보관하던 회사 자금을 빼돌려 횡령한 다음 그 중 일부를 더 많은 장비 납품 등의 계약을 체결할 수 있도록 해달라는 취지의 묵시적 청탁과 함께 배임증재에 공여한 사안에서, 위 횡령의 점에 대하여 약식명령이 확정되었다고 하더라도 그 기판력이 배임증재의 점에는 미치지 아니한다.\n" +
                    "\n㉣범칙행위와 같은 일시, 장소에서 이루어진 행위라 하더라도 범칙행위의 동일성을 벗어난 형사범죄행위에 대하여는 범칙금의 납부에 따라 확정판결의 효력에 준하는 효력이 미치지 아니한다.",



            "16. " +
                    "엄격한 증명의 대상에 해당하는 것을 모두 고른 것은?\n" +
                    "    (다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠ ‘공무원의 직무에 속한 사항을 알선한다는 명목’으로 수수하였다는 범의 \n" +
                    "\n㉡교사범에 있어서의 교사사실\n" +
                    "\n㉢「형법」 제334조 제2항 소정의 합동범에 있어서의 공모나 모의\n" +
                    "\n㉣친고죄에서 적법한 고소가 있었는지 여부\n" +
                    "\n㉤몰수대상이 되는지 여부나 추징액의 인정 등 몰수·추징의 사유\n" +
                    "\n㉥피고인의 검찰 진술의 임의성의 유무",



            "17. " +
                    "상소에 대한 설명이다. 아래 ㉠부터 ㉣까지의 설명 중 옳고 그름의 표시(O, X)가 가장 바르게 된 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠상상적 경합관계에 있는 두 죄에 대하여 한 죄는 무죄, 한 죄는 유죄가 선고되어 검사만이 무죄 부분에 대하여 상고하였다 하여도 유죄 부분도 상고심의 심판대상이 되는 것이다. \n" +
                    "\n㉡피고인을 위하여 원심판결을 파기하는 경우에 파기의 이유가 항소한 공동피고인에게 공통되는 때에는 그 공동피고인에게 대하여도 원심판결을 파기하여야 한다.\n" +
                    "\n㉢상소권회복의 청구를 받은 법원은 청구의 허부에 관한 결정을 하여야 하고, 위 결정에 대하여는 즉시항고를 할 수 있다.\n" +
                    "\n㉣상고를 포기한 후 그 포기가 무효라고 주장하는 경우 상고제기기간이 경과하기 전에는 상고포기의 효력을 다투면서 상고를 제기하여 그 상고의 적법 여부에 대한 판단을 받으면 되고, 별도로 상소권회복청구를 할 여지는 없다.",





            "18. " +
                    "「국민의 형사재판 참여에 관한 법률」에 대한 설명으로 가장 적절하지 않은 것은?",





            "19. " +
                    "재심에 대한 설명이다. 아래 ㉠부터 ㉤까지의 설명 중 옳고 그름의 표시(O, X)가 가장 바르게 된 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠특별사면으로 형 선고의 효력이 상실된 유죄의 확정판결도 「형사소송법」 제420조의 ‘유죄의 확정판결’에 해당하여 재심청구의 대상이 될 수 있다.\n" +
                    "\n㉡재심대상판결 확정 후에 형 선고의 효력을 상실케 하는 특별사면이 있는 경우 재심개시결정이 확정되어 재심심판절차를 진행하는 법원은 특별사면이 있음을 들어 면소판결을 하여야 한다. \n" +
                    "\n㉢항소심의 유죄판결에 대하여 상고가 제기되어 상고심 재판이 계속되던 중 피고인이 사망하여 「형사소송법」 제382조, 제328조 제1항 제2호에 따라 공소기각결정이 확정되었더라도 항소심의 유죄판결은 이로써 당연히 그 효력을 상실하게 되는 것은 아니고, 이러한 경우에는 형사소송법상 재심절차의 전제가 되는 ‘유죄의 확정판결’이 존재하는 경우에 해당한다.\n" +
                    "\n㉣재심청구인이 재심의 청구를 한 후 청구에 대한 결정이 확정되기 전에 사망한 경우 재심청구절차는 재심청구인의 사망으로 당연히 종료하게 된다.\n" +
                    "\n㉤「형사소송법」 제420조 제7호의 재심사유 해당 여부를 판단함에 있어 사법경찰관 등이 범한 직무에 관한 죄가 사건의 실체관계에 관계된 것인지 여부나 당해 사법경찰관이 직접 피의자에 대한 조사를 담당하였는지 여부를 고려하여야 한다.",




            "20. " +
                    "「즉결심판에 관한 절차법」의 내용으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",


    };





    public  static String mChoices [][] = {


            //1

            {"법원은 그 피고인이 그 관할구역 내에 현재하지 아니하는 경우에 특별한 사정이 있으면 결정으로 사건을 피고인의 현재지를 관할하는 동급 법원에 이송할 수 있다.",
                    "동일사건이 사물관할을 같이하는 수개의 법원에 계속된 때에는 먼저 공소를 받은 법원이 심판한다. 단, 각 법원에 공통되는 직근 상급법원은 검사 또는 피고인의 신청이 없어도 결정으로 뒤에 공소를 받은 법원으로 하여금 심판하게 할 수 있다.",
                    "토지관할은 범죄지, 피고인의 주소, 거소 또는 현재지로 한다.",
                    "토지관할을 달리하는 수개의 관련사건이 각각 다른 법원에 계속된 때에는 공통되는 직근 상급법원은 검사 또는 피고인의 신청에 의하여 결정으로 1개 법원으로 하여금 병합심리하게 할 수 있다."},



            //2

            {"피고인이 법인인 경우에는 대표자가 제3자에게 변호인 선임을 위임하여 제3자로 하여금 변호인을 선임하도록 할 수는 없다.",
                    "공소제기 전의 변호인 선임은 제1심에서는 그 효력이 없다.",
                    "변호인은 변호사 중에서 선임하여야 한다. 단, 대법원 이외의 법원은 특별한 사정이 있으면 변호사 아닌 자를 변호인으로 선임함을 허가할 수 있다.",
                    "피의자에 대한 신문에 참여하고자 하는 변호인이 2인 이상인 때에는 피의자가 신문에 참여할 변호인 1인을 지정한다. 지정이 없는 경우에는 검사 또는 사법경찰관이 이를 지정할 수 있다."},


            //3

            {"수사란 범죄혐의의 유무를 명백히 하여 공소를 제기·유지할 것인가의 여부를 결정하기 위하여 범인을 발견·확보하고 증거를 수집·보전하는 수사기관의 활동을 말한다.",
                    "「경찰관직무집행법」 제3조 제6항이 임의동행한 경우 당해인을 6시간을 초과하여 경찰관서에 머물게 할 수 없다고 규정하고 있다고 하여 그 규정이 임의동행한 자를 6시간 동안 경찰관서에 구금하는 것을 허용하는 것은 아니다.",
                    "수사기관이 피고인의 범죄사실을 인지하고도 피고인을 바로 체포하지 않고 추가 범행을 지켜보고 있다가 범죄사실이 많이 늘어난 뒤에야 피고인을 체포하였다는 사정만으로도 피고인에 대한 수사와 공소제기는 위법하다거나 함정수사에 해당한다고 할 수 있다.",
                    "법률에 의하여 고소나 고발이 있어야 논할 수 있는 죄에 있어서 고소 또는 고발은 이른바 소추조건에 불과하고 당해 범죄의 성립요건이나 수사의 조건은 아니다."},

            //4

            {"59",
                    "57",
                    "37",
                    "35"},


            //5

            {"피의자가 2009. 11. 2. 22:00경 긴급체포되어 조사를 받고 구속영장이 청구되지 아니하여 2009. 11. 4. 20:10경 석방되었음에도 검사가 그로부터 30일 이내에 「형사소송법」 제200조의4에 따른 석방통지를 법원에 하지 않았다면, 피의자에 대한 긴급체포 당시의 상황과 경위, 긴급체포 후 조사 과정 등에 특별한 위법이 없다고 하더라도 사후에 석방통지가 법에 따라 이루어지지 않았다는 사정만으로 그 긴급체포에 의한 유치 중에 작성된 피의자에 대한 피의자신문조서들의 작성이 소급하여 위법하게 된다.",
                    "검사 또는 사법경찰관리(이하 ‘검사’ 등) 아닌 이에 의하여 현행범인이 체포된 후 불필요한 지체 없이 검사 등에게 인도된 경우 구속영장 청구기간의 기산점은 체포시가 아니라 검사 등이 현행범인을 인도받은 때라고 할 것이다.",
                    "다액 50만원 이하의 벌금, 구류 또는 과료에 해당하는 죄의 현행범인에 대하여는 범인의 주거가 분명하지 아니한 때에 한하여 현행범인으로 체포할 수 있다.",
                    "경찰관의 현행범인 체포경위 및 그에 관한 현행범인체포서와 범죄사실의 기재에 다소 차이가 있더라도, 그것이 논리와 경험칙상 장소적·시간적 동일성이 인정되는 범위 내라면 그 체포행위가 공무집행방해죄의 요건인 적법한 공무집행에 해당한다."},



            //6

            {"수사기관의 전자정보에 대한 압수·수색은 원칙적으로 영장 발부의 사유로 된 범죄혐의사실과 관련된 부분만을 문서 출력물로 수집하거나 수사기관이 휴대한 저장매체에 해당 파일을 복제하는 방식으로 이루어져야 하고, 저장매체 자체를 직접 반출하거나 저장매체에 들어있는 전자파일 전부를 하드카피나 이미징 등 형태(이하 ‘복제본’)로 수사기관 사무실 등 외부로 반출하는 방식으로 압수·수색하는 것은 현장의 사정이나 전자정보의 대량성으로 관련 정보 획득에 긴 시간이 소요되거나 전문인력에 의한 기술적 조치가 필요한 경우 등 범위를 정하여 출력 또는 복제하는 방법이 불가능하거나 압수의 목적을 달성하기에 현저히 곤란하다고 인정되는 때에 한하여 예외적으로 허용될 수 있을 뿐이다.",
                    "저장매체 자체 또는 적법하게 획득한 복제본을 탐색하여 혐의사실과 관련된 전자정보를 문서로 출력하거나 파일로 복제하는 일련의 과정 역시 전체적으로 하나의 영장에 기한 압수·수색에 해당하므로, 그러한 경우의 문서출력 또는 파일복제의 대상 역시 저장매체 소재지에서의 압수·수색과 마찬가지로 혐의사실과 관련된 부분으로 한정되어야 한다.",
                    "위 사례에서 준항고인이 전체 압수·수색 과정을 단계적·개별적으로 구분하여 각 단계의 개별 처분의 취소를 구할 경우 준항고법원은 특별한 사정이 없는 한 구분된 개별 처분의 위법이나 취소 여부를 판단하여야 한다.",
                    "위 사례에서 제1처분은 위법하다고 볼 수 없으나, 제2처분·제3처분은 제1처분 후 피압수·수색 당사자에게 계속적인 참여권을 보장하는 등의 조치가 이루어지지 아니한 채 유관정보는 물론 무관정보까지 재복제·출력한 것으로서 영장이 허용한 범위를 벗어나고 적법절차를 위반한 위법한 처분이다."},


            //7

            {"㉠(O)      ㉡(O)      ㉢(O)      ㉣(X)      ㉤(O)",
                    "㉠(X)      ㉡(X)      ㉢(X)      ㉣(X)      ㉤(O)",
                    "㉠(X)      ㉡(O)      ㉢(X)      ㉣(O)      ㉤(X)",
                    "㉠(X)      ㉡(X)      ㉢(X)      ㉣(O)      ㉤(X)"},


            //8

            {"검사 또는 사법경찰관은 피의자를 신문하는 경우 피의자가 신체적 또는 정신적 장애로 사물을 변별하거나 의사를 결정·전달할 능력이 미약한 때나 피의자의 연령·성별·국적 등의 사정을 고려하여 그 심리적 안정의 도모와 원활한 의사소통을 위하여 필요한 경우에는, 직권 또는 피의자·법정대리인의 신청에 따라 피의자와 신뢰관계에 있는 자를 동석하게 할 수 있고, 구체적인 사안에서 위와 같은 동석을 허락할 것인지는 원칙적으로 검사 또는 사법경찰관이 피의자의 건강 상태 등 여러 사정을 고려하여 재량에 따라 판단하여야 한다.",
                    "피의자와 신뢰관계에 있는 자의 동석을 허락하는 경우에도 동석한 사람으로 하여금 피의자를 대신하여 진술하도록 하여서는 안 되며, 동석한 사람이 피의자를 대신하여 진술한 부분이 조서에 기재되어 있다면 그 부분은 피의자의 진술을 기재한 것이 아니라 동석한 사람의 진술을 기재한 조서에 해당하므로, 그 사람에 대한 진술조서로서의 증거능력을 취득하기 위한 요건을 충족하지 못하는 한 이를 유죄 인정의 증거로 사용할 수 없다.",
                    "피의자가 변호인의 참여를 원한다는 의사를 명백하게 표시하였음에도 수사기관이 정당한 사유 없이 변호인을 참여하게 하지 아니한 채 피의자를 신문하여 작성한 피의자신문조서는 「형사소송법」 제312조에서 정한 ‘적법한 절차와 방식’에 위반된 증거일 뿐만 아니라, 「형사소송법」 제308조의2에서 정한 ‘적법한 절차에 따르지 아니하고 수집한 증거’에 해당하므로 이를 증거로 할 수 없다.",
                    "피의자의 진술을 영상녹화하는 경우 피의자 또는 변호인의 동의를 받아야 영상녹화할 수 있고, 피의자가 아닌 자의 진술을 영상녹화하고자 할 때에는 미리 피의자가 아닌 자에게 영상녹화사실을 알려주어야 영상녹화할 수 있다."},

            //9

            {"법원은 소송관계를 분명하게 하거나 소송절차를 원활하게 진행하기 위하여 필요한 경우에는 직권으로 또는 검사, 피고인 또는 변호인의 신청에 의하여 결정으로 전문심리위원을 지정하여 공판준비 및 공판기일 등 소송절차에 참여하게 할 수 있다.",
                    "전문심리위원은 기일에 재판장의 허가를 받아 피고인 또는 변호인, 증인 또는 감정인 등 소송관계인에게 소송관계를 분명하게 하기 위하여 필요한 사항에 관하여 직접 질문할 수 있다.",
                    "전문심리위원은 전문적인 지식에 의한 설명 또는 의견을 기재한 서면을 제출하거나 기일에 전문적인 지식에 의하여 설명이나 의견을 진술할 수 있고, 재판의 합의에도 참여할 수 있다.",
                    "전문심리위원은 「형법」 제129조부터 제132조까지의 규정(뇌물죄)에 따른 벌칙의 적용에서는 공무원으로 본다."},

            //10

            {"재정신청 기각결정에 대하여는 불복할 수 없다.",
                    "재판장은 피해자, 증인 등 사건관계인의 생명 또는 신체의 안전을 현저히 해칠 우려가 있는 경우에는 소송계속 중의 관계 서류 또는 증거물의 열람·복사에 앞서 사건관계인의 성명 등 개인정보가 공개되지 아니하도록 보호조치를 할 수 있다.",
                    "판결선고 후 판결확정 전 구금일수(판결선고 당일의 구금일수를 포함한다)는 전부를 본형에 산입한다.",
                    "사람을 살해한 범죄(종범은 제외한다)로 사형에 해당하는 범죄에 대하여는 「형사소송법」 제249조부터 제253조까지에 규정된 공소시효를 적용하지 아니한다."},

            //11


            {"검사, 피고인 또는 변호인은 법원에 대하여 공판준비기일의 지정을 신청할 수 있고, 이 경우 당해 신청에 관한 법원의 결정에 대하여는 불복할 수 없다.",
                    "법원은 필요하다고 인정하는 때에는 피고인을 소환할 수 있으며, 피고인은 법원의 소환이 없이는 공판준비기일에 출석할 수 없다.",
                    "법원은 쟁점 및 증거의 정리를 위하여 필요한 경우에는 제1회 공판기일 후에도 사건을 공판준비절차에 부칠 수 있고, 이 경우 기일전 공판준비절차에 관한 규정을 준용한다.",
                    "법원은 공판준비기일이 지정된 사건에 관하여 변호인이 없는 때에는 직권으로 변호인을 선정하여야 한다."},


            //12

            {"㉠(X)        ㉡(O)        ㉢(X)        ㉣(O)",
                    "㉠(O)        ㉡(X)        ㉢(O)        ㉣(O)",
                    "㉠(O)        ㉡(O)        ㉢(X)        ㉣(X)",
                    "㉠(X)        ㉡(O)        ㉢(O)        ㉣(O)"},

            //13

            {"㉠(O)        ㉡(O)        ㉢(X)        ㉣(X)",
                    "㉠(X)        ㉡(X)        ㉢(O)        ㉣(O)",
                    "㉠(X)        ㉡(O)        ㉢(X)        ㉣(X)",
                    "㉠(O)        ㉡(X)        ㉢(O)        ㉣(O)"},




            //14

            {"공동피고인인 절도범과 그 장물범은 서로 다른 공동피고인의 범죄사실에 관하여는 증인의 지위에 있다 할 것이므로, 피고인이 증거로 함에 동의한 바 없는 공동피고인에 대한 피의자신문조서는 공동피고인의 증언에 의하여 그 성립의 진정이 인정되지 아니하는 한 피고인의 공소 범죄사실을 인정하는 증거로 할 수 없다.",
                    "증인이 법원의 구내에 있는 때에는 소환함이 없이 신문할 수 있다.",
                    "법원은 감치의 재판을 받은 증인이 감치의 집행 중에 증언을 한 때에는 즉시 감치결정을 취소하고 그 증인을 석방하도록 명하여야 한다.",
                    "반대신문에 있어서 필요할 때에는 유도신문을 할 수 있고, 반대신문의 기회에 주신문에 나타나지 아니한 새로운 사항에 관하여 신문하고자 할 때에는 재판장의 허가를 받아야 하는 것은 아니다."},


            //15

            {"㉠(O)        ㉡(O)        ㉢(O)        ㉣(O)",
                    "㉠(O)        ㉡(X)        ㉢(O)        ㉣(X)",
                    "㉠(X)        ㉡(O)        ㉢(X)        ㉣(X)",
                    "㉠(X)        ㉡(O)        ㉢(O)        ㉣(O)"},


            //16

            {"㉠㉡㉢",
                    "㉠㉣㉤",
                    "㉡㉢㉤",
                    "㉡㉣㉥"},
            //17

            {"㉠(O)        ㉡(O)        ㉢(O)        ㉣(O)",
                    "㉠(X)        ㉡(X)        ㉢(O)        ㉣(O)",
                    "㉠(X)        ㉡(O)        ㉢(X)        ㉣(O)",
                    "㉠(O)        ㉡(O)        ㉢(O)        ㉣(X)"},



            //18

            {"법원은 배심원의 결원 등에 대비하여 5인 이내의 예비배심원을 둘 수 있다.",
                    "배심원과 예비배심원은 직무를 계속 수행하기 어려운 사정이 있는 때에는 법원에 사임을 신청할 수 있고, 법원은 위 신청에 이유가 있다고 인정하는 때에는 당해 배심원 또는 예비배심원을 해임하는 결정을 할 수 있는데, 위 결정에 대하여는 불복할 수 있다.",
                    "배심원은 유·무죄에 관하여 전원의 의견이 일치하지 아니하는 때에는 평결을 하기 전에 심리에 관여한 판사의 의견을 들어야 하고, 이 경우 유·무죄의 평결은 다수결의 방법으로 한다.",
                    "판결서에는 배심원이 재판에 참여하였다는 취지를 기재하여야 하고, 배심원의 의견을 기재할 수 있다."},




            //19

            {"㉠(O)      ㉡(O)      ㉢(X)      ㉣(O)      ㉤(O)",
                    "㉠(X)      ㉡(X)      ㉢(O)      ㉣(X)      ㉤(X)",
                    "㉠(X)      ㉡(O)      ㉢(X)      ㉣(X)      ㉤(O)",
                    "㉠(O)      ㉡(X)      ㉢(X)      ㉣(O)      ㉤(X)"},
            //20

            {"지방법원 또는 그 지원의 판사는 소속지방법원장의 명령을 받아 소속법원의 관할사무와 관계없이 즉결심판청구사건을 심판할 수 있다.",
                    "즉결심판을 청구할 때에는 사전에 피고인에게 즉결심판의 절차를 이해하는 데 필요한 사항을 서면 또는 구두로 알려주어야 한다.",
                    "법원이 경찰서장의 즉결심판 청구를 기각하여 경찰서장이 사건을 관할 지방검찰청으로 송치하였으나 검사가 이를 즉결심판에 대한 피고인의 정식재판청구가 있은 사건으로 오인하여 그 사건기록을 법원에 송부한 경우, 검사에 의한 공소장의 제출이 없더라도 기록을 법원에 송부한 사실만으로 공소제기가 성립되었다고 볼 수 있다.",
                    "판사는 필요하다고 인정할 때에는 적당한 방법에 의하여 재정하는 증거에 한하여 조사할 수 있다."},





    };


    public static String mCorrectAnswers[] =
            //1
            {"동일사건이 사물관할을 같이하는 수개의 법원에 계속된 때에는 먼저 공소를 받은 법원이 심판한다. 단, 각 법원에 공통되는 직근 상급법원은 검사 또는 피고인의 신청이 없어도 결정으로 뒤에 공소를 받은 법원으로 하여금 심판하게 할 수 있다.",

                    //2

                    "공소제기 전의 변호인 선임은 제1심에서는 그 효력이 없다.",

                    //3

                    "수사기관이 피고인의 범죄사실을 인지하고도 피고인을 바로 체포하지 않고 추가 범행을 지켜보고 있다가 범죄사실이 많이 늘어난 뒤에야 피고인을 체포하였다는 사정만으로도 피고인에 대한 수사와 공소제기는 위법하다거나 함정수사에 해당한다고 할 수 있다.",

                    //4

                    "59",

                    //5
                    "피의자가 2009. 11. 2. 22:00경 긴급체포되어 조사를 받고 구속영장이 청구되지 아니하여 2009. 11. 4. 20:10경 석방되었음에도 검사가 그로부터 30일 이내에 「형사소송법」 제200조의4에 따른 석방통지를 법원에 하지 않았다면, 피의자에 대한 긴급체포 당시의 상황과 경위, 긴급체포 후 조사 과정 등에 특별한 위법이 없다고 하더라도 사후에 석방통지가 법에 따라 이루어지지 않았다는 사정만으로 그 긴급체포에 의한 유치 중에 작성된 피의자에 대한 피의자신문조서들의 작성이 소급하여 위법하게 된다.",


                    //6
                    "위 사례에서 준항고인이 전체 압수·수색 과정을 단계적·개별적으로 구분하여 각 단계의 개별 처분의 취소를 구할 경우 준항고법원은 특별한 사정이 없는 한 구분된 개별 처분의 위법이나 취소 여부를 판단하여야 한다.",

                    //7
                    "㉠(X)      ㉡(X)      ㉢(X)      ㉣(O)      ㉤(X)",

                    //8

                    "피의자의 진술을 영상녹화하는 경우 피의자 또는 변호인의 동의를 받아야 영상녹화할 수 있고, 피의자가 아닌 자의 진술을 영상녹화하고자 할 때에는 미리 피의자가 아닌 자에게 영상녹화사실을 알려주어야 영상녹화할 수 있다.",

                    //9

                    "전문심리위원은 전문적인 지식에 의한 설명 또는 의견을 기재한 서면을 제출하거나 기일에 전문적인 지식에 의하여 설명이나 의견을 진술할 수 있고, 재판의 합의에도 참여할 수 있다.",


                    //10

                    "재정신청 기각결정에 대하여는 불복할 수 없다.",

                    //11

                    "법원은 필요하다고 인정하는 때에는 피고인을 소환할 수 있으며, 피고인은 법원의 소환이 없이는 공판준비기일에 출석할 수 없다.",


                    //12
                    "㉠(X)        ㉡(O)        ㉢(O)        ㉣(O)",

                    //13
                    "㉠(X)        ㉡(O)        ㉢(X)        ㉣(X)",

                    //14
                    "반대신문에 있어서 필요할 때에는 유도신문을 할 수 있고, 반대신문의 기회에 주신문에 나타나지 아니한 새로운 사항에 관하여 신문하고자 할 때에는 재판장의 허가를 받아야 하는 것은 아니다.",


                    //15
                    "㉠(X)        ㉡(O)        ㉢(O)        ㉣(O)",


                    //16
                    "㉠㉡㉢",

                    //17
                    "㉠(O)        ㉡(O)        ㉢(O)        ㉣(O)",

                    //18
                    "배심원과 예비배심원은 직무를 계속 수행하기 어려운 사정이 있는 때에는 법원에 사임을 신청할 수 있고, 법원은 위 신청에 이유가 있다고 인정하는 때에는 당해 배심원 또는 예비배심원을 해임하는 결정을 할 수 있는데, 위 결정에 대하여는 불복할 수 있다.",

                    //19
                    "㉠(O)      ㉡(X)      ㉢(X)      ㉣(O)      ㉤(X)",

                    //20
                    "법원이 경찰서장의 즉결심판 청구를 기각하여 경찰서장이 사건을 관할 지방검찰청으로 송치하였으나 검사가 이를 즉결심판에 대한 피고인의 정식재판청구가 있은 사건으로 오인하여 그 사건기록을 법원에 송부한 경우, 검사에 의한 공소장의 제출이 없더라도 기록을 법원에 송부한 사실만으로 공소제기가 성립되었다고 볼 수 있다.",
            };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


