package com.example.admin.police1;


public class QuestionLibrary2018_5 {

       //2018 3월 24일  경찰 경찰학개론


    public   static  String mQuestions [] = {



            "1." +
                    "다음 중 경찰을 경찰활동의 질과 내용에 따라 분류한 것으로 가장 적절한 것은?",


            "2." +
                    "｢경찰청 공무원 행동강령｣에 대한 내용으로 가장 적절하지 않은 것은?",



            "3." +
                    "우리나라 경찰의 역사와 제도에 대한 설명이다. 시대 순으로 나열한 것은?" +
                    "\n\n ㉠｢경찰법｣ 제정              ㉡｢경찰관 직무집행법｣ 제정\n" +
                    "㉢최초로 여성 경찰관 채용    ㉣제주 자치경찰 출범\n" +
                    "㉤내무부 치안국을 치안본부로 개편",


            "4. " +
                    "｢행정권한의 위임 및 위탁에 관한 규정｣에 대한 내용으로 가장 적절하지 않은 것은?",





            "5. " +
                    "｢국가공무원법｣의 소청심사위원회 및 소청심사위원회 위원에 대한 내용이다. 아래 ㉠부터 ㉣까지의 내용 중 옳고 그름의 표시(O, X)가 바르게 된 것은?" +
                    "\n\n\n㉠대학에서 행정학·정치학 또는 법률학을 담당한 부교수 이상의 직에 3년 이상 근무한 자는 위원이 될 수 있다.\n" +
                    "\n㉡국회사무처, 법원행정처, 헌법재판소사무처 및 중앙선거관리위원회사무처에 설치된 소청심사위원회는 위원장 1명을 포함한 위원 5명 이상 7명 이하의 상임위원으로 구성한다.\n" +
                    "\n㉢소청사건의 결정은 재적위원의 2분의 1 이상의 출석과 출석위원 과반수의 합의에 의하여 결정한다.\n" +
                    "\n㉣소청심사위원회의 위원은 벌금 이상의 형벌이나 장기의 심신 쇠약으로 직무를 수행할 수 없게 된 경우 외에는 본인의 의사에 반하여 면직되지 아니한다.",





            "6. " +
                    "｢위해성 경찰장비의 사용기준 등에 관한 규정｣에 대한 내용으로 가장 적절하지 않은 것은?",



            "7. " +
                    "｢범인검거 등 공로자 보상에 관한 규정｣에 대한 내용으로 가장 적절하지 않은 것은?" ,





            "8. " +
                    "｢물품관리법｣상 물품관리에 대한 내용으로 가장 적절한 것은?",




            "9. " +
                    "｢국가재정법｣상 예산안의 편성에 대한 내용으로 가장 적절하지 않은 것은?",



            "10. " +
                    "｢언론중재 및 피해구제 등에 관한 법률｣상 언론중재위원회에 대한 내용으로 ㉠부터 ㉣에 들어갈 숫자를 모두 합한 값은?" +
                    "\n\n\n∙중재위원회는 (㉠)명 이상 (㉡)명 이내의 중재위원으로 구성한다.\n" +
                    "\n∙중재위원회에 위원장 1명과 (㉢)명 이내의 부위원장 및 (㉣)명 이내의 감사를 두며, 각각 중재위원 중에서 호선한다.",





            "11." +
                    "｢집회 및 시위에 관한 법률 시행령｣ 제14조 별표 2의 확성기 등의 소음기준[단위: Leq dB(A)] 및 소음 측정 방법에 대한 내용으로 가장 적절하지 않은 것은?",




            "12." +
                    "｢경비업법｣에 대한 내용으로 가장 적절하지 않은 것은?",




            "13. " +
                    "｢총포·도검·화약류 등의 안전관리에 관한 법률｣에 대한 내용으로 가장 적절하지 않은 것은?",




            "14. " +
                    "｢(경찰청) 범죄수사규칙｣의 영상녹화에 대한 내용으로 가장 적절하지 않은 것은?",


            "15." +
                    "｢성폭력범죄의 처벌 등에 관한 특례법｣의 신상정보 등록 등에 대한 내용으로 가장 적절하지 않은 것은?",



            "16. " +
                    "다중범죄의 정책적 치료법과 그에 대한 내용으로 가장 적절한 것은?",



            "17. " +
                    "음주운전 관련 판례의 내용으로 가장 적절하지 않은 것은?",





            "18. " +
                    "｢국가보안법｣의 보상과 원호에 대한 내용이다. 아래 ㉠부터 ㉣까지의 내용 중 옳고 그름의 표시(O,X)가 바르게 된 것은?" +
                    "\n\n\n㉠이 법의 죄를 범한 자를 수사기관 또는 정보기관에 통보하거나 체포한 자에게는 대통령령이 정하는 바에 따라 상금을 지급한다.\n" +
                    "\n㉡반국가단체나 그 구성원 또는 그 지령을 받은 자로부터 금품을 취득하여 수사기관 또는 정보기관에 제공한 자에게는 그 가액의 2분의 1에 상당하는 범위 안에서 보로금을 지급할 수 있다. 반국가단체의 구성원 또는 그 지령을 받은 자가 제공한 때에도 또한 같다.\n" +
                    "\n㉢보로금의 청구 및 지급에 관하여 필요한 사항은 대통령령으로 정한다.\n" +
                    "\n㉣이 법에 의한 상금과 보로금의 지급 및 제23조에 의한 보상대상자를 심의·결정하기 위하여 법무부장관 소속하에 국가보안유공자 심사위원회를 둔다.",





            "19. " +
                    "｢범죄인 인도법｣의 인도거절 사유에 대한 내용으로 가장 적절하지 않은 것은?",




            "20. " +
                    "현재의 수사구조에 대한 다음 주장 중 그 입장이 다른 것은?",


    };





    public  static String mChoices [][] = {


         //1

            {"질서경찰과 봉사경찰",
                    "보안경찰과 협의의 행정경찰",
                    "행정경찰과 사법경찰",
                    "보통경찰과 고등경찰"},



          //2

            {"공무원은 직무를 수행함에 있어 지연·혈연·학연·종교 등을 이유로 특정인에게 특혜를 주어서는 아니 된다.",
                    "공무원은 상급자가 자기 또는 타인의 부당한 이익을 위하여 공정한 직무수행을 현저하게 해치는 지시를 하였을 때에는 그 사유를 그 상급자에게 소명하고 지시에 따르지 아니하거나 제23조에 따라 지정된 공무원 행동강령에 관한 업무를 담당하는 공무원(이하 “행동강령책임관”이라 한다)과 상담할 수 있다.",
                    "공무원은 정치인이나 정당 등으로부터 부당한 직무수행을 강요받거나 청탁을 받은 경우에는 소속 기관의 장에게 보고하거나 행동강령책임관과 상담한 후 처리하여야 한다.",
                    "공무원은 ｢범죄수사규칙｣ 제15조에 따른 경찰관서 내 수사 지휘에 대한 이의제기와 관련하여 행동강령책임관에게 상담을 요청하여야 한다."},


          //3

            {"㉡–㉢–㉤–㉣–㉠ ",
                    "㉡–㉢–㉤–㉠–㉣",
                    "㉢–㉡–㉠–㉤–㉣",
                    "㉢–㉡–㉤–㉠–㉣"},

              //4

            {"위임이란 법률에 규정된 행정기관의 장의 권한 중 일부를 그 보조기관 또는 하급행정기관의 장이나 지방자치단체의 장에게 맡겨 그의 권한과 책임 아래 행사하도록 하는 것을 말한다.",
                    "위임 및 위탁기관은 수임 및 수탁기관의 수임 및 수탁사무 처리에 대하여 지휘·감독하고, 그 처리가 위법하거나 부당하다고 인정될 때에는 이를 취소하거나 정지시킬 수 있다.",
                    "수임 및 수탁사무의 처리에 관한 책임은 수임 및 수탁기관에 있으므로, 위임 및 위탁기관의 장은 그에 대한 감독책임을 지지 않는다.",
                    "위임 및 위탁기관은 위임 및 위탁사무 처리의 적정성을 확보하기 위하여 필요한 경우에는 수임 및 수탁기관의 수임 및 수탁사무 처리 상황을 수시로 감사할 수 있다."},


         //5

            {"㉠(X) ㉡(X) ㉢(O) ㉣(O)",
                    "㉠(X) ㉡(O) ㉢(X) ㉣(O)",
                    "㉠(O) ㉡(X) ㉢(X) ㉣(X)",
                    "X) ㉡(X) ㉢(X) ㉣(X)"},



          //6

            {"경찰관은 범인·주취자 또는 정신착란자의 자살 또는 자해기도를 방지하기 위하여 필요한 때에는 수갑·포승 또는 호송용포승을 사용할 수 있다.",
                    "경찰관은 총기 또는 폭발물을 가지고 대항하는 경우를 제외하고는 14세 미만의 자 또는 임산부에 대하여 권총 또는 소총을 발사하여서는 아니 된다.",
                    "경찰관은 최루탄발사기로 최루탄을 발사하는 경우 30도 이상의 발사각을 유지하여야 하고, 가스차·살수차 또는 특수진압차의 최루탄발사대로 최루탄을 발사하는 경우에는 15도 이상의 발사각을 유지하여야 한다.",
                    " 경찰청장은 신규 도입 장비에 대한 안전성 검사를 실시한 후 3개월 이내에 안전성 검사 결과보고서를 국무회의에 제출하여야 한다."},


            //7

            {"사형, 무기징역 또는 무기금고, 장기 10년 이상의 징역 또는 금고에 해당하는 범죄에 대한 보상금 지급기준 금액은 30만원이다.",
                    "장기 10년 미만의 징역 또는 금고에 해당하는 범죄에 대한 보상금 지급기준 금액과 벌금 50만원 이하의 범죄에 대한 보상금 지급기준 금액의 합은 25만원이다.",
                    "동일한 사람에게 지급결정일을 기준으로 연간(1월 1일부터 12월 31일까지를 말한다) 5회를 초과하여 보상금을 지급할 수 없다.",
                    "보상금 지급 심사·의결을 거쳐 지급이 이루어진 이후에는 동일한 사건에 대하여 보상금을 지급할 수 없다."},


            //8

            {"기획재정부장관은 각 중앙관서의 장이 수행하는 물품관리에 관한 업무를 총괄·조정한다.",
                    "각 중앙관서의 장은 물품관리관의 사무의 일부를 분장하는 분임물품관리관을 대통령령으로 정하는 바에 따라 두어야 한다.",
                    "분임물품관리관이란 물품출납공무원의 사무의 일부를 분장하는 공무원을 말한다.",
                    "물품관리관으로부터 대통령령으로 정하는 바에 따라 물품의 사용에 관한 사무를 위임받은 공무원을 물품운용관이라 한다."},

            //9

            {"각 중앙관서의 장은 매년 1월 31일까지 당해 회계연도부터 3회계연도 이상의 기간 동안의 신규사업 및 기획재정부장관이 정하는 주요 계속사업에 대한 중기사업계획서를 기획재정부장관에게 제출하여야 한다.",
                    "기획재정부장관은 국무회의의 심의를 거쳐 대통령의 승인을 얻은 다음 연도의 예산안편성지침을 매년 3월 31일까지 각 중앙관서의 장에게 통보하여야 한다.",
                    "각 중앙관서의 장은 제29조의 규정에 따른 예산안편성지침에 따라 그 소관에 속하는 다음 연도의 세입세출예산·계속비·명시이월비·국고채무부담행위요구서를 작성하여 매년 5월 31일까지 기획재정부장관에게 제출하여야 한다.",
                    "정부는 제32조의 규정에 따라 대통령의 승인을 얻은 예산안을 회계연도 개시 120일 전까지 국회에 제출하여야 한다."},

             //10

            {"124",
                    "125",
                    "134",
                    "135"},

            //11


            {"주거지역, 학교, 종합병원, 공공도서관에서 주간(해뜬 후∼해지기 전)에 확성기 등의 소음기준은 65 이하이다.",
                    "그 밖의 지역에서 야간(해진 후∼해뜨기 전)에 확성기 등의 소음기준은 65 이하이다.",
                    "소음 측정 장소는 피해자가 위치한 건물 외벽에서 소음원 방향으로 1∼3.5m 떨어진 지점으로 하되, 소음도가 높을 것으로 예상되는 지점의 지면 위 1.2∼1.5m 높이에서 측정하고, 주된 건물의 경비 등을 위하여 사용되는 부속 건물, 광장·공원이나 도로상의 영업시설물, 공원의 관리사무소 등도 소음 측정 장소로 포함된다.",
                    "확성기 등의 소음은 관할 경찰서장(현장 경찰공무원)이 측정한다."},


             //12

            {"경비업은 법인이 아니면 이를 영위할 수 없다.",
                    "경비업을 영위하고자 하는 법인은 도급받아 행하고자 하는 경비업무를 특정하여 그 법인의 주사무소의 소재지를 관할하는 지방경찰청장의 허가를 받아야 한다. 도급받아 행하고자 하는 경비업무를 변경하는 경우에도 또한 같다.",
                    "이 법 제4조 제1항의 규정에 의한 경비업 허가의 유효기간은 허가받은 다음 날부터 5년으로 한다.",
                    "경비업자는 집단민원현장에 경비원을 배치하는 때에는 경비지도사를 선임하고 그 장소에 배치하여 행정안전부령으로 정하는 바에 따라 경비원을 지도·감독하게 하여야 한다."},

            //13

            {"“총포”란 권총, 소총, 기관총, 포, 엽총, 금속성 탄알이나 가스 등을 쏠 수 있는 장약총포, 공기총(가스를 이용하는 것을 포함한다) 및 총포신·기관부 등 그 부품으로서 대통령령으로 정하는 것을 말한다.",
                    "자격정지 이상의 형을 선고받고 그 집행이 끝나거나 집행을 받지 아니하기로 확정된 후 3년이 지나지 아니한 자는 총포·도검·화약류·분사기·전자충격기·석궁 제조업의 허가를 받을 수 없다.",
                    "누구든지 유실·매몰 또는 정당하게 관리되고 있지 아니하는 총포·도검·화약류·분사기·전자충격기·석궁이라고 인정되는 물건을 발견하거나 습득하였을 때에는 24시간 이내에 가까운 경찰관서에 신고하여야 한다.",
                    "화약류를 운반하려는 사람은 행정안전부령으로 정하는 바에 따라 발송지를 관할하는 경찰서장에게 신고하여야 한다. 다만, 대통령령으로 정하는 수량 이하의 화약류를 운반하는 경우에는 그러하지 아니하다."},




           //14

            {"경찰관은 피의자 또는 피의자 아닌 자의 조서를 작성하는 때에는 그 조사 과정을 영상녹화할 수 있다.",
                    "경찰관은 조사과정을 영상녹화할 때에는 그 조사의 시작부터 조서에 기명날인 또는 서명을 마치는 시점까지의 모든 과정을 영상녹화하여야 한다. 다만, 조사 도중 영상녹화의 필요성이 발생하였을 때에는 그 시점에서 진행 중인 조사를 종료하고, 그 다음 조사의 시작부터 조서에 기명날인 또는 서명을 마치는 시점까지의 모든 과정을 영상녹화하여야 한다.",
                    "경찰관은 피조사자의 기명날인 또는 서명을 받을 수 없는 경우에는 기명날인 또는 서명란에 그 취지를 기재하고 직접 기명날인 또는 서명한다.",
                    "경찰관은 원본을 봉인하기 전에 진술자 또는 변호인이 녹화물의 시청을 요구하는 때에는 영상녹화물을 재생하여 시청하게 할 수 있다. 이 경우 진술자 또는 변호인이 녹화된 내용에 대하여 이의를 진술하는 때에는 그 취지를 기재한 서면을 사건 기록에 편철하여야 한다."},


            //15

            {"등록대상자가 6개월 이상 국외에 체류하기 위하여 출국하는 경우에는 미리 관할경찰관서의 장에게 허가를 받아야 한다.",
                    "신상정보 등록의 원인이 된 성범죄로 형의 선고를 유예받은 사람이 선고유예를 받은 날부터 2년이 경과하여 ｢형법｣ 제60조에 따라 면소된 것으로 간주되면 신상정보 등록을 면제한다.",
                    "등록대상자의 신상정보의 등록·보존 및 관리 업무에 종사하거나 종사하였던 자는 직무상 알게 된 등록정보를 누설하여서는 아니 된다.",
                    "등록정보의 공개는 여성가족부장관이 집행하고, 법무부장관은 등록정보의 공개에 필요한 정보를 여성가족부장관에게 송부하여야 한다."},


            //16

            {"선수승화법 - 불만집단의 고조된 주장을 시간을 끌어 이성적으로 사고할 기회를 부여하고 정서적으로 감정을 둔화시켜서 흥분을 가라앉게 하는 방법",
                    "전이법 - 다중범죄의 발생징후나 이슈가 있을 때 집단이나 국민들의 관심을 집중시킬 수 있는 경이적인 사건을 폭로하거나 규모가 큰 행사를 개최하여 그 발생징후나 이슈가 상대적으로 약화되도록 하는 방법",
                    "지연정화법 - 불만집단에 반대하는 대중의견을 크게 부각시켜 불만집단이 위압되어 자진해산 및 분산되도록 하는 방법",
                    "경쟁행위법 - 특정한 불만집단에 대한 정보활동을 강화하여 사전에 불만 및 분쟁요인을 찾아내어 해소시켜 주는 방법"},
           //17

            {"｢형사소송법｣규정에 위반하여 수사기관이 법원으로부터 영장 또는 감정처분허가장을 발부받지 아니한 채 피의자의 동의 없이 피의자의 신체로부터 혈액을 채취하고 더구나 사후적으로도 지체 없이 이에 대한 영장을 발부받지도 아니하고서 그 강제채혈한 피의자의 혈액 중 알코올농도에 관한 감정결과보고서 등은 피고인이나 변호인의 증거동의가 있다고 하더라도 유죄의 증거로 사용할 수 없다.",
                    "음주운전과 관련한 도로교통법위반죄의 범죄수사를 위하여 미성년자인 피의자의 혈액채취가 필요한 경우에도 피의자에게 의사능력이 있다면 피의자 본인만이 혈액채취에 관한 유효한 동의를 할 수 있고, 피의자에게 의사능력이 없는 경우에도 명문의 규정이 없는 이상 법정대리인이 피의자를 대리하여 동의할 수는 없다.",
                    "｢도로교통법｣에 규정된 음주측정은 성질상 강제될 수 있는 것이 아니며 궁극적으로 당사자의 자발적인 협조가 필수적인 것이므로 이를 두고 법관의 영장을 필요로 하는 강제처분이라 할 수 없다. 따라서 주취운전의 혐의자에게 영장없는 음주측정에 응할 의무를 지우고 이에 불응한 사람을 처벌한다고 하더라도 영장주의에 위배되지 아니한다.",
                    "위드마크 공식은 운전자가 음주한 상태에서 운전한 사실이 있는지에 대한 경험법칙에 의한 증거수집 방법이므로 경찰공무원에게 위드마크 공식의 존재 및 나아가 호흡측정에 의한 혈중알코올농도가 음주운전 처벌기준 수치에 미달하였더라도 위드마크 공식에 의한 역추산 방식에 의하여 운전 당시의 혈중알코올농도를 산출할 경우 그 결과가 음주운전 처벌기준 수치 이상이 될 가능성이 있다는 취지를 운전자에게 미리 고지하여야 할 의무가 있다."},



           //18

            {"㉠(O) ㉡(X) ㉢(O) ㉣(X)",
                    "㉠(X) ㉡(O) ㉢(X) ㉣(O)",
                    "㉠(O) ㉡(X) ㉢(X) ㉣(X)",
                    "㉠(O) ㉡(O) ㉢(O) ㉣(O)"},




           //19

            {"대한민국 또는 청구국의 법률에 따라 인도범죄에 관한 공소시효 또는 형의 시효가 완성된 경우에는 범죄인을 인도하여서는 아니 된다.",
                    "범죄인이 인종, 종교, 국적, 성별, 정치적 신념 또는 특정 사회단체에 속한 것 등을 이유로 처벌되거나 그 밖의 불리한 처분을 받을 염려가 있다고 인정되는 경우에는 범죄인을 인도하지 아니할 수 있다.",
                    "범죄인의 인도범죄 외의 범죄에 관하여 대한민국 법원에 재판이 계속 중인 경우 또는 범죄인이 형을 선고받고 그 집행이 끝나지 아니하거나 면제되지 아니한 경우에는 범죄인을 인도하지 아니할 수 있다.",
                    "범죄인이 인도범죄에 관하여 제3국(청구국이 아닌 외국을 말한다)에서 재판을 받고 처벌되었거나 처벌받지 아니하기로 확정된 경우에는 범죄인을 인도하지 아니할 수 있다."},
           //20

            {"검찰은 수사권과 기소권은 물론 영장청구권 및 형집행권을 가지고 있어, ‘견제와 균형’의 원리가 작동하지 않는다.",
                    "사법경찰관 작성 피의자신문조서와 검사 작성 피의자신문조서의 증거능력 차이로 인해 불필요한 중복조사가 이루어지고 있다.",
                    "경찰이 현실적으로 대부분의 범죄를 수사하고 있지만, 검찰의 과도한 수사지휘로 수사업무의 효율성이 저하되고 있다.",
                    "수사란 공소제기 및 유지를 위한 필수적인 과정이므로 검사가 수사에 적극 개입해야 한다."},





    };


    public static String mCorrectAnswers[] =
            //1
            {"질서경찰과 봉사경찰",

                    //2

                    "공무원은 ｢범죄수사규칙｣ 제15조에 따른 경찰관서 내 수사 지휘에 대한 이의제기와 관련하여 행동강령책임관에게 상담을 요청하여야 한다.",

                    //3

                    "㉢–㉡–㉤–㉠–㉣",

                   //4

                    "수임 및 수탁사무의 처리에 관한 책임은 수임 및 수탁기관에 있으므로, 위임 및 위탁기관의 장은 그에 대한 감독책임을 지지 않는다.",

                    //5
                    "㉠(X) ㉡(X) ㉢(X) ㉣(X)",


               //6
                    "경찰청장은 신규 도입 장비에 대한 안전성 검사를 실시한 후 3개월 이내에 안전성 검사 결과보고서를 국무회의에 제출하여야 한다.",

                   //7
                    "장기 10년 미만의 징역 또는 금고에 해당하는 범죄에 대한 보상금 지급기준 금액과 벌금 50만원 이하의 범죄에 대한 보상금 지급기준 금액의 합은 25만원이다.",

                    //8

                    "물품관리관으로부터 대통령령으로 정하는 바에 따라 물품의 사용에 관한 사무를 위임받은 공무원을 물품운용관이라 한다.",

                    //9

                    "각 중앙관서의 장은 매년 1월 31일까지 당해 회계연도부터 3회계연도 이상의 기간 동안의 신규사업 및 기획재정부장관이 정하는 주요 계속사업에 대한 중기사업계획서를 기획재정부장관에게 제출하여야 한다.",


                    //10

                    "134",

                    //11

                    "소음 측정 장소는 피해자가 위치한 건물 외벽에서 소음원 방향으로 1∼3.5m 떨어진 지점으로 하되, 소음도가 높을 것으로 예상되는 지점의 지면 위 1.2∼1.5m 높이에서 측정하고, 주된 건물의 경비 등을 위하여 사용되는 부속 건물, 광장·공원이나 도로상의 영업시설물, 공원의 관리사무소 등도 소음 측정 장소로 포함된다.",


                    //12
                    "이 법 제4조 제1항의 규정에 의한 경비업 허가의 유효기간은 허가받은 다음 날부터 5년으로 한다.",

                    //13
                    "자격정지 이상의 형을 선고받고 그 집행이 끝나거나 집행을 받지 아니하기로 확정된 후 3년이 지나지 아니한 자는 총포·도검·화약류·분사기·전자충격기·석궁 제조업의 허가를 받을 수 없다.",

                    //14
                    "경찰관은 원본을 봉인하기 전에 진술자 또는 변호인이 녹화물의 시청을 요구하는 때에는 영상녹화물을 재생하여 시청하게 할 수 있다. 이 경우 진술자 또는 변호인이 녹화된 내용에 대하여 이의를 진술하는 때에는 그 취지를 기재한 서면을 사건 기록에 편철하여야 한다.",


                    //15
                    "등록대상자가 6개월 이상 국외에 체류하기 위하여 출국하는 경우에는 미리 관할경찰관서의 장에게 허가를 받아야 한다.",


                   //16
                    "전이법 - 다중범죄의 발생징후나 이슈가 있을 때 집단이나 국민들의 관심을 집중시킬 수 있는 경이적인 사건을 폭로하거나 규모가 큰 행사를 개최하여 그 발생징후나 이슈가 상대적으로 약화되도록 하는 방법",

                    //17
                    "위드마크 공식은 운전자가 음주한 상태에서 운전한 사실이 있는지에 대한 경험법칙에 의한 증거수집 방법이므로 경찰공무원에게 위드마크 공식의 존재 및 나아가 호흡측정에 의한 혈중알코올농도가 음주운전 처벌기준 수치에 미달하였더라도 위드마크 공식에 의한 역추산 방식에 의하여 운전 당시의 혈중알코올농도를 산출할 경우 그 결과가 음주운전 처벌기준 수치 이상이 될 가능성이 있다는 취지를 운전자에게 미리 고지하여야 할 의무가 있다.",

                    //18
                    "㉠(O) ㉡(O) ㉢(O) ㉣(O)",

                    //19
                    "범죄인이 인종, 종교, 국적, 성별, 정치적 신념 또는 특정 사회단체에 속한 것 등을 이유로 처벌되거나 그 밖의 불리한 처분을 받을 염려가 있다고 인정되는 경우에는 범죄인을 인도하지 아니할 수 있다.",

                    //20
                    "수사란 공소제기 및 유지를 위한 필수적인 과정이므로 검사가 수사에 적극 개입해야 한다.",
    };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


