package com.perfect.admin.police1;


public class QuestionLibrary2016_3 {

    //2018 3월 24일  경찰 경찰학개론


    public   static  String mQuestions [] = {



            "1." +
                    "죄형법정주의에 관한 다음 설명 중 옳은 것은 모두 몇 개인가?  (다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 가정폭력범죄의 처벌 등에 관한 특례법상 사회봉사명령을 부과하면서, 행위시법상 사회봉사명령 부과시간의 상한인 100시간을 초과하여 상한을 200시간으로 올린 신법을 적용한 것은 위법하다.\n" +
                    "\n㉡ 군사기밀 보호법 제11조가 군사기밀 탐지·수집행위의 법정형을 10년 이하의 징역으로 규정하고 있는 것과 달리 국가보안법 제4조 제1항 제2호 (나)목의 법정형이 사형·무기 또는 7년 이상의 징역으로 규정되어 있다는 등의 사정만으로 위 조항이 지나치게 무거운 형벌을 규정하여 책임주의 원칙에 반한다거나 법정형이 형벌체계상 균형을 상실하여 평등원칙에 위배되는 조항이라고 할 수 없으며, 법관의 양형 판단 및 결정권을 중대하게 침해하는 것이라고 볼 수도 없다.\n" +
                    "\n㉢ 대법원 양형위원회가 설정한 ‘양형기준’이 발효하기 전에 공소가 제기된 범죄에 대하여 위 ‘양형기준’을 참고하여 형을 양정한 사안에서, 피고인에게 불리한 법률을 소급하여 적용한 위법이 있다고 할 수 없다.\n" +
                    "\n㉣ 형벌법규의 해석에서 위법성 및 책임의 조각사유나 소추조건 또는 처벌조각사유인 형면제 사유에 관하여 그 범위를 제한적으로 유추적용하게 되면 행위자의 가벌성의 범위는 축소된다.",


            "2." +
                    "부작위범에 관한 다음 설명 중 가장 적절하지 않은 것은?  (다툼이 있으면 판례에 의함)",



            "3." +
                    "다음 설명 중 가장 적절하지 않은 것은?(다툼이 있으면 판례에 의함)",


            "4. " +
                    "위법성 조각사유에 관한 다음 설명 중 가장 적절한 것은?(다툼이 있으면 판례에 의함)",





            "5. " +
                    "다음 설명 중 옳은 것은 모두 몇 개인가?(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 자신의 강도상해 범행을 일관되게 부인하였으나 유죄판결이 확정된 甲이 별건으로 기소된 공범 乙의 형사사건에서 증인으로 출석하여 자신의 범행사실을 부인하는 증언을 한 경우, 자신에 대한 형사사건에서 시종일관 그 범행을 부인하였다고 하여 甲에 대하여 사실대로 증언할 기대가능성이 없다고 볼 수 없다.\n" +
                    "\n㉡ 정신적 장애가 있는 자라고 하여도 범행 당시 정상적인 사물변별능력이나 행위통제능력이 있었다면 심신장애로 볼 수 없다.\n" +
                    "\n㉢ 심신장애로 인하여 사물을 변별할 능력이나 의사를 결정할 능력이 미약한 자의 행위는 형을 감경할 수 있다.\n" +
                    "\n㉣ 일본 영주권을 가진 재일교포가 영리를 목적으로 관세물품을 구입한 것이 아니라거나 국내 입국시 관세신고를 하지 않아도 되는 것으로 착오하였다는 등의 사정은 형법 제16조의 법률의 착오에 해당한다.\n" +
                    "\n㉤ 원인에 있어서 자유로운 행위에 관한 형법 제10조 제3항은 위험의 발생을 예견할 수 있었는데도 자의로 심신장애를 야기한 경우에는 적용되지 않는다.",





            "6. " +
                    "다음 설명 중 옳은 것은 모두 몇 개인가?(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 준강도의 주체는 절도 즉 절도범인으로, 절도의 실행에 착수한 이상 미수이거나 기수이거나 불문하고, 야간에 타인의 재물을 절취할 목적으로 사람의 주거에 침입한 경우에는 주거에 침입한 단계에서 이미 형법 제330조에서 규정한 야간주거침입절도죄라는 범죄행위의 실행에 착수한 것이라고 보아야 한다.\n" +
                    "\n㉡ 주거침입죄의 경우 주거침입의 범의로써 예컨대, 주거로 들어가는 문의 시정장치를 부수거나 문을 여는 등 침입을 위한 구체적 행위를 시작하였다면 주거침입죄의 실행의 착수는 있었다고 보아야 한다.\n" +
                    "\n㉢ 주거침입죄의 실행의 착수는 주거자, 관리자, 점유자 등의 의사에 반하여 주거나 관리하는 건조물 등에 들어가는 행위 즉, 구성요건의 일부를 실현하는 행위까지 요구하는 것은 아니고, 범죄구성요건의 실현에 이르는 현실적 위험성을 포함하는 행위를 개시하는 것으로 족하다.\n" +
                    "\n㉣ 야간에 아파트에 침입하여 물건을 훔칠 의도하에 아파트의 베란다 철제난간까지 올라가 유리창문을 열려고 시도하였다면 야간주거침입절도죄의 실행에 착수한 것으로 보아야 한다.",



            "7. " +
                    "공범에 관한 다음 설명 중 틀린 것은 모두 몇 개인가?\n" +
                    "  (다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 우연히 만난 자리에서 서로 협력하여 공동의 범의를 실현하려는 의사가 암묵적으로 상통하여 범행에 공동가공하더라도 공동정범은 성립된다.\n" +
                    "\n㉡ 결과적 가중범인 상해치사죄의 공동정범은 폭행 기타의 신체침해행위를 공동으로 할 의사가 있으면 성립되고 결과를 공동으로 할 의사는 필요 없다.\n" +
                    "\n㉢ 타인을 교사하여 죄를 범하게 한 자는 죄를 실행한 자와 동일한 형으로 처벌한다.\n" +
                    "\n㉣ 교사를 받은 자가 범죄의 실행을 승낙하고 실행의 착수에 이르지 아니한 때에는 교사자와 피교사자를 음모 또는 예비에 준하여 처벌한다." ,





            "8. " +
                    "다음 설명 중 가장 적절한 것은?(다툼이 있으면 판례에 의함)",




            "9. " +
                    "다음 설명 중 가장 적절하지 않은 것은?(다툼이 있으면 판례에 의함)",



            "10. " +
                    "다음 설명 중 가장 적절하지 않은 것은?(다툼이 있으면 판례에 의함)",





            "11." +
                    "다음 설명 중 가장 적절하지 않은 것은?(다툼이 있으면 판례에 의함)",




            "12." +
                    "다음 설명 중 옳은 것은 모두 몇 개인가?(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 전국교직원노동조합 소속 교사가 작성·배포한 보도자료의 일부에 사실과 다른 기재가 있으나 전체적으로 그 기재 내용이 진실하고 공공의 이익을 위한 것이라도 명예훼손죄의 위법성이 조각되지 않는다.\n" +
                    "\n㉡ 객관적으로 피해자의 사회적 평가를 저하시키는 사실에 관한 보도내용이 소문이나 제3자의 말, 보도를 인용하는 방법으로 단정적인 표현이 아닌 전문 또는 추측한 것을 기사화한 형태로 표현하였지만, 그 표현 전체의 취지로 보아 그 사실이 존재할 수 있다는 것을 암시하는 방식으로 이루어진 경우에는 사실을 적시한 것이라고 보아야 한다.\n" +
                    "\n㉢ 통상 기자가 아닌 보통 사람에게 사실을 적시할 경우에는 그 자체로서 적시된 사실이 외부에 공표되는 것이므로 그 때부터 곧 전파가능성을 따져 공연성 여부를 판단하여야 할 것이고, 이는 기자를 통해 사실을 적시하는 경우라고 하여 달리 볼 것이 아니다.\n" +
                    "\n㉣ 명예훼손죄가 성립하기 위하여는 사실의 적시가 있어야 하는데, 여기에서 적시의 대상이 되는 사실이란 현실적으로 발생하고 증명할 수 있는 과거 또는 현재의 사실을 말하며, 장래의 일을 적시하는 경우에는 그것이 과거 또는 현재의 사실을 기초로 하거나 이에 대한 주장을 포함하는 경우라도 명예훼손죄가 성립한다고 할 수는 없다.",




            "13. " +
                    "친족상도례에 관한 다음 설명 중 옳은 것은 모두 몇 개인가?(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 강도죄, 손괴죄, 경계침범죄, 강제집행면탈죄에 대해서는 친족상도례가 적용되지 아니한다.\n" +
                    "\n㉡ 피고인이 백화점 내 점포에 입점시켜 주겠다고 속여 피해자로부터 입점비 명목으로 돈을 편취하였다며 사기로 기소된 경우, 피고인의 딸과 피해자의 아들이 혼인하여 피고인과 피해자가 사돈지간이라고 하더라도 민법상 친족으로 볼 수 없으므로 위 범죄를 친족상도례가 적용되는 친고죄라고 할 수 없다. \n" +
                    "\n㉢ 횡령죄에서 친족상도례는 횡령범인과 피해물건의 소유자 또는 보관자 중 어느 한쪽과의 사이에만 친족관계가 있더라도 적용된다.\n" +
                    "\n㉣ 장물범이 피해자와 동거하지 않는 직계혈족인 경우에는 그 동거여부를 불문하고 형을 면제한다.",




            "14. " +
                    "절도의 죄에 관한 다음 설명 중 가장 적절하지 않은 것은?\n" +
                    "   (다툼이 있으면 판례에 의함)",


            "15." +
                    "사기죄에 관한 다음 설명 중 가장 적절하지 않은 것은?(다툼이 있으면 판례에 의함)",



            "16. " +
                    "횡령죄에 관한 다음 설명 중 가장 적절하지 않은 것은?(다툼이 있으면 판례에 의함)",



            "17. " +
                    "다음 설명 중 가장 적절한 것은?(다툼이 있으면 판례에 의함)",





            "18. " +
                    "다음 설명 중 옳은 것은 모두 몇 개인가?(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 위조통화임을 알고 있는 자에게 그 위조통화를 교부한 경우에 피교부자가 이를 유통시키리라는 것을 예상 내지 인식하면서 교부하였다면, 그 교부행위 자체가 통화에 대한 공공의 신용 또는 거래의 안전을 해할 위험이 있으므로 위조통화행사죄가 성립한다.\n" +
                    "\n㉡ 통화에 관한 죄는 외국인의 국내범은 처벌하지만 외국인의 국외범은 처벌하지 아니한다.\n" +
                    "\n㉢ 형법 제207조 제3항의 외국에서 통용하는 지폐에 일반인의 관점에서 통용할 것이라고 오인할 가능성이 있는 지폐까지 포함시킨다면 이는 유추해석 내지 확장해석하여 적용하는 것이 되어 죄형법정주의의 원칙에 어긋나는 것으로 허용되지 않는다.\n" +
                    "\n㉣ 일본국의 자동판매기 등에 투입하여 일본국의 500￥(엔)짜리 주화처럼 사용하기 위해 한국은행 발행 500원짜리 주화의 표면 일부를 깎아내어 손상을 가한 경우 통화변조에 해당한다.",





            "19. " +
                    "공무집행방해죄에 관한 다음 설명 중 가장 적절하지 않은 것은?(다툼이 있으면 판례에 의함)",




            "20. " +
                    "다음 설명 중 옳은 것은 모두 몇 개인가?(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 친족 또는 동거의 가족이 본인을 위하여 범인은닉·도피죄(형법 제151조 제1항)를 범한 때에는 처벌하지 아니한다.\n" +
                    "\n㉡ 범인도피죄는 범인을 도피하게 함으로써 기수에 이르지만, 범인도피행위가 계속되는 동안에는 범죄행위도 계속되고 행위가 끝날 때 비로소 범죄행위가 종료된다. 따라서 공범자의 범인도피행위 도중에 그 범행을 인식하면서 그와 공동의 범의를 가지고 기왕의 범인도피상태를 이용하여 스스로 범인도피행위를 계속한 경우에는 범인도피죄의 공동정범이 성립한다.\n" +
                    "\n㉢ 범인이 기소중지자임을 알고도 범인의 부탁으로 다른 사람의 명의로 대신 임대차계약을 체결해 준 경우, 비록 임대차계약서가 공시되는 것은 아니라 하더라도 수사기관이 탐문수사나 신고를 받아 범인을 발견하고 체포하는 것을 곤란하게 하여 범인도피죄에 해당한다.",


    };





    public  static String mChoices [][] = {


            //1

            {"1개",
                    "2개",
                    "3개",
                    "4개"},



            //2

            {"甲이 자신의 토지에 대하여 여객정류장시설 또는 유통업무설비시설을 설치하는 도시계획이 입안되어 있어 장차 위 토지가 수용될 것이라는 점을 알고 있으면서도, 이러한 사정을 모르고 위 토지를 매수하려는 乙에게 그 사정을 고지하지 아니하고 매도한 경우 甲에게는 乙에 대한 부작위에 의한 사기죄가 성립한다.",
                    "매수인이 매도인에게 매매잔금을 지급함에 있어 착오에 빠져 지급해야 할 금액을 초과하는 돈을 교부하는 경우, 매도인이 매매잔금을 받은 후 비로소 그 사실을 알게 되었음에도 불구하고 그 사실을 매수인에게 알리고 초과금액을 되돌려 주지 않은 경우에는 부작위에 의한 사기죄가 성립한다.",
                    "출판사 경영자가 출고현황표를 조작하는 방법으로 실제출판부수를 속여 작가에게 인세의 일부만을 지급한 사안에서, 작가가 나머지 인세에 대한 청구권의 존재 자체를 알지 못하는 착오에 빠져 이를 행사하지 아니한 것이 사기죄에 있어 부작위에 의한 처분행위에 해당한다.",
                    "형법이 금지하고 있는 법익침해의 결과발생을 방지할 법적인 작위의무를 지고 있는 자가 그 의무를 이행함으로써 결과발생을 쉽게 방지할 수 있었음에도 불구하고 그 결과의 발생을 용인하고 이를 방관한 채 그 의무를 이행하지 아니한 경우에, 그 부작위가 작위에 의한 법익침해와 동등한 형법적 가치가 있는 것이어서 그 범죄의 실행행위로 평가될 만한 것이라면, 작위에 의한 실행행위와 동일하게 부작위범으로 처벌할 수 있다."},


            //3

            {"미필적 고의가 인정되기 위해서는 범죄사실의 발생가능성에 대한 인식이 있음은 물론 나아가 범죄사실이 발생할 위험을 용인하는 내심의 의사가 있어야 한다.",
                    "강도가 베개로 피해자의 머리부분을 약 3분간 누르던 중 피해자가 저항을 멈추고 사지가 늘어졌음에도 계속하여 누른 행위에 살해의 고의가 있다.",
                    "범죄의 고의는 확정적 고의뿐만 아니라 결과 발생에 대한 인식이 있고 그를 용인하는 의사인 이른바 미필적 고의도 포함하므로 형법 제307조 제2항의 허위사실 적시에 의한 명예훼손죄 역시 미필적 고의에 의하여도 성립하고, 위와 같은 법리는 형법 제308조의 사자명예훼손죄의 판단에서도 마찬가지로 적용된다.",
                    "야간에 신체의 일부가 집 안으로 들어간다는 인식하에 타인의 집의 창문을 열고 집 안으로 얼굴을 들이미는 행위를 하였다면 주거침입죄의 범의는 인정되지 않는다."},

            //4

            {"이혼소송중인 남편이 찾아와 가위로 폭행하고 변태적 성행위를 강요하는 데에 격분하여 칼로 남편의 복부를 찔러 사망에 이르게 한 경우, 그 행위는 과잉방위에 해당한다.",
                    "현행범인으로서의 요건을 갖추고 있었다고 인정되지 않는 상황에서 경찰관들이 동행을 거부하는 자를 체포하거나 강제로 연행하려고 하였다면, 이는 적법한 공무집행이라고 볼 수 없고, 그 체포를 면하려고 반항하는 과정에서 경찰관에게 상해를 가한 것은 불법체포로 인한 신체에 대한 현재의 부당한 침해에서 벗어나기 위한 행위로서 정당방위에 해당하여 위법성이 조각된다.",
                    "형법 제24조(피해자의 승낙)에 따르면, 처분할 수 있는 자의 승낙에 의하여 그 법익을 훼손한 행위는 법률에 특별한 규정이 있는 경우에 한하여 벌하지 아니한다.",
                    "검문 중이던 경찰관들이, 자전거를 이용한 날치기 사건 범인과 흡사한 인상착의의 甲이 자전거를 타고 다가오는 것을 발견하고 정지를 요구하였으나 멈추지 않아, 앞을 가로막고 소속과 성명을 고지한 후 검문에 협조해 달라는 취지로 말하였음에도 불응하고 그대로 전진하자, 따라가서 재차 앞을 막고 검문에 응하라고 요구하였는데, 이에 甲이 경찰관들의 멱살을 잡아 밀치거나 욕설을 하는 등 항의를 하였다면 甲의 행위는 정당방위에 해당한다."},


            //5

            {"2개",
                    "3개",
                    "4개",
                    "5개"},



            //6

            {"1개",
                    "2개",
                    "3개",
                    "4개"},


            //7

            {"0개",
                    "1개",
                    "2개",
                    "3개"},


            //8

            {"甲이 승용차를 운전하던 중 음주단속을 피하기 위하여 위험한 물건인 승용차로 단속 경찰관을 들이받아 위 경찰관의 공무집행을 방해하고 위 경찰관에게 상해를 입게 하였다면 甲의 행위는 폭력행위등처벌에관한법률위반(집단･흉기 등 상해)죄와 특수공무집행방해치상죄를 구성하고 두 죄는 상상적 경합관계에 해당한다.",
                    "계속적으로 무면허운전을 할 의사를 가지고 여러 날에 걸쳐 무면허운전행위를 반복하였다면 이를 포괄일죄로 보아야 한다.",
                    "부정한 이익을 얻을 목적으로 타인의 영업비밀이 담긴 CD를 절취하여 그 영업비밀을 부정사용한 경우, 영업비밀의 부정사용행위는 절도죄의 불가벌적 사후행위에 해당한다.",
                    "저작권법은 상습으로 동법 제136조 제1항의 죄를 저지른 경우를 가중처벌한다는 규정은 따로 두고 있지 않다. 따라서 수회에 걸쳐 저작권법 제136조 제1항의 죄를 범한 것이 상습성의 발현에 따른 것이라고 하더라도, 이는 원칙적으로 경합범으로 보아야 하는 것이지 하나의 죄로 처단되는 상습범으로 볼 것은 아니다."},

            //9

            {"甲은 같이 사냥을 하던 동료 乙을 살해하려고 총을 쏘았는데 사격이 미숙하여 옆 자리의 丙이 총알에 맞아 사망하였다. 이 경우 구성요건적 착오에 관한 학설 중 구체적 부합설과 법정적 부합설의 결론은 다르다.",
                    "甲은 평소 乙의 심한 괴롭힘을 참을 수 없어서 늦은 밤에 乙을 뒤따라가 등을 칼로 찔렀으나 실제로는 乙과 비슷한 외모의 丙이 살해되었다. 이 경우 구성요건적 착오에 관한 구체적 부합설 및 법정적 부합설에 의하면 발생사실에 대하여 고의가 인정되어 丙에 대한 살인죄가 성립한다.",
                    "甲이 살해의도로 丙을 향하여 발포하였으나 빗나가 옆에 있던 乙에게 명중하여 사망한 경우, 구성요건적 착오에 관한 어떤 학설에 의할 때도 乙에 대한 살인죄가 성립한다.",
                    "고인의 구타행위로 상해를 입은 피해자가 정신을 잃고 빈사상태에 빠지자 사망한 것으로 오인하고, 자신의 행위를 은폐하고 피해자가 자살한 것처럼 가장하기 위하여 피해자를 베란다 아래의 바닥으로 떨어뜨려 사망케 하였다면, 피고인의 행위는 포괄하여 단일의 상해치사죄에 해당한다."},

            //10

            {"조상천도제를 지내지 아니하면 좋지 않은 일이 생긴다는 취지의 해악의 고지는 길흉화복이나 천재지변의 예고로서 행위자에 의하여 직접·간접적으로 좌우될 수 없는 것이고 가해자가 현실적으로 특정되어 있지도 않으며 해악의 발생가능성이 합리적으로 예견될 수 있는 것이 아니므로 협박으로 평가될 수 없다.",
                    "폭행죄는 미수범 처벌규정이 없으나, 협박죄의 미수범은 처벌된다.",
                    "甲정당의 국회 예산안 강행처리에 화가 나서 경찰서에 전화를 걸어 전화를 받은 경찰관에게 관할구역에 있는 甲정당의 당사를 폭파하겠다고 말한 행위는 공무집행방해죄뿐만 아니라 그 경찰관에 대한 협박죄를 구성한다.",
                    "“앞으로 수박이 없어지면 네 책임으로 한다”고 말한 것은 해악의 고지라고 보기 어렵고, 가사 다소간의 해악의 고지에 해당한다고 가정하더라도 위법성이 없다."},

            //11


            {"감금죄는 사람의 행동의 자유를 그 보호법익으로 하여 사람이 특정한 구역에서 나가는 것을 불가능하게 하거나 또는 심히 곤란하게 하는 그 장해는 물리적, 유형적 장해 뿐만 아니라 심리적, 무형적 장해에 의하여서도 가능하다.",
                    "피해자를 강제로 승용차에 태우고 가면서 피해자의 금품을 강취하기 위해 상해를 가한 후 금품을 강취한 다음 피해자를 태운 채 계속하여 상당한 거리를 운전하여 간 경우 강도상해죄와 감금죄의 상상적 경합이 된다.",
                    "피해자가 만약 도피하는 경우에는 생명, 신체에 심한 해를 당할지도 모른다는 공포감에서 도피하기를 단념하고 있는 상태 하에서 호텔로 데리고 가서 함께 유숙한 후 함께 항공기로 국외에 나간 행위는 감금죄를 구성한다.",
                    "감금행위가 강간죄나 강도죄의 수단이 된 경우에도 감금죄는 강간죄나 강도죄에 흡수되지 아니하고 별죄를 구성한다."},


            //12

            {"1개",
                    "2개",
                    "3개",
                    "4개"},

            //13

            {"1개",
                    "2개",
                    "3개",
                    "4개"},



            //14

            {"타인의 명의를 모용하여 발급받은 신용카드를 사용하여 현금자동지급기에서 현금대출을 받는 행위는 카드회사에 의하여 미리 포괄적으로 허용된 행위가 아니라, 현금자동지급기의 관리자의 의사에 반하여 그의 지배를 배제한 채 그 현금을 자기의 지배하에 옮겨 놓는 행위로서 절도죄에 해당한다.",
                    "타인의 연구소에 식재된 연산홍을 절취하기 위하여 땅에서 캐낸 것만으로 절도죄는 기수에 이르는 것이 아니라, 이를 피고인의 승용차에 운반하거나 반출하는 등의 행위를 함으로써 절도죄가 기수에 이른다.",
                    "피고인 甲이 자신의 모(母) 乙명의로 구입·등록하여 乙에게 명의신탁한 자동차를 丙에게 담보로 제공한 후, 丙 몰래 가져가 절취하였다는 내용으로 기소된 사안에서, 丙에 대한 관계에서 자동차의 소유자는 乙이고 피고인 甲은 소유자가 아니므로 丙이 점유하고 있는 자동차를 임의로 가져간 이상 절도죄가 성립한다.",
                    "타인의 예금통장을 무단 사용하여 예금을 인출한 후 바로 예금통장을 반환하였다 하더라도 그 사용으로 인한 위와 같은 경제적 가치의 소모가 무시할 수 있을 정도로 경미한 경우가 아닌 이상, 예금통장 자체가 가지는 예금액 증명기능의 경제적 가치에 대한 불법영득의 의사를 인정할 수 있으므로 절도죄가 성립한다."},


            //15

            {"중고 자동차 매매에 있어서 매도인의 할부금융회사 또는 보증보험에 대한 할부금 채무가 매수인에게 당연히 승계되는 것은 아니므로 그 할부금 채무의 존재를 매수인에게 고지하지 아니한 것은 부작위에 의한 기망에 해당하지 아니한다.",
                    "예금주인 피고인이 제3자에게 편취당한 송금의뢰인으로부터 자신의 은행계좌에 계좌 송금된 돈을 출금한 사안에서, 피고인은 예금주로서 은행에 대하여 예금반환을 청구할 수 있는 권한을 가진 자이므로, 위 은행을 피해자로 한 사기죄가 성립하지 않는다.",
                    "사기죄에 있어서 재물의 교부가 있었다고 하기 위하여는 반드시 재물의 현실의 인도가 필요한 것이므로, 재물이 범인의 사실상의 지배 아래에 들어가 그의 자유로운 처분이 가능한 상태에 놓인 경우라도 재물의 현실의 인도가 없다면 재물의 교부가 있었다고 할 수 없다.",
                    "금융기관 직원이 전산단말기를 이용하여 다른 공범들이 지정한 특정계좌에 돈이 입금된 것처럼 허위의 정보를 입력하는 방법으로 위 계좌로 입금되도록 한  경우, 그 후 입금이 취소되어 현실적으로 인출되지 못하였다고 하더라도 이미 성립한 컴퓨터등사용사기죄에 어떤 영향이 있다고 할 수는 없다."},


            //16

            {"甲주식회사 대표이사인 피고인이 자신의 채권자 乙에게 차용금에 대한 담보로 甲회사 명의 정기예금에 질권을 설정하여 주었는데, 그 후 乙이 차용금과 정기예금의 변제기가 모두 도래한 이후 피고인의 동의하에 정기예금 계좌에 입금되어 있던 甲회사 자금을 전액 인출하였다면 배임죄와 별도로 횡령죄까지 성립한다.",
                    "횡령죄에 있어서 보관이라 함은 재물이 사실상 지배하에 있는 경우 뿐만 아니라 법률상의 지배･처분이 가능한 상태를 모두 가리키는 것으로 타인의 금전을 위탁받아 보관하는 자는 보관방법으로 이를 은행 등의 금융기관에 예치한 경우에도 보관자의 지위를 갖는 것이다.",
                    "명의수탁자가 신탁 받은 부동산의 일부에 대한 토지수용보상금 중 일부를 소비하고, 이어 수용되지 않은 나머지 부동산 전체에 대한 반환을 거부한 경우, 그 반환거부행위는 별개의 횡령죄가 성립한다.",
                    "사립학교에 있어서 학교교육에 직접 필요한 시설, 설비를 위한 경비 등과 같이 원래 교비회계에 속하는 자금으로 지출할 수 있는 항목에 관한 차입금을 상환하기 위하여 교비회계자금을 지출한 경우, 이러한 차입금 상환행위에 관하여 교비회계 자금을 임의로 횡령하고자 하는 불법영득의 의사가 있다고 보기 어렵다."},
            //17

            {"주식회사의 지배인이 자신을 그 회사의 대표이사로 표시하여 연대보증채무를 부담하는 취지의 회사 명의의 차용증을 작성·교부한 경우, 그 문서에 일부 허위 내용이 포함되거나 위 연대보증행위가 회사의 이익에 반하는 것이더라도 사문서위조 및 위조사문서행사에 해당하지 않는다.",
                    "공무원이 여러 차례의 출장반복의 번거로움을 회피하고 민원사무를 신속히 처리한다는 방침에 따라 사전에 출장조사한 다음 출장조사 내용이 변동없다는 확신하에 출장복명서를 작성하고 다만 그 출장일자를 작성일자로 기재한 경우 허위공문서작성죄가 성립한다.",
                    "공립학교 교사가 작성하는 교원의 인적사항과 전출희망사항 등을 기재하는 부분과 학교장이 작성하는 학교장의견란 등으로 구성되어 있는 교원실태조사카드의 교사 명의 부분을 명의자의 의사에 반하여 작성한 행위는 공문서위조죄를 구성한다.",
                    "권한 없는 자가 임의로 인감증명서의 사용용도란에 나오는 기재사항을 고쳐 쓴 경우에는 공문서변조죄가 성립한다."},



            //18

            {"1개",
                    "2개",
                    "3개",
                    "4개"},




            //19

            {"위법한 집회·시위가 장차 특정지역에서 개최될 것이 예상된다고 하더라도, 이와 시간적·장소적으로 근접하지 않은 다른 지역에서 그 집회·시위에 참가하기 위하여 출발 또는 이동하는 행위를 함부로 제지하는 것은 공무집행방해죄의 보호대상이 되는 공무원의 적법한 직무집행이 아니다.",
                    "위계에 의한 공무집행방해죄(형법 제137조)에 있어서 구체적인 공무집행을 저지하거나 현실적으로 곤란하게 하는 데까지는 이르지 아니하고 미수에 그친 경우, 위계에 의한 공무집행방해죄로 처벌할 수는 없다.",
                    "불심검문을 하게 된 경위, 불심검문 당시의 현장상황과 검문을 하는 경찰관들의 복장, 피고인이 공무원증 제시나 신분 확인을 요구하였는지 여부 등을 종합적으로 고려하여, 검문하는 사람이 경찰관이고 검문하는 이유가 범죄행위에 관한 것임을 피고인이 충분히 알고 있었다고 보이는 경우에는 신분증을 제시하지 않았다고 하여 그 불심검문이 위법한 공무집행이라고 할 수 없다.",
                    "공무집행방해죄(형법 제136조 제1항)에 있어서의 범의는 상대방이 직무를 집행하는 공무원이라는 사실, 그리고 이에 대하여 폭행 또는 협박을 한다는 사실을 인식하는 것을 그 내용으로 하고, 그 인식은 불확정적인 것이라도 소위 미필적 고의가 있다고 보아야 하며, 그 직무집행을 방해할 의사를 반드시 필요로 한다."},
            //20

            {"0개",
                    "1개",
                    "2개",
                    "3개"},





    };


    public static String mCorrectAnswers[] =
            //1
            {"3개",

                    //2

                    "매수인이 매도인에게 매매잔금을 지급함에 있어 착오에 빠져 지급해야 할 금액을 초과하는 돈을 교부하는 경우, 매도인이 매매잔금을 받은 후 비로소 그 사실을 알게 되었음에도 불구하고 그 사실을 매수인에게 알리고 초과금액을 되돌려 주지 않은 경우에는 부작위에 의한 사기죄가 성립한다.",

                    //3

                    "야간에 신체의 일부가 집 안으로 들어간다는 인식하에 타인의 집의 창문을 열고 집 안으로 얼굴을 들이미는 행위를 하였다면 주거침입죄의 범의는 인정되지 않는다.",

                    //4

                    "현행범인으로서의 요건을 갖추고 있었다고 인정되지 않는 상황에서 경찰관들이 동행을 거부하는 자를 체포하거나 강제로 연행하려고 하였다면, 이는 적법한 공무집행이라고 볼 수 없고, 그 체포를 면하려고 반항하는 과정에서 경찰관에게 상해를 가한 것은 불법체포로 인한 신체에 대한 현재의 부당한 침해에서 벗어나기 위한 행위로서 정당방위에 해당하여 위법성이 조각된다.",

                    //5
                    "2개",


                    //6
                    "4개",

                    //7
                    "0개",

                    //8

                    "저작권법은 상습으로 동법 제136조 제1항의 죄를 저지른 경우를 가중처벌한다는 규정은 따로 두고 있지 않다. 따라서 수회에 걸쳐 저작권법 제136조 제1항의 죄를 범한 것이 상습성의 발현에 따른 것이라고 하더라도, 이는 원칙적으로 경합범으로 보아야 하는 것이지 하나의 죄로 처단되는 상습범으로 볼 것은 아니다.",

                    //9

                    "甲이 살해의도로 丙을 향하여 발포하였으나 빗나가 옆에 있던 乙에게 명중하여 사망한 경우, 구성요건적 착오에 관한 어떤 학설에 의할 때도 乙에 대한 살인죄가 성립한다.",


                    //10

                    "甲정당의 국회 예산안 강행처리에 화가 나서 경찰서에 전화를 걸어 전화를 받은 경찰관에게 관할구역에 있는 甲정당의 당사를 폭파하겠다고 말한 행위는 공무집행방해죄뿐만 아니라 그 경찰관에 대한 협박죄를 구성한다.",

                    //11

                    "피해자를 강제로 승용차에 태우고 가면서 피해자의 금품을 강취하기 위해 상해를 가한 후 금품을 강취한 다음 피해자를 태운 채 계속하여 상당한 거리를 운전하여 간 경우 강도상해죄와 감금죄의 상상적 경합이 된다.",


                    //12
                    "1개",

                    //13
                    "3개",

                    //14
                    "타인의 연구소에 식재된 연산홍을 절취하기 위하여 땅에서 캐낸 것만으로 절도죄는 기수에 이르는 것이 아니라, 이를 피고인의 승용차에 운반하거나 반출하는 등의 행위를 함으로써 절도죄가 기수에 이른다.",


                    //15
                    "사기죄에 있어서 재물의 교부가 있었다고 하기 위하여는 반드시 재물의 현실의 인도가 필요한 것이므로, 재물이 범인의 사실상의 지배 아래에 들어가 그의 자유로운 처분이 가능한 상태에 놓인 경우라도 재물의 현실의 인도가 없다면 재물의 교부가 있었다고 할 수 없다.",


                    //16
                    "甲주식회사 대표이사인 피고인이 자신의 채권자 乙에게 차용금에 대한 담보로 甲회사 명의 정기예금에 질권을 설정하여 주었는데, 그 후 乙이 차용금과 정기예금의 변제기가 모두 도래한 이후 피고인의 동의하에 정기예금 계좌에 입금되어 있던 甲회사 자금을 전액 인출하였다면 배임죄와 별도로 횡령죄까지 성립한다.",

                    //17
                    "주식회사의 지배인이 자신을 그 회사의 대표이사로 표시하여 연대보증채무를 부담하는 취지의 회사 명의의 차용증을 작성·교부한 경우, 그 문서에 일부 허위 내용이 포함되거나 위 연대보증행위가 회사의 이익에 반하는 것이더라도 사문서위조 및 위조사문서행사에 해당하지 않는다.",

                    //18
                    "2개",

                    //19
                    "공무집행방해죄(형법 제136조 제1항)에 있어서의 범의는 상대방이 직무를 집행하는 공무원이라는 사실, 그리고 이에 대하여 폭행 또는 협박을 한다는 사실을 인식하는 것을 그 내용으로 하고, 그 인식은 불확정적인 것이라도 소위 미필적 고의가 있다고 보아야 하며, 그 직무집행을 방해할 의사를 반드시 필요로 한다.",

                    //20
                    "3개",
            };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


