package com.perfect.admin.police1;


public class QuestionLibrary2015_1 {

    //2015 3월 24일  경찰 경찰학개론


    public   static  String mQuestions [] = {



            "1." +
                    "청동기 시대의 문화에 대한 설명으로 가장 적절하지 않은 것은?",


            "2." +
                    "다음 보기 (가)∼(라)에 해당하는 나라의 설명으로 가장 적절한 것은?" +
                    "\n\n\n(가) 건국 초기부터 주변의 소국들을 정복하고 평야 지대로 진출\n" +
                    "하고자 하였다. 그리하여 압록강 가의 국내성으로 옮겨 5부족 \n" +
                    "연맹을 토대로 발전하였다. 그 후, 활발한 정복 전쟁으로 한의 \n" +
                    "군현을 공략하여 요동 지방으로 진출하였다. " +
                    "\n(나) 어물과 소금 등 해산물이 풍부하였고, 토지가 비옥하여 농사가\n" +
                    "잘 되었으며, 가족이 죽으면 시체를 가매장하였다가 나중에\n" +
                    "그 뼈를 추려서 가족 공동 무덤인 커다란 목곽에 안치하였다" +
                    "\n(다) 명주와 삼베를 짜는 등 방직 기술이 발달하였고, 특산물로는\n" +
                    "단궁과 과하마, 반어피 등이 유명하였다. " +
                    "\n(라) 수렵 사회의 전통을 보여 주는 제천 행사가 12월에 열렸으며, 이 때에는 하늘에 제사를 지내고 노래와 춤을 즐겼으며, 죄수를 풀어 주기도 하였다. 전쟁이 일어났을 때에는 제천\n" +
                    "의식을 행하고, 소를 죽여 그 굽으로 길흉을 점치기도 하였다.",



            "3." +
                    "우리나라가 일본에 전파한 문화에 대한 설명으로 가장 적절하지 " +
                    "않은 것은?" +
                    "토지는 논, 밭, 촌주위답, 내시령답 등 토지의 종류와 면적을 \n" +
                    "기록하고, 사람들은 인구, 가호, 노비의 수와 3년 동안의 사망, 이동 등 변동 내용을 기록하였다. 그 밖에, 소와 말의 수, 뽕나무, 잣나무, 호두나무의 수까지 기록하였다. 특히, 사람은 남녀별로 구분하고, 16세에서 60세의 남자의 연령을\n" +
                    "기준으로 나이에 따라 6등급으로 구분하여 기록하였다. 호(가구)는\n" +
                    "사람의 많고 적음에 따라 상상호(上上戶)에서 하하호 (下下戶)까지\n" +
                    "9등급으로 나누어 파악하였다. 기록된 4개 촌은 호구 43개에\n" +
                    "총인구는 노비 25명을 포함하여 442명(남 194, 여 248)이며, 소 53마리, 말 61마리, 뽕나무 4,249그루 등의 재산을 소유하고 있었다.",


            "4. " +
                    " 다음 보기가 설명하는 문서에 대한 내용으로 가장 적절하지 \n" +
                    "않은 것은?" +
                    "\n\n\n토지는 논, 밭, 촌주위답, 내시령답 등 토지의 종류와 면적을 \n" +
                    "기록하고, 사람들은 인구, 가호, 노비의 수와 3년 동안의 사망, 이동 등 변동 내용을 기록하였다. 그 밖에, 소와 말의 수, 뽕나무, 잣나무, 호두나무의 수까지 기록하였다. 특히, 사람은 남녀별로 구분하고, 16세에서 60세의 남자의 연령을\n" +
                    "기준으로 나이에 따라 6등급으로 구분하여 기록하였다. 호(가구)는\n" +
                    "사람의 많고 적음에 따라 상상호(上上戶)에서 하하호 (下下戶)까지\n" +
                    "9등급으로 나누어 파악하였다. 기록된 4개 촌은 호구 43개에\n" +
                    "총인구는 노비 25명을 포함하여 442명(남 194, 여 248)이며, 소 53마리, 말 61마리, 뽕나무 4,249그루 등의 재산을 소유하고 있었다.",





            "5. " +
                    "다음 보기의 출신에 대한 설명으로 가장 적절하지 않은 것은?" +
                    "\n\n\n ⦁관등 승진의 상한선은 아찬까지였다." +
                    "\n\n ⦁이 골품에 해당하는 자는 비색 공복(公服)은 입을 수 있었으나, 자색 공복(公服)은 입을 수 없었다. ",





            "6. " +
                    "발해에 대한 설명으로 가장 적절하지 않은 것은?",



            "7. " +
                    "삼국시대의 정치 발전에 대한 설명으로 가장 적절하지 않은 것은?" ,





            "8. " +
                    "고려시대의 문화에 대한 설명으로 가장 적절하지 않은 것은?",




            "9. " +
                    "고려시대 불교에 대한 설명으로 가장 적절한 것은?",



            "10. " +
                    "조선시대 과학기술에 대한 설명으로 가장 적절한 것은?",





            "11." +
                    "밑줄 친 ‘내’가 재위한 시대에 있었던 일로 가장 적절한 것은?" +
                    "\n\n\n 상왕이 어려서 무릇 조치하는 바는 모두 김종서 등에게 맡겨 논의, 시행하였다. 지금 (‘내’)가 명을 받아 왕통을 계승하여 군국 서무를\n" +
                    "아울러 모두 처리하며, 조종의 옛 제도를 모두 복구한다. 지금부터\n" +
                    "형조의 사형수를 제외한 모든 서무는 6조가 각각 그 직무를 \n" +
                    "담당하여 직계한다",




            "12." +
                    "조선시대 성리학에 대한 설명으로 가장 적절한 것은?",




            "13. " +
                    "다음 보기 중 조선 후기 실학에 대한 설명으로 옳은 것은 \n" +
                    "모두 몇 개인가?" +
                    "\n\n\n㉠ 이익은 관리, 선비, 농민 등 신분에 따라 차등 있게 토지를 재분배하자는 한전론(限田論)을 주장하고, 나라를 좀먹는 여섯 가지의 폐단을 지적하기도 하였다. " +
                    "\n\n㉡ 정약용은 지방 행정의 개혁에 대하여 쓴 경세유표 등을 비롯하여 500여 권의 저술을 남겼다. " +
                    "\n\n㉢ 유형원은 한 가정의 생활을 유지하는 데 필요한 규모의 토지를 영업전으로 정한 다음, 영업전은 법으로 매매를 금지하고, 나머지 토지만 매매를 허용하자는 균전론(均田論)을 주장하였다. " +
                    "\n\n㉣ 박지원은 청에 다녀와 열하일기를 저술하여 생산과 소비와의 관계를 우물물에 비유하면서 생산을 자극하기 위해서는 절약보다 소비를 권장해야 한다고 주장하였다. " +
                    "\n\n㉤ 유수원은 우서를 저술하여 상공업의 진흥과 기술의 혁신을 강조하고, 사농공상의 직업 평등과 전문화를 주장하였다. " +
                    "\n\n㉥ 이수광은 지봉유설을 저술하여 문화 인식의 폭을 확대하였고, 한백겸은 동국지리지를 저술하여 우리나라의 역사 지리를 치밀하게 고증하였다. ",




            "14. " +
                    "조선 후기에는 민족의 전통과 현실에 대한 관심이 깊어지면서 우리의 역사, 지리, 국어 등을 연구하는 국학이 발달하였다. " +
                    "이에 대한 설명으로 가장 적절한 것은?",


            "15." +
                    "다음 민요와 관련된 역사적 사실로 가장 적절한 것은?" +
                    "새야 새야 녹두새야 \n" +
                    "웃녘 새야 아랫녘 새야\n" +
                    "전주 고부 녹두새야\n" +
                    "함박 쪽박 열나무 딱딱 후여\n" +
                    "새야 새야 팔왕(八王)새야\n" +
                    "네 무엇하러 나왔느냐\n" +
                    "솔잎 댓잎이 푸릇푸릇\n" +
                    "하절인가 하였더니\n" +
                    "새야 새야 녹두새야 백설이 펄펄 흩날리니\n" +
                    "녹두밭에 앉지마라 저 강 건너 청송 녹죽이 날 속인다\n" +
                    "녹두꽃이 떨어지면\n" +
                    "청포장수 울고 간다",





            "16. " +
                    "신민회에 대한 설명으로 가장 적절하지 않은 것은?",



            "17. " +
                    "국학 운동에 대한 설명으로 가장 적절한 것은?",





            "18. " +
                    "다음 보기를 시대 순으로 가장 적절하게 나열한 것은?" +
                    "\n\n\n㉠ 일본군이 간도 참변을 일으켜 우리 동포를 학살하였다. " +
                    "\n\n㉡ 한 ․ 일 학생 간의 충돌 사건을 계기로 광주 학생 항일 운동이일어났다. " +
                    "\n\n㉢ 대한민국 임시 정부는 국내외의 독립 운동 상황을 점검하고 새로운 활로를 모색하기 위하여 상하이에서 국민 대표 회의를 열었다. " +
                    "\n\n㉣ 일제와 만주 군벌 사이에 독립군의 탄압, 체포, 구속, 인도에 관한 이른바 미쓰야 협정이 맺어짐으로써 독립군의 활동은 큰 위협을 받게 되었다",





            "19. " +
                    "다음 보기를 시대 순으로 가장 적절하게 나열한 것은?" +
                    "\n\n\n㉠ 한․미 상호 방위 조약 체결 \n" +
                    "\n㉡ 사사오입 개헌\n" +
                    "\n㉢ 휴전 협정 조인 \n" +
                    "\n㉣ 발췌 개헌\n" +
                    "\n㉤ 향토 예비군 창설",




            "20. " +
                    " 다음 보기는 어느 성명 또는 선언의 내용인가?" +
                    "\n\n\n⦁남과 북은 나라의 통일 문제를 그 주인인 우리 민족끼리 서로 힘을 합쳐 자주적으로 해결해 나가기로 하였다. " +
                    "\n\n⦁남과 북은 경제 협력을 통하여 민족 경제를 균형적으로 발전 시키고 사회, 문화, 체육, 보건, 환경 등 제반 분야의 협력과 교류를 활성화하여 서로의 신뢰를 다져 나가기로 하였다.",


    };





    public  static String mChoices [][] = {


            //1

            {"청동기 제작과 관련된 전문 장인이 출현하였으며, 사유 재산제도와 계급이 나타나게 되었다.",
                    "청동기 문화가 독자적 발전을 이룩하면서, 잔무늬 거울은 거친무늬 거울로 그 형태가 변하여 갔다",
                    "고인돌, 돌널무덤, 돌무지무덤 등이 나타나게 되었다",
                    "이 시기의 전형적인 유물로는 미송리식 토기, 민무늬 토기, 붉은간토기 등의 토기가 있다."},



            //2

            {"(가)-농경과 목축을 주로 하였고, 특산물로는 말, 주옥, 모피 등이 유명하였다",
                    "(나)-해마다 씨를 뿌리고 난 뒤인 5월과,가을 곡식을 거두어들이는 10월에 하늘에 제사를 지냈다",
                    "(다)-다른 부족의 생활권을 침범하면 노비와 소,말로 변상하게하였다",
                    "(라)-혼인을 정한 뒤 신부집 뒤꼍에 조그만 집을 짓고,거기서 자식을 낳아 장성하면 아내를 데리고 신랑집으로 돌아가는풍습이 있었다"},


            //3

            {"왕인은 일본에 건너가 천자문과 논어를 전하고 가르쳤다",
                    "혜자는 일본 쇼토쿠 태자의 스승이 되었다",
                    "원효,강수,설총이 발전시킨 불교와 유교 문화는 일본 아스카 문화의 성립에 기여하였다",
                    "노리사치계는 일본에 불경과 불상을 전하였다"},

            //4

            {"통일 신라 때의 문서로, 당시 촌락의 경제 상황과 국가의 세무 행정을 알 수 있는 자료이다",
                    "비옥도와 풍흉의 정도에 따라 토지의 종류와 면적을 기록하였다",
                    "토착 세력인 촌주가 변동 사항을 조사하여 3년마다 작성하였다",
                    "1933년 일본 도다이 사(東大寺) 쇼소인(正倉院)에서 발견되었다"},


            //5

            {"주로 중앙 관청의 우두머리나 지방 장관직을 담당하였다",
                    "신라 말기에 이 출신이었던 일부 당(唐) 유학생은 신라 골품제 사회를 비판하면서 새로운 정치 이념을 제시하였다",
                    "신라 중대에는 왕의 정치적 조언자로 활동하였다",
                    "강수, 설총, 최치원이 이 골품에 해당하는 자들이었다"},



            //6

            {"발해의 주민 중 다수는 고구려계 사람들이며,이들 중의 일부는 지배층이 되었다",
                    "발해는 당의 수도인 장안성을 본떠 상경성을 바둑판 모양으로 반듯하게 구획하였다",
                    "발해 문왕 때에는 당과 친선 관계를 맺은 이후, 교역이 활발하게 이루어졌다",
                    "발해는 통일 신라와 경쟁의식을 가져 국제무대에서 대립하기도 하였으나, 때때로 사신을 파견하여 우의를 다졌다"},


            //7

            {" 고구려 소수림왕은 율령 반포,불교 공인 등을 통해 지방의 부족세력을 효율적으로 통제하였다",
                    "신라 지증왕은 국호를 신라로 바꾸고,왕의 칭호도 마립간에서 왕으로 고쳤다",
                    "백제 무령왕은 대외 진출이 쉬운 사비(부여)로 도읍을 옮기고,지방의 22담로에 왕족을 파견함으로써 지방에 대한 통제를 강화하였다",
                    "백제 성왕은 중앙 관청을 22부로 확대 정비하고,수도를 5부로 지방을 5방으로 정비하였다"},


            //8

            {"12세기 중엽에는 고려의 독창적인 상감법이 개발되어 도자기에 활용되었다",
                    "관촉사의 석조 미륵보살 입상은 부석사 소조 아미타여래 좌상과는 달리,신라 시대 양식을 계승한 것이다",
                    "상감 청자는 강화도에 도읍한 13세기 중엽까지 주류를 이루었으나 원 간섭기 이후에는 제작 기법이 퇴조하였다",
                    "봉정사 극락전은 현존하는 가장 오래된 목조 건축물이다"},

            //9

            {"의천은 대립상태에 있었던 교종과 선종의 통합을 위해 노력하고자,먼저 선종의 여러 종파를 종합하고,해동 천태종을 열어 교종을 융합하고자 하였다",
                    "광종은 과거제를 실시하였으나,승과는 두지 않았다",
                    "지눌과 혜심의 활동은 교종을 후원하고자 하는 무신정권의 지원을 받았다.",
                    "지눌의 뒤를 이은 혜심은 유․불 일치설을 주장하였다"},

            //10

            {"태종 때에는 고구려의 천문도를 바탕으로 천상열차분야지도를 돌에 새겼다",
                    "계미자, 갑인자 등 정교하고 아름다운 활자가 만들어졌고, 세조때에는 식자판을 조립하는 방법을 창안하여 인쇄 속도도 빨라졌다",
                    "토지 측량 기구로 인지의와 규형을 제작하였다",
                    "동국병감, 병장도설을 간행하여 군사 훈련 지침서로 사용 하였다"},

            //11


            {"과거 제도를 시행하고, 광덕 ․ 준풍 등 독자적인 연호를 사용하는 등 왕권이 강화되었다",
                    "직전법을 실시하였다",
                    "경국대전의 편찬을 마무리하고 반포하였다",
                    "이종무가 병사 1만 7천명을 이끌고 쓰시마 섬을 토벌하였다"},


            //12

            {"서경덕은 기(氣)보다는 이(理)를 중심으로 세계를 이해하고 불교와 노장 사상에 대해서 개방적인 태도를 지녔다",
                    "이황은 성학집요를 저술하여 군주 스스로가 성학을 따를 것을 제시하였다",
                    "이이는 주자서절요, 동호문답을 저술하여 16세기 조선 사회의 모순을 극복하는 방안으로 통치 체제의 정비와 수취 제도의 개혁 등 다양한 개혁 방안을 제시하였다",
                    "이언적은 기(氣)보다는 이(理)를 중심으로 자신의 이론을 전개하여 후대에 큰 영향을 끼쳤다"},

            //13

            {"1개",
                    "2개",
                    "3개",
                    "4개"},




            //14

            {"김정호의 대동여지도는 최초로 100리척을 사용하여 산맥, 하천, 포구, 도로망을 정밀하게 표시하였다",
                    "이종휘는 동사 에서 고구려 역사 연구를,유득공은 발해고에서 발해사 연구를 심화하였다",
                    "이긍익은 500여 종의 중국 및 일본의 자료를 참고하여 연려실기술을 편찬하여 민족사 인식의 폭을 넓히는 데 이바지하였다",
                    "안정복은 조선 시대의 정치와 문화를 정리하여 동사강목을 저술하여 우리 역사의 독자적 정통론을 세워 이를 체계화하였다"},


            //15

            {"교세가 확장되면서 대중 집회를 열고, 억울하게 처형된 교조 최시형의 원을 풀고자 하는 교조 신원 운동을 벌였다",
                    "고부 군수 조병갑에 대한 불만과 단발령 실시에 항거하여 1894년전라도 고부에서 시작되었다",
                    "황토현 전투와 장성 황룡촌, 우금치 등에서 관군을 물리치고 북상하여 전주성을 점령하였다.",
                    "폐정 개혁 12조를 실현할 목적으로 전라도 53개 군에 민정기관을 설치하였다"},


            //16

            {"국권 회복과 입헌군주체제의 국민 국가 건설을 목표로 삼은 비밀 조직이었다",
                    "표면적으로는 문화적, 경제적 실력 양성 운동을 전개하면서, 내면적으로는 국외 독립군 기지의 건설에 의한 실력 양성을 기도하였다",
                    "만주와 연해주에 독립군 기지를 건설하였다",
                    "신민회의 국내 조직은 105인 사건으로 인하여 와해되었다"},
            //17

            {"한국 학자들에 의해 순수 학술 연구 단체인 청구 학회가 조직되어 일제 식민 사학에 대항하며 한국사의 실증적 연구에 힘썼다",
                    "박은식은 한국 통사, 한국 독립 운동지혈사, 05000년간 조선의 얼을 저술하여 일제에 의한 한국 고대사의 타율성과 정체성을 반박하면서 우리 고대사의 독자성을 부각시켰다",
                    "민족주의 성격이 강한 천도교는 중광단과 북로군정서군을 결성하여 항일 무장 투쟁을 벌였다",
                    "한국사가 세계사의 보편적 발전 법칙에 입각하여 발전하였음을 강조하면서 식민주의 사관의 정체성 이론을 반박하는 사회 경제사학이 백남운 등에 의해 1930년대에 대두되었다"},



            //18

            {"㉠ - ㉢ - ㉣ - ㉡",
                    "㉠ - ㉢ - ㉡ - ㉣",
                    "㉢ - ㉠ - ㉡ - ㉣",
                    "㉢ - ㉠ - ㉣ - ㉡"},




            //19

            {"㉢ - ㉣ - ㉠ - ㉤ - ㉡",
                    "㉢ - ㉠ - ㉣ - ㉤ - ㉡",
                    "㉣ - ㉢ - ㉠ - ㉡ - ㉤",
                    "㉣ - ㉠ - ㉢ - ㉡ - ㉤"},
            //20

            {"1972년 7 ․ 4 남북 공동 성명",
                    "1973년 6 ․ 23 평화 통일 외교 정책 선언",
                    "1991년 남북 기본 합의서",
                    "2000년 6 ․ 15 남북 공동 선언"},





    };


    public static String mCorrectAnswers[] =
            //1
            {"청동기 문화가 독자적 발전을 이룩하면서, 잔무늬 거울은 거친무늬 거울로 그 형태가 변하여 갔다",

                    //2

                    "(다)-다른 부족의 생활권을 침범하면 노비와 소,말로 변상하게하였다",

                    //3

                    "원효,강수,설총이 발전시킨 불교와 유교 문화는 일본 아스카 문화의 성립에 기여하였다",

                    //4

                    "비옥도와 풍흉의 정도에 따라 토지의 종류와 면적을 기록하였다",

                    //5
                    "주로 중앙 관청의 우두머리나 지방 장관직을 담당하였다",


                    //6
                    "발해의 주민 중 다수는 고구려계 사람들이며,이들 중의 일부는 지배층이 되었다",

                    //7
                    "백제 무령왕은 대외 진출이 쉬운 사비(부여)로 도읍을 옮기고,지방의 22담로에 왕족을 파견함으로써 지방에 대한 통제를 강화하였다",

                    //8

                    "관촉사의 석조 미륵보살 입상은 부석사 소조 아미타여래 좌상과는 달리,신라 시대 양식을 계승한 것이다",

                    //9

                    "지눌의 뒤를 이은 혜심은 유․불 일치설을 주장하였다",


                    //10

                    "토지 측량 기구로 인지의와 규형을 제작하였다",

                    //11

                    "직전법을 실시하였다",


                    //12
                    "이언적은 기(氣)보다는 이(理)를 중심으로 자신의 이론을 전개하여 후대에 큰 영향을 끼쳤다",

                    //13
                    "2개",

                    //14
                    "이종휘는 동사 에서 고구려 역사 연구를,유득공은 발해고에서 발해사 연구를 심화하였다",


                    //15
                    "폐정 개혁 12조를 실현할 목적으로 전라도 53개 군에 민정기관을 설치하였다",


                    //16
                    "국권 회복과 입헌군주체제의 국민 국가 건설을 목표로 삼은 비밀 조직이었다",

                    //17
                    "한국사가 세계사의 보편적 발전 법칙에 입각하여 발전하였음을 강조하면서 식민주의 사관의 정체성 이론을 반박하는 사회 경제사학이 백남운 등에 의해 1930년대에 대두되었다",

                    //18
                    "㉠ - ㉢ - ㉣ - ㉡",

                    //19
                    "㉣ - ㉢ - ㉠ - ㉡ - ㉤",

                    //20
                    "2000년 6 ․ 15 남북 공동 선언",
            };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


