package com.perfect.admin.police1;


public class QuestionLibrary2014_4 {

    //2018 3월 24일  경찰 경찰학개론


    public   static  String mQuestions [] = {



            "1." +
                    "다음은 형사소송법에 대한 설명이다. 가장 적절한 것은?",


            "2." +
                    "다음 중 판례의 태도와 가장 부합하지 않는 것은?",



            "3." +
                    "다음은 통신제한조치 또는 감청에 대한 설명이다. 가장 적절\n" +
                    "하지 않은 것은? (다툼이 있는 경우 판례에 의함)",


            "4. " +
                    "다음은 접견교통권에 대한 설명이다. 가장 적절한 것은?\n" +
                    "(다툼이 있는 경우 판례에 의함)",





            "5. " +
                    " 다음 중 엄격한 증명의 대상은 모두 몇 개인가?\n" +
                    " (다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠ 공모공동정범의 공모\n" +
                    "\n㉡ 외국법규의 존재\n" +
                    "\n㉢ 진술의 임의성\n" +
                    "\n㉣ 몰수, 추징의 대상이 되는지 여부나 추징액의 인정\n" +
                    "\n㉤ 증거의 증명력을 탄핵하는 보조사실\n" +
                    "\n㉥ 친고죄에 있어서 고소의 유무\n" +
                    "\n㉦ 뇌물죄에서의 수뢰액\n" +
                    "\n㉧ 피고인 자필 작성 진술서의 특신상태",





            "6. " +
                    " 다음은 증거조사의 이의신청에 대한 설명이다. 가장 적절한 것은?",



            "7. " +
                    " 다음은 공소사실의 특정에 대한 설명이다. 가장 적절한 것은?\n" +
                    "(다툼이 있는 경우 판례에 의함)" ,





            "8. " +
                    "다음은 공소장변경이 없는 경우 공소사실과 다른 죄를 인정할 \n" +
                    "수 있는지 여부에 관한 판례이다. 판례의 태도와 부합하지\n" +
                    "않은 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 관세포탈 미수의 공소사실을 관세포탈 예비로 심판할 수 없다. " +
                    "\n\n㉡ 히로뽕투약죄 기수의 공소사실을 히로뽕투약죄 미수로 인정 \n" +
                    "할 수 있다. " +
                    "\n\n㉢ 특수강도의 공소사실을 특수공갈죄로 처단할 수 없다. " +
                    "\n\n㉣ 장물보관죄의 공소사실을 업무상과실장물보관죄로 의율 \n" +
                    "할 수 없다. " +
                    "\n\n㉤ 살인죄의 공소사실을 폭행치사죄로 처단할 수 없다. " +
                    "\n\n㉥ 실체적 경합범의 공소사실을 포괄일죄로 처벌할 수 있다. " +
                    "\n\n㉦ 업무상과실치사죄의 공소사실을 단순과실치사죄로 인정 \n" +
                    "할 수 없다. " +
                    "\n\n㉧ 사실적시에의한명예훼손죄의 공소사실을 허위사실적시에\n" +
                    "의한명예훼손죄로 처벌할 수 없다.",




            "9. " +
                    "다음은 변호인에 대한 설명이다. 가장 적절한 것은?",



            "10. " +
                    " 다음은 수사상 증거보전과 증인신문에 대한 설명이다. 가장\n" +
                    "적절한 것은?",





            "11." +
                    "다음은 증인에 대한 설명이다. 가장 적절하지 않은 것은?\n" +
                    "(다툼이 있는 경우 판례에 의함)",




            "12." +
                    " 다음은 구속에 대한 판례이다. 적절하지 않은 것은 모두 \n" +
                    "몇 개인가?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠ 구속영장 발부에 의하여 적법하게 구금된 피의자가 피의자 \n" +
                    "신문을 위한 출석요구에 응하지 아니하면서 수사기관 \n" +
                    "조사실에 출석을 거부할 경우에는 수사기관은 구속영장의 효력에 의하여 피의자를 조사실로 구인할 수 있다. " +
                    "\n\n㉡ 법원이 피고인에 대하여 구속영장을 발부함에 있어 사전에 형사소송법 제72조의 규정에 따른 절차를 거치지 아니한 채 구속영장을 발부하였다면 그 구속영장 발부결정은 위법 \n" +
                    "하고, 피고인이 변호인을 선정하여 공판절차에서 변명과 \n" +
                    "증거의 제출을 다하고 그의 변호아래 판결을 선고받더라도 달라지지 아니한다. " +
                    "\n\n㉢ 검사의 구속기간 연장 신청에 대하여 이를 허가하지 아니 하는 지방법원 판사의 결정에 대하여는 형사소송법 제402조, 제403조에 의한 항고의 방법으로는 불복할 수 없으나, 동법 제416조에 정하는 준항고를 통해 불복할 수 있다. ㉣ 구속기간이 만료될 무렵 종전 구속영장에 기재된 범죄사실과 다른 범죄사실로 피고인을 구속한 경우에는 위법한 구속에 해당한다. ㉤ 형사소송법 제88조는 “피고인을 구속한 때에는 즉시 공소 사실의 요지와 변호인을 선임할 수 있음을 알려야 한다.”고 규정하고 있는바, 이를 위반하였다면 구속영장의 효력이 \n" +
                    "상실된다.",




            "13. " +
                    " 다음은 압수․수색에 대한 설명이다. 가장 적절하지 않은 것은?\n" +
                    "(다툼이 있는 경우 판례에 의함",




            "14. " +
                    " 다음은 녹음과 관련된 설명이다. 가장 적절하지 않은 것은?\n" +
                    "(다툼이 있는 경우 판례에 의함)",


            "15." +
                    "다음은 전문수사자문위원에 대한 설명이다. 적절하지 않은 것은\n" +
                    "모두 몇 개인가?" +
                    "\n\n\n㉠ 검사는 공소제기 여부와 관련된 사실관계를 분명하게 하기 위하여 필요한 경우에는 직권이나 피의자 또는 변호인의 \n" +
                    "신청에 의하여 전문수사자문위원을 지정하여 수사절차에 \n" +
                    "참여하게 하고 자문을 들을 수 있다. " +
                    "\n\n㉡ 전문수사자문위원은 전문적인 지식에 의한 설명 또는 의견을 \n" +
                    "기재한 서면을 제출하거나 전문적인 지식에 의하여 설명이나 의견을 진술할 수 있다. 이에 대해서 검사는 피의자 또는 \n" +
                    "변호인에게 구술 또는 서면에 의한 의견진술의 기회를 줄 수 있다." +
                    "\n\n㉢ 검사는 상당하다고 인정하는 때에는 전문수사자문위원의 \n" +
                    "지정을 취소할 수 있다. " +
                    "\n\n㉣ 피의자 또는 변호인은 검사의 전문수사자문위원 지정에 \n" +
                    "대하여 관할 지방검찰청검사장에게 이의를 제기할 수 있다",



            "16. " +
                    " 다음은 체포·구속적부심사제도에 대한 설명이다. 적절하지 \n" +
                    "않은 것은 모두 몇 개인가? (다툼이 있는 경우 판례에 의함" +
                    "\n\n\n㉠ 구속적부심문조서는 법원 또는 법관 면전에서 작성된 \n" +
                    "조서로서 형사소송법 제311조에 의하여 당연히 그 증거 \n" +
                    "능력이 인정된다. " +
                    "\n\n㉡ 법원이 수사관계서류와 증거물을 접수한 때부터 결정 후 검찰청에 반환된 때까지의 기간은 수사기관의 체포·구속 \n" +
                    "기간에 산입하지 아니한다. " +
                    "\n\n㉢ 법원은 체포 및 구속적부심사청구가 있는 경우 피의자의 \n" +
                    "출석을 보증할만한 보증금의 납입을 조건으로 석방을 \n" +
                    "명할 수 있다. " +
                    "\n\n㉣ 법원은 체포 또는 구속된 피의자에 대한 심문이 종료된 \n" +
                    "때로부터 24시간 이내에 체포·구속적부심사청구에 대한 결정을 하여야 한다. ㉤ 체포·구속적부심사청구에 대한 법원의 결정에는 항고 \n" +
                    "할 수 있다. " +
                    "\n\n㉥ 체포 또는 구속적부심사결정에 의하여 석방된 피의자가 \n" +
                    "도망하거나 죄증을 인멸하는 경우를 제외하고는 동일한 \n" +
                    "범죄사실에 관하여 재차 체포 또는 구속하지 못한다.",



            "17. " +
                    "다음은 공판절차에서 피해자 진술권에 대한 설명이다. 적절하지\n" +
                    "않은 것은 모두 몇 개인가? (다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠ 법원은 범죄로 인한 피해자 등의 신청이 있는 경우에는 원칙적으로 그 피해자 등을 증인으로 신문하여야 하고 \n" +
                    "피해의 정도 및 결과, 피고인의 처벌에 관한 의견, 그 밖에 당해 사건에 관한 의견을 진술할 기회를 주어야 한다. " +
                    "\n\n㉡ 교통사고로 사망한 사람의 부모는「교통사고처리특례법」의 보호법익인 생명의 주체가 아니므로 헌법상 재판절차 \n" +
                    "진술권이 보장되는 형사피해자의 범주에 속하지 아니한다. " +
                    "\n\n㉢ 법원은 동일한 범죄사실에 대하여 피해자 진술신청을 \n" +
                    "한 자가 수인인 경우에는 신청한 모든 피해자를 증인으로\n" +
                    "신문하여야 한다. " +
                    "\n\n㉣ 법원은 당해 피해자·법정대리인 또는 검사의 신청에 따라 피해자의 사생활의 비밀이나 신변보호를 위해 필요하다고 인정하는 때에는 결정으로 심리를 공개하지 않을 수 있다. ㉤ 신청인이 출석통지를 받고도 정당한 이유 없이 출석하지 \n" +
                    "아니한 때에는 그 신청을 철회한 것으로 본다.",





            "18. " +
                    " 다음은 증거에 대한 설명이다. 가장 적절하지 않은 것은?\n" +
                    " (다툼이 있는 경우 판례에 의함",





            "19. " +
                    " 다음은 증거동의에 대한 설명이다. 가장 적절하지 않은 것은?\n" +
                    "(다툼이 있는 경우 판례에 의함",




            "20. " +
                    " 다음은 자백에 대한 설명이다. 가장 적절하지 않은 것은?\n" +
                    "(다툼이 있는 경우 판례에 의함)",


    };





    public  static String mChoices [][] = {


            //1

            {"형사소송법은 형법과는 달리 소급효금지원칙이 적용되지 않으며, 신법을 적용할 것인가 구법을 적용할 것인가는 입법정책의 문제이다",
                    "수사이전 단계를 내사라 하는데, 형사소송법은 피의자의 권리를 피내사자에게도 준용하는 명문의 규정을 두고 있다.",
                    "현행 형사소송법은 직권주의 형태를 강하게 나타내며 공판정에서 피고인 좌석의 위치도 변호인과 분리되어 법관과 직접 대면토록 대응하게 위치시키고 있다.",
                    "형사소송법은 공소제기로 인하여 공판절차가 시작되고, 피내사자의 지위가 피의자의 지위로 바뀜을 규정하고 있다."},



            //2

            {"경찰관이 취객을 상대로 한 이른바 부축빼기 절도범을 단속하기 위하여 공원 인도에 쓰러져 있는 취객 근처에서 감시하고 있다가 마침 피고인이 나타나 취객을 부축하여 10m 정도를 끌고 가 지갑을 뒤지자 현장에서 체포한 것은 위법한 함정수사가 아니다.",
                    "유인자가 수사기관과 직접적인 관련을 맺지 아니한 상태에서 피유인자를 상대로 단순히 수차례 반복적으로 범행을 부탁하였을 뿐, 수사기관이 사술이나 계략 등을 사용하였다고 볼 수 없는 경우는 설령 그로 인하여 피유인자의 범의가 유발되었다 하더라도 위법한 함정수사에 해당하지 아니한다",
                    "위법한 함정수사에 기하여 공소를 제기한 경우 그 수사에 기하여 수집한 증거는 증거능력이 없다고 보아야 하므로 법원은 무죄판결을 하여야 한다",
                    "피고인의 뇌물수수가 공여자들의 함정교사에 의한 것이기는 하나, 뇌물공여자들에게 뇌물공여의 의사가 전혀 없었다고 보기 어렵다면, 뇌물공여자들의 함정교사라는 사정은 피고인의 책임을 면하게 하는 사유가 될 수 없다."},


            //3

            {"전화통화 당사자의 일방이 상대방 모르게 통화내용을 녹음하는 것은 감청에 해당하지 않지만, 제3자가 전화통화 당사자 일방만의 동의를 받고 그 통화내용을 녹음한 경우에는「통신비밀보호법」위반에 해당한다",
                    "무전기와 같은 무선전화기를 이용한 통화는「통신비밀보호법」소정의 ‘타인간의 대화’에 포함되지 않는다.",
                    "「통신비밀보호법」상 ‘감청’이란 대상이 되는 전기통신의 송수신과 동시에 이루어지는 경우뿐만 아니라, 이미 수신이 완료된 전기통신의 내용을 지득하는 행위도 포함된다",
                    "인터넷통신망을 통하여 흐르는 전기신호 형태의 패킷(packet)을 중간에 확보하여 그 내용을 지득하는 이른바 ‘패킷감청’도 「통신비밀보호법」에서 정한 요건을 갖추는 경우에는 다른 특별한 사정이 없는 한 허용된다."},

            //4

            {"변호인과의 자유로운 접견은 어떠한 명분으로도 제한 될 수 있는 성질의 것이 아니므로, 미결수용자의 변호인 접견권 자체는 국가안전보장, 질서유지 또는 공공복리를 위해 필요한 경우라도 법률로써 제한될 수 없다.",
                    "변호인의 접견에는 비밀이 보장되어야 하므로 교도관 등이 참여하거나 그 내용을 청취 또는 녹취해서는 아니 되고 보이는 거리에서 관찰하는 것도 불가능하다.",
                    "수사기관이 변호인의 접견교통권을 제한하는 경우 그 불복은 항고에 의해서 할 수 있다.",
                    "변호인과의 접견교통권은 수사기관의 처분이나 법원의 결정으로 제한할 수 없다."},


            //5

            {"2개",
                    "3개",
                    "4개",
                    "5개"},



            //6

            {"시기에 늦은 이의신청, 소송지연만을 목적으로 하는 것임이 명백한 이의신청은 결정으로 이를 기각하여야 한다. 따라서 중요한 사항을 대상으로 하고 있는 경우라 할지라도 시기에 늦은 경우에는 기각결정을 하여야 한다",
                    "증거조사를 마친 증거가 증거능력이 없음을 이유로 한 이의신청을 이유 있다고 인정할 경우에는 그 증거의 증거조사를 다시 하여야 한다는 취지의 결정을 하여야 한다",
                    "증거조사에 대한 이의신청은 법령의 위반이 있을 경우에만 할 수 있다.",
                    "이의신청에 대한 결정에 의하여 판단이 된 사항에 대하여는 다시 이의신청을 할 수 없다."},


            //7

            {"공소사실의 일부가 다소 불명확하게 적시되어 있다면 함께 적시된 다른 사항들에 의하여 공소사실을 특정할 수 있는 경우에도 그 공소제기는 효력이 없다.",
                    "간통죄에 있어서는 개개의 간통사실에 대하여 그 일시를 명시하여 구체적으로 기재할 필요는 없고 일정한 기간 동안 수회 간통하였다는 기재만으로 족하다",
                    "공모공동정범에 있어 실행정범의 인적사항이 적시되지 아니하고 범행일시나 장소가 명백히 표시되지 아니하였으나 그 공모관계, 실행정범의 실행행위가 모두 표시되어 있는 경우라면 공소사실이 특정된 것으로 볼 수 있다",
                    "교사범과 방조범의 공소사실에는 교사 또는 방조사실만을 기재하면 족하며, 정범의 범죄구성요건을 충족하는 구체적 사실까지 기재할 필요는 없다."},


            //8

            {"0개",
                    "1개",
                    "2개",
                    "3개"},

            //9

            {"변호인이 있는 피고인이나 그 변호인은 공소제기 후 검사가 보관하고 있는 서류 등의 열람 및 등사 또는 서면의 교부를 신청할 수 있다.",
                    "변호인은 피고인의 명시적 의사에 반하여서 공판기일의 변경신청을 할 수 있다.",
                    "피고인의 법정대리인, 배우자, 직계친족, 형제자매, 동거인 또는 고용주는 독립하여 변호인을 선임할 수 있다.",
                    "피의자에 의해 선임된 변호인은 수사기관에 의한 피의자 신문 도중이라도 부당한 신문 방법에 대하여 이의를 제기할 수 있고, 자유롭게 개입하여 자신의 의견을 진술할 수 있다."},

            //10

            {"검사는 증인신문 청구권을 가지나, 증거보전 청구권은 가지고 있지 않다",
                    "증거보전은 물론 증인신문의 청구를 받은 판사도 그 처분에 관하여 법원 또는 재판장과 동일한 권한이 있다",
                    "범죄의 수사에 없어서는 아니 될 사실을 안다고 명백히 인정되는 자가 검사의 출석요구를 거부한 경우에는 검사는 공소제기 전에 한하여 판사에게 그에 대한 증인신문을 청구할 수 있다.",
                    "증거보전 청구와 증인신문 청구에 대한 기각결정은 모두 항고로서 불복이 가능하다."},

            //11


            {"특별한 지식에 의하여 알게 된 과거의 사실을 진술하는 자를 감정증인이라고 하며, 그에 대해서는 감정이 아닌 증인에 관한 규정에 따라 신문한다.",
                    "형사소송법 제297조의 규정에 따라 재판장은 증인이 피고인의 면전에서 충분한 진술을 할 수 없다고 인정한 때에는 피고인을 퇴정하게 하고 증인신문을 진행함으로써 피고인의 직접적인 증인 대면을 제한할 수 있고, 반대신문권도 배제할 수 있다.",
                    "사고당시 10세 남짓한 초등학교 5학년생으로서 비록 선서 무능력자라 하여도 그 증언 내지 진술의 전후사정으로 보아 의사판단능력이 있다고 인정된다면 증언능력이 있다고 할 것이다",
                    "피고인과는 별개의 범죄사실로 기소되고 다만 병합심리된 것뿐인 공동피고인이 증인선서를 하였다면 그가 한 공판정 에서의 진술을 피고인에 대한 공소범죄 사실을 인정하는 증거로 사용할 수 있다."},


            //12

            {"2개",
                    "3개",
                    "4개",
                    "5개"},

            //13

            {"수사기관이 압수·수색에 착수하면서 그 장소의 관리책임자에게 영장을 제시하였다고 하더라도, 물건을 소지하고 있는 다른 사람으로부터 이를 압수하고자 하는 때에는 그 사람에게 따로 영장을 제시하여야 한다.",
                    "음란물 유포의 범죄혐의를 이유로 압수·수색영장을 발부받은 사법경찰관(리)이 피고인의 주거지를 수색하는 과정에서 대마를 발견하자, 피고인을「마약류관리에 관한 법률」위반죄의 현행범으로 체포하면서 대마를 압수하였으나 그 다음날 피고인을 석방하고도 사후 압수·수색영장을 발부받지 않은 경우 위 압수물과 압수조서는 증거능력이 부정된다.",
                    "압수·수색영장에서 압수할 물건을 ‘압수장소에 보관중인 물건’ 이라고 기재하고 있는 것을 ‘압수장소에 현존하는 물건’으로 해석할 수는 없다.",
                    "압수·수색영장의 집행에 참여한 검사가 집행과정에서 폭행피해를 당한 후 그 사건의 수사에 관여하는 것은 위법하다"},




            //14

            {"수사기관 아닌 사인(私人)이 피고인 아닌 사람과의 대화내용을 녹음한 녹음테이프는 피고인의 증거동의가 없는 이상 그 증거능력을 부여하기 위해서는, 첫째 녹음테이프가 원본이거나 인위적 개작 없이 원본 내용 그대로 복사된 사본일 것, 둘째 형사소송법 제313조 제1항에 따라 공판준비나 공판기일에서 원진술자의 진술에 의하여 녹음테이프에 녹음된 각자의 진술내용이 자신이 진술한대로 녹음된 것이라는 점이 인정되어야 한다.",
                    "디지털 녹음기로 녹음한 내용이 콤팩트디스크에 다시 복사되어 그 콤팩트디스크에 녹음된 내용을 담은 녹취록이 증거로 제출된 사안에서, 위 콤팩트디스크가 현장에서 녹음하는 데 사용된 디지털 녹음기의 녹음내용 원본을 그대로 복사한 것이라는 입증이 없는 이상, 그 콤팩트디스크의 내용이나 이를 녹취한 녹취록의 기재는 증거능력이 없다.",
                    "피고인과의 대화내용을 녹음한 보이스펜 자체에 대하여는 증거동의가 있었지만 그 녹음내용을 재녹음한 녹음테이프, 녹음테이프의 음질을 개선한 후 재녹음한 시디 및 녹음테이프의 녹음내용을 풀어 쓴 녹취록 등에 대하여는 증거로 함에 부동의 하였다면, 극히 일부의 청취가 불가능한 부분을 제외하고는 보이스펜, 녹음테이프 등에 녹음된 대화내용과 녹취록의 기재가 일치하는 것으로 확인되고 그 진술이 특히 신빙할 수 있는 상태 하에서 행하여진 것으로 인정되더라도 이를 증거로 사용할 수 없다",
                    "디지털 녹음기로 피고인과의 대화를 녹음한 후 저장된 녹음파일 원본을 컴퓨터에 복사하고 디지털 녹음기의 파일원본을 삭제한 뒤 다음 대화를 다시 녹음하는 과정을 반복하여 작성한 녹음파일 사본과 해당 녹취록의 경우 복사 과정에서 편집되는 등의 인위적 개작 없이 원본 내용 그대로 복사된 것으로 대화자들이 진술한 대로 녹음된 것이 인정되고, 제반 상황에 비추어 그 진술이 특히 신빙할 수 있는 상태하에서 행하여진 것으로 인정된다면 그 녹음파일 사본과 녹취록의 증거능력은 인정된다."},


            //15

            {"1개",
                    "2개",
                    "3개",
                    "4개"},


            //16

            {"3개",
                    "4개",
                    "5개",
                    "6개"},
            //17

            {"0개",
                    "1개",
                    "2개",
                    "3개"},



            //18

            {"증거동의의 철회는 증거조사 완료 전까지 허용될 수 있다.",
                    "정보통신망을 통하여 공포심이나 불안감을 유발하는 글을 반복적으로 상대방에게 도달하게 하는 행위를 하였다는 공소사실에 대하여 휴대전화기에 저장된 문자정보가 그 증거가 되는 경우, 그 문자정보는 형사소송법 제310조의2에서 정한 전문법칙이 적용되지 않는다.",
                    "어떤 진술이 기재된 서류가 그 내용의 진실성이 범죄사실에대한 직접증거로 사용될 때 전문증거가 되는 경우, 그와 같은 진술을 하였다는 것 자체 또는 그 진술의 진실성과 관계없는 간접사실에 대한 정황증거로 사용될 때는 반드시 전문증거가 되는 것은 아니다. ",
                    "재전문진술이나 재전문진술을 기재한 조서에 대하여 형사소송법이 그 증거능력을 인정하는 규정을 두고 있지 않기 때문에 피고인이 증거로 함에 동의하더라도 증거로 할 수 없다"},




            //19

            {"피의자를 긴급체포할 때 압수한 물건에 관하여 형사소송법관련 규정에 의한 압수·수색영장을 발부받지 않고도 즉시 반환하지 않은 경우, 그 후 피고인이나 변호인이 이를 증거로 함에동의하였더라도 증거능력이 인정되지 않는다.",
                    "필요적 변호사건에서 피고인이 무단퇴정하고, 변호인도 이에 동조하여 퇴정한 경우에는 법원으로서는 피고인이나 변호인의 재정 없이도 심리할 수 있고, 피고인과 변호인의 불출석하에 증거조사를 할 경우 증거동의가 간주된다.",
                    "약식명령에 불복하여 정식재판을 청구한 피고인이 정식재판 절차의 제1심에서 2회 불출정하여 증거동의가 간주된 후 증거조사가 완료되었다면, 항소심에 출석하여 간주된 증거동의를 철회 또는 취소한다는 의사표시를 하더라도 그로 인하여 적법하게 부여된 증거능력이 상실되는 것이 아니다.",
                    "공판기일에서 피고인이 출석하여 증거로 함에 부동의한다는 의견을 진술하였으나, 그 후 피고인이 출석하지 아니한 공판기일에 변호인만이 출석하여 종전 의견을 번복하고 증거로 함에 동의하였다면 증거동의의 효력이 인정된다."},
            //20

            {"형사소송법 제310조의 피고인의 자백에는 공범인 공동피고인의진술은 포함되지 않는다.",
                    "피고인의 자백을 내용으로 하는 피고인 아닌 자의 진술은자백보강의 증거가 될 수 없다.",
                    "변호인 아닌 자와의 접견이 제한된 상태에서 피의자신문조서가 작성되었다는 것만으로는 자백에 임의성이 없는 것으로 볼 수 없다.",
                    "피고인의 자백이 기망에 의하여 임의성이 없다고 의심할 만한 사유가 있다면 그 사유와 자백 사이에 인과관계가 없는 것이 명백한 경우라고 하더라도 그 자백의 임의성은 인정되지 아니한다."},





    };


    public static String mCorrectAnswers[] =
            //1
            {"형사소송법은 형법과는 달리 소급효금지원칙이 적용되지 않으며, 신법을 적용할 것인가 구법을 적용할 것인가는 입법정책의 문제이다",

                    //2

                    "위법한 함정수사에 기하여 공소를 제기한 경우 그 수사에 기하여 수집한 증거는 증거능력이 없다고 보아야 하므로 법원은 무죄판결을 하여야 한다",

                    //3

                    "「통신비밀보호법」상 ‘감청’이란 대상이 되는 전기통신의 송수신과 동시에 이루어지는 경우뿐만 아니라, 이미 수신이 완료된 전기통신의 내용을 지득하는 행위도 포함된다",

                    //4

                    "변호인과의 접견교통권은 수사기관의 처분이나 법원의 결정으로 제한할 수 없다.",

                    //5
                    "3개",


                    //6
                    "이의신청에 대한 결정에 의하여 판단이 된 사항에 대하여는 다시 이의신청을 할 수 없다.",

                    //7
                    "공모공동정범에 있어 실행정범의 인적사항이 적시되지 아니하고 범행일시나 장소가 명백히 표시되지 아니하였으나 그 공모관계, 실행정범의 실행행위가 모두 표시되어 있는 경우라면 공소사실이 특정된 것으로 볼 수 있다",

                    //8

                    "0개",

                    //9

                    "변호인은 피고인의 명시적 의사에 반하여서 공판기일의 변경신청을 할 수 있다.",


                    //10

                    "증거보전은 물론 증인신문의 청구를 받은 판사도 그 처분에 관하여 법원 또는 재판장과 동일한 권한이 있다",

                    //11

                    "형사소송법 제297조의 규정에 따라 재판장은 증인이 피고인의 면전에서 충분한 진술을 할 수 없다고 인정한 때에는 피고인을 퇴정하게 하고 증인신문을 진행함으로써 피고인의 직접적인 증인 대면을 제한할 수 있고, 반대신문권도 배제할 수 있다.",


                    //12
                    "4개",

                    //13
                    "압수·수색영장의 집행에 참여한 검사가 집행과정에서 폭행피해를 당한 후 그 사건의 수사에 관여하는 것은 위법하다",

                    //14
                    "피고인과의 대화내용을 녹음한 보이스펜 자체에 대하여는 증거동의가 있었지만 그 녹음내용을 재녹음한 녹음테이프, 녹음테이프의 음질을 개선한 후 재녹음한 시디 및 녹음테이프의 녹음내용을 풀어 쓴 녹취록 등에 대하여는 증거로 함에 부동의 하였다면, 극히 일부의 청취가 불가능한 부분을 제외하고는 보이스펜, 녹음테이프 등에 녹음된 대화내용과 녹취록의 기재가 일치하는 것으로 확인되고 그 진술이 특히 신빙할 수 있는 상태 하에서 행하여진 것으로 인정되더라도 이를 증거로 사용할 수 없다",


                    //15
                    "2개",


                    //16
                    "3개",

                    //17
                    "2개",

                    //18
                    "재전문진술이나 재전문진술을 기재한 조서에 대하여 형사소송법이 그 증거능력을 인정하는 규정을 두고 있지 않기 때문에 피고인이 증거로 함에 동의하더라도 증거로 할 수 없다",

                    //19
                    "공판기일에서 피고인이 출석하여 증거로 함에 부동의한다는 의견을 진술하였으나, 그 후 피고인이 출석하지 아니한 공판기일에 변호인만이 출석하여 종전 의견을 번복하고 증거로 함에 동의하였다면 증거동의의 효력이 인정된다.",

                    //20
                    "피고인의 자백이 기망에 의하여 임의성이 없다고 의심할 만한 사유가 있다면 그 사유와 자백 사이에 인과관계가 없는 것이 명백한 경우라고 하더라도 그 자백의 임의성은 인정되지 아니한다.",
            };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


