package com.perfect.admin.police1;


public class QuestionLibrary2014_1 {

    //2018 3월 24일  경찰 경찰학개론


    public   static  String mQuestions [] = {



            "1." +
                    "다음은 우리나라의 대표적인 선원사 시대 유적이다. 해당 유적에서 출토된 유물을 연결한 것 중 가장 적절하지 않은 것은?",


            "2." +
                    "다음 고조선에 대한 설명으로 가장 적절하지 않은 것은?",



            "3." +
                    " 다음의 자료에 제시된 나라에 대한 설명으로 가장 적절하지 않은 것은?" +
                    "\n\n\n이 나라는 구릉과 넓은 못이 많아 동이 지역 가운데 가장 넓고 평탄한 곳이다. 토질은 오곡을 가꾸기에 알맞지만, 과일은 생산되지 않는다. 왕이 죽으면 순장을 하는데 많을 때는 백 명을 헤아린다. 수해나 한재를 입어 곡식이 잘 익지 않으면 그 책임을 왕에게 묻기도 하였다. \n" +
                    " \n\n\n -\uF000삼국지\uF000｢위서 동이전｣-",


            "4. " +
                    " 다음 역사적 사건이 시기순으로 바르게 나열된 것은?" +
                    "\n\n\n㉠ 신라 진흥왕은 북한산을 순행하고 순수비를 세웠다. " +
                    "\n\n㉡ 백제 성왕은 수도를 사비로 옮기고 신라와 연합하였다." +
                    "\n\n㉢ 고구려 장수왕은 죽령 일대부터 남양만을 연결하는 선까지 판도를 넓혔다." +
                    "\n\n㉣ 금관가야가 신라에 병합되었다. " +
                    "\n\n㉤ 대가야가 신라에 병합되었다.",





            "5. " +
                    " 다음 중 신라 왕호와 그 역사적 의미가 바르게 연결된 것을 모두 고른 것은?" +
                    "\n\n\n㉠ 거서간·차차웅 – 정치적 군장과 제사장의 기능 분리\n" +
                    "\n㉡ 이사금 – 연장자의 의미로, 박·석·김 3부족이 연맹하여 교대로 왕을 선출\n" +
                    "\n㉢ 마립간 – 김씨가 왕위 계승권을 독점하면서 왕권 강화 \n" +
                    "\n㉣ 왕 – 지증왕이 처음 사용하였고, 중국식 정치 제도를 받아 들이기 시작",





            "6. " +
                    " 다음 중 발해에 대한 설명으로 틀린 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 발해는 영역을 확대하여 옛 고구려의 영토를 대부분 차지하였지만 그 영역에는 말갈족이 다수 거주하였다." +
                    "\n\n㉡ 발해는 이중 기단에 3층으로 쌓는 석탑 양식이 유행하였으며, 흙으로 구워 만든 이불병좌상이 많이 보인다. " +
                    "\n\n㉢ 발해는 지방을 5경 15부 62주로 나누었으며, 지방 행정의 말단 단위인 촌락에 수령을 파견하여 다스렸다. " +
                    "\n\n㉣ 대조영이 698년 길림성 돈화시 동모산 기슭에서 국호를 ‘진(震)’이라 하고 건국하였으며, 2대 무왕에 이르러 ‘발해’로 개칭하였다.",



            "7. " +
                    " 다음 중 삼국 시대와 통일신라 시대 경제에 대한 설명 중 가장 적절하지 않은 것은?" ,





            "8. " +
                    "다음은 고려 성종이 유교적 정치 질서를 강화하기 위해 시행한 정책들이다. 이 중 틀린 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 지방관을 파견하고 향리 제도를 마련하여 지방 세력을 견제하였다. " +
                    "\n\n㉡ 국자감을 정비하고, 지방에 경학박사와 의학박사를 파견하였다. " +
                    "\n\n㉢ 과거제도를 정비하고 과거 출신자들을 우대하여 유학에 조예가 깊은 인재들의 정치 참여를 유도하였다. " +
                    "\n\n㉣ 3성 6부제를 중심으로 하는 중앙 관제를 마련하였다. " +
                    "\n\n㉤ 최승로가 올린 시무 10조의 건의를 수용하여 통치 체제를 정비하였다.",




            "9. " +
                    "고려 시대의 무신 정권에 대한 설명으로 가장 적절하지 않은 것은?",



            "10. " +
                    "다음의 역사서가 저술된 시대에 만들어진 문화유산은?" +
                    "\n\n\n 동명왕의 사적은 변화와 신이로 여러 사람의 눈을 현혹시킬 일이 아니요, 실로 나라를 세운 신의 자취인 것이다. 이러하니 이 일을 기술하지 않으면 앞으로 후세에 무엇을 볼 수 있으리오.",





            "11." +
                    "다음 밑줄 친 ‘이 기구’에 대한 설명으로 가장 적절하지 않은 것은?" +
                    "\n\n\n 김익희가 상소하여 말하기를, “요즘 이 기구가 큰 일이건 작은 일이건 모두 취급합니다. 의정부는 한갓 겉 이름만 지니고 육조는 할 일을 모두 빼앗기고 말았습니다. 이름은‘변방을 담당하는 것’이라고 하면서 과거에 대한 판정이나 비빈 간택까지도 모두 여기서 합니다.”라고 하였다.",




            "12." +
                    " 다음은 조선 시대 붕당에 대한 설명이다. ㉠-㉣에 대한 내용 중 가장 적절하지 않은 것은?" +
                    "사림이" +
                    "㉠동인과 서인으로 나뉜 후, 동인이 우세한 가운데 정국이 운영되었다. 동인은 " +
                    "㉡온건파인 남인과 급진파인 북인으로 나뉘었다. 그 후 " +
                    "㉢서인과 남인이 격렬하게 대립하였으며, 나중에는 서인에서 갈라져 나온 " +
                    "㉣노론과 소론이 치열하게 경쟁하였다",




            "13. " +
                    "다음은 조선 시대 양난 이후 수취 체제의 변화에 대한 설명이다. 가장 적절하지 않은 것은?",




            "14. " +
                    "조선 후기의 가족 제도와 사회상에 대한 설명으로 가장 적절한 것은?",


            "15." +
                    "다음 역사서에 대한 설명으로 가장 적절한 것은?" +
                    "\n\n\n 일찍이 세조께서, “우리 동방에는 비록 여러 역사서가 있으나 장편으로 되어 귀감으로 삼을 만한 것이 없다.”라고 말씀하시고, 관리들에게 명하여 편찬하게 하셨지만 제대로 이루어지지 못하였습니다. 주상께서 그 뜻을 이어받아 서거정 등에게 편찬을 명하였습니다. (중략) 이 책을 지음에 명분과 인륜을 중시하고 절의를 숭상하여, 난신을 성토하고 간사한 자를 비난하는 것을 더욱 엄격히 하였습니다",



            "16. " +
                    "다음은 조선 시대 의궤에 대한 설명이다. 가장 적절하지 않은것은?",



            "17. " +
                    " 다음 대한제국기의 개혁 내용 중 가장 적절하지 않은 것은?",





            "18. " +
                    " 다음 자료와 관련된 역사적 사건에 대한 설명 중 가장 적절하지 않은 것은?" +
                    "\n\n\n· 탐관오리는 그 죄상을 조사하여 엄징한다. " +
                    "\n\n· 노비 문서는 모두 소각한다. " +
                    "\n\n· 칠반천인(七班賤人)의 대우를 개선하고, 백정이 쓰는 평량갓을 없앤다. " +
                    "\n\n· 관리 채용에는 지벌을 타파하고 인재를 등용한다. " +
                    "\n\n· 토지는 평균 분작한다.",





            "19. " +
                    " 다음 중 일제의 경제침탈에 관한 설명으로 가장 적절하지 않은 것은?",




            "20. " +
                    "다음 (가), (나)는 해방 후 두 정치인의 발언이다. 아래의 <보기> 중 두 정치인이 발언한 시점 사이에 일어난 사건은 모두 몇 개인가?" +
                    "\n\n\n(가) 이제 우리는 무기 휴회한 미소 공동위원회가 재개될 기색도 보이지 않으며, 통일정부를 고대하나 여의케 되지 않으니, 우리는 남방만이라도 임시정부 혹은 위원회 같은 것을 \n" +
                    "조직하여 38이북에서 소련이 철퇴하도록 세계 공론에 호소하 여야 될 것이니 여러분도 결심하여야 할 것이다. " +
                    "\n\n(나) 현시에 있어서 나의 유일한 염원은 3천만 동포와 손을 잡고 통일된 조국의 달성을 위하여 공동 분투하는 것 뿐이다. 이 육신을 조국이 수요(需要)로 한다면 당장에라도 제단에 바치겠다. 나는 통일된 조국을 건설하려다 38도선을 베고 쓰러질지언정 일신에 구차한 안일을 취하여 단독정부를 세우는 데는 협력하지 않겠다." +
                    "\n\n㉠ 포츠담선언 \n" +
                    "\n㉡ 제주 4·3 사건 \n" +
                    "\n㉢ 모스크바 3국 외상회의 \n" +
                    "\n㉣ 유엔총회에서 남북총선거 결정 \n" +
                    "\n㉤ 제2차 미소 공동위원회 결렬 \n" +
                    "\n㉥ 남북지도자회의",


    };





    public  static String mChoices [][] = {


            //1

            {"부여 송국리 유적 – 비파형동검",
                    "양양 오산리 유적 – 뼈 낚시바늘",
                    "여주 흔암리 유적 – 오수전",
                    "부산 동삼동 유적 – 빗살무늬토기"},



            //2

            {"위만은 고조선으로 들어올 때 상투를 틀고 오랑캐의 옷을 입었다",
                    "\uF000동국통감\uF000의 기록에 의하면 단군왕검이 고조선을 건국하였다",
                    "기원전 194년 위만은 우거왕을 몰아내고 스스로 왕이 되었다",
                    "위만조선은 한의 침략에 맞서 1차 접전(패수)에서 대승을 거두기도 했다."},


            //3

            {"이미 1세기 초에 왕호를 사용하였다",
                    "만주 길림시 일대를 중심으로 송화강 유역의 평야 지대에서 성장하였다.",
                    "가(加)들은 저마다 따로 행정 구획인 사출도를 다스렸다.",
                    "3세기 말 읍루족의 침략을 받아 크게 쇠퇴하였고 결국 고구려에 편입되었다."},

            //4

            {"㉢ → ㉡ → ㉠ → ㉣ → ㉤",
                    "㉢ → ㉣ → ㉡ → ㉠ → ㉤",
                    "㉣ → ㉢ → ㉡ → ㉤ → ㉠",
                    "㉢ → ㉣ → ㉡ → ㉤ → ㉠"},


            //5

            {"㉡, ㉢",
                    "㉠, ㉡, ㉣",
                    "㉠, ㉢, ㉣",
                    "㉠, ㉡, ㉢, ㉣"},



            //6

            {"0개",
                    "1개",
                    "2개",
                    "3개"},


            //7

            {"삼국은 전쟁에서 공을 세운 사람에게 일정 지역의 토지와농민을 식읍으로 주었다",
                    "통일신라 민정문서는 남녀 인구 수와 소·말의 수, 토지 면적 등을 조사하여 3년마다 작성되었다",
                    "신라에서는 4-5세기를 지나면서 철제 농기구가 점차 보급 되었다.",
                    "삼국 시대에는 농업 생산력이 발달하여 수도 뿐 아니라 농촌 각지에서도 시장이 번성하였다."},


            //8

            {"1개",
                    "2개",
                    "3개",
                    "4개"},

            //9

            {"무신들은 중방을 중심으로 권력을 행사하면서 주요 관직을 독차지하였다.",
                    "최충헌은 최고 집정부 구실을 하는 교정도감을 설치하였고,도방을 확대하여 군사적 기반을 확립하였다.",
                    "최우는 문무 백관의 인사 행정을 담당하는 서방과 능력 있는 문신을 등용하기 위한 정방을 설치하였다.",
                    "삼별초는 좌별초와 우별초 및 몽골에 포로로 잡혀갔다가 돌아온 병사들로 조직된 신의군으로 구성되었다."},

            //10

            {"부석사 무량수전",
                    "광개토왕릉비",
                    "석촌동 고분군",
                    "법주사 팔상전"},

            //11


            {"명종 때에 을묘왜변을 계기로 처음 만들어진 임시 회의 기구이다.",
                    "세도정치기에도 핵심적인 정치기구로 자리 잡았다",
                    "의정부의 의정과, 공조판서를 제외한 판서 등 주요 관직자가 참여하는 합좌기관이다.",
                    "고종 때에 흥선대원군에 의해 사실상 폐지되었다"},


            //12

            {"㉠ - 척신 정치의 잔재 청산 문제에서 주로 소극적인 부류가 서인, 적극적인 부류가 동인으로 형성되었다.",
                    "㉡ - 정여립 모반 사건 등을 계기로 나뉘어져 처음에는 남인이 정국을 주도하였으나 임진왜란 이후 북인이 집권하였다.",
                    "㉢ - 예송논쟁에서 나타난 예론의 차이는 신권을 강화하려는 서인과 왕권을 강화하려는 남인 사이의 정치적 입장과 연결되었다.",
                    "㉣ - 노론은 실리를 중시하고 북방개척을 주장하는 경향을 보이며, 소론은 대의명분을 중시하고 민생안정을 강조하는 경향을 보였다."},

            //13

            {"영정법에서는 연분 9등법을 따르지 않고 풍흉에 관계없이 전세를 토지 1결당 미곡 4두로 고정시켰다. ",
                    "대동법의 시행으로 공납이 전세화되어 농민은 대체로 토지 1결당 미곡 12두만 납부하면 되었다.",
                    "영정법에 따라 전세의 비율이 이전 보다 다소 낮아져 대다수 농민의 부담이 경감되었다.",
                    "대동법은 부족한 국가 재정을 보완하고 농민의 부담을 경감하기 위한 개혁론으로 제기되었다."},




            //14

            {"남녀를 구분하지 않고 태어난 순서대로 족보에 기재하였다",
                    "동성마을이 많아지고 부계 중심의 족보가 편찬되었다.",
                    "아들이 없으면 양자를 들이는 대신에 딸과 외손자가 제사를 지냈다.",
                    "혼인은 친영제에서 남귀여가혼으로 변화되었고, 재산은 균등하게 상속되었다."},


            //15

            {"고조선부터 고려 말까지 역사를 정리하였다.",
                    "세가, 지, 열전 등으로 구성되었다.",
                    "고대사 연구의 시야를 만주지방까지 확대하여 한반도 중심의 협소한 사관을 극복하는 데 힘썼다.",
                    "중국 및 일본의 자료를 참고하여 민족사 인식의 폭을 넓히는데 이바지하였다."},


            //16

            {"왕의 행적과 국정 전반을 기록한 것으로 천재지변에 관한 기록까지 소상히 담고 있어 자료적 가치가 매우 높다.",
                    "조선 초기부터 제작되었으나, 임진왜란 이전의 것은 현재 남아 전해지는 것이 없다.",
                    "1866년 프랑스군이 강화도를 침략하였다가 40여 일만에 물러가면서 외규장각에 있던 다수의 의궤를 약탈하였다. ",
                    "프랑스국립도서관에 보관되어 있던 외규장각 의궤는 2011년 임대의 형식으로 우리나라에 반환되어 현재 국립중앙박물관에 보관되어 있다."},
            //17

            {"황제권 수호와 절대화에 필요한 대한국 국제 제정",
                    "입헌 군주제와 의회 정치 추진",
                    "다양한 시책을 통한 황실 재정 확충",
                    "양전과 지계 발급 사업 실시"},



            //18

            {"고부 농민봉기는 조병갑의 학정에 항거한 사건이며, 정부는 안핵사 이용태를 파견하여 동학교도를 색출하고 탄압하였다.",
                    "청이 조선 정부의 요청으로 파병하자, 일본은 임오군란 때 맺은 톈진(천진)조약을 구실로 파병하였다",
                    "농민군은 전주화약의 체결로 전라도 일대에 집강소를 설치하여 치안과 행정을 담당하였다.",
                    "남접과 북접의 농민군은 우금치 전투에서 패배하였고, 보은 전투에서 대패한 후 해산하였다."},




            //19

            {"1910년대 시작된 토지조사사업은 토지의 소유권, 토지 가격, 지형 및 용도를 조사한 것으로, 토지에 대한 지주의 권리와 농민의 경작권을 함께 인정하였다.",
                    "1920년대 산미증식계획은 더 많은 쌀을 일본으로 가져가기 위해 추진되었으며, 수리시설의 확대와 품종교체, 화학비료 사용 증가 등을 통해 이루어졌다.",
                    "1930년대 이후 일제는 일본을 발전된 공업지역으로, 만주를 농업과 원료 생산 지대로 만들고, 한반도를 경공업 중심의중간 지대로 만들기 위해 조선공업화 정책을 펼쳤다.",
                    "1940년대 전시동원체제 하에서 세금을 늘리고 저축을 강요하여 마련된 자금은 군수기업에 집중 지원되었다."},
            //20

            {"1개",
                    "2개",
                    "3개",
                    "4개"},





    };


    public static String mCorrectAnswers[] =
            //1
            {"여주 흔암리 유적 – 오수전",

                    //2

                    "기원전 194년 위만은 우거왕을 몰아내고 스스로 왕이 되었다",

                    //3

                    "3세기 말 읍루족의 침략을 받아 크게 쇠퇴하였고 결국 고구려에 편입되었다.",

                    //4

                    "㉢ → ㉣ → ㉡ → ㉠ → ㉤",

                    //5
                    "㉠, ㉡, ㉢, ㉣",


                    //6
                    "3개",

                    //7
                    "삼국 시대에는 농업 생산력이 발달하여 수도 뿐 아니라 농촌 각지에서도 시장이 번성하였다.",

                    //8

                    "2개",

                    //9

                    "최우는 문무 백관의 인사 행정을 담당하는 서방과 능력 있는 문신을 등용하기 위한 정방을 설치하였다.",


                    //10

                    "부석사 무량수전",

                    //11

                    "명종 때에 을묘왜변을 계기로 처음 만들어진 임시 회의 기구이다.",


                    //12
                    "㉣ - 노론은 실리를 중시하고 북방개척을 주장하는 경향을 보이며, 소론은 대의명분을 중시하고 민생안정을 강조하는 경향을 보였다.",

                    //13
                    "영정법에 따라 전세의 비율이 이전 보다 다소 낮아져 대다수 농민의 부담이 경감되었다.",

                    //14
                    "동성마을이 많아지고 부계 중심의 족보가 편찬되었다.",


                    //15
                    "고조선부터 고려 말까지 역사를 정리하였다.",


                    //16
                    "왕의 행적과 국정 전반을 기록한 것으로 천재지변에 관한 기록까지 소상히 담고 있어 자료적 가치가 매우 높다.",

                    //17
                    "입헌 군주제와 의회 정치 추진",

                    //18
                    "청이 조선 정부의 요청으로 파병하자, 일본은 임오군란 때 맺은 톈진(천진)조약을 구실로 파병하였다",

                    //19
                    "1910년대 시작된 토지조사사업은 토지의 소유권, 토지 가격, 지형 및 용도를 조사한 것으로, 토지에 대한 지주의 권리와 농민의 경작권을 함께 인정하였다.",

                    //20
                    "2개",
            };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


