package com.perfect.admin.police1;


public class QuestionLibrary2015_5 {

    //2018 3월 24일  경찰 경찰학개론


    public   static  String mQuestions [] = {



            "1." +
                    "형식적 의미의 경찰과 실질적 의미의 경찰개념에 대한 설명으로 가장 적절하지 않은 것은?",


            "2." +
                    "2.「경찰청 공무원 행동강령」에 대한 설명으로 옳은 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 공무원은 직무관련자 또는 직무관련공무원(4촌 이내 친족 포함)에게 금전을 빌리거나 빌려주어서는 아니 되며 부동산을 무상으로 대여 받아서는 아니 된다." +
                    "\n\n㉡ 공무원은 대가를 받고 ‘외부강의ㆍ회의 등’을 할 때에는 미리 외부강의ㆍ회의 등의 요청자, 요청사유, 장소, 일시 및 대가를 소속기관장에게 신고하고, 사전에 소속 기관장의승인을 획득하여야 한다. " +
                    "\n\n㉢ 공무원은 상급자가 자기 또는 타인의 부당한 이익을 위하여 공정한 직무수행을 현저하게 해치는 지시를 하였을 때에는 그 사유를 그 상급자에게 소명하고 지시에 따르지 아니하거나 행동강령책임관과 상담하여야 한다.",



            "3." +
                    "「경찰공무원 징계령」에 대한 설명으로 틀린 것은 모두 몇 개인가?" +
                    "㉠ 중징계란 파면, 해임, 강등을 말하며, 경징계란 정직, 감봉 및 견책을 말한다. " +
                    "㉡ 경찰공무원 보통징계위원회는 해당 징계위원회가 설치된 경찰기관 소속 경정 이하 경찰공무원에 대한 징계 등 사건을 심의·의결한다." +
                    "㉢ 경찰공무원 중앙징계위원회는 위원장 1명을 포함하여 5명 이상 7명 이하의 위원으로 구성한다." +
                    "㉣ 징계위원회의 의결은 위원장을 포함한 위원 과반수(과반수가 3명 미만인 경우에는 3명 이상)의 출석과 출석위원 2/3의 찬성으로 의결한다. " +
                    "㉤ 소속이 다른 2명 이상의 경찰공무원이 관련된 징계 등 사건으로서 관할 징계위원회가 서로 다른 경우에는 모두를 관할하는 바로 위 상급 경찰기관에 설치된 징계위원회에서 심의ㆍ의결한다.",


            "4. " +
                    "「경찰관직무집행법」상 다음 설명 중 가장 적절하지 않은 것은?",





            "5. " +
                    "「경찰관직무집행법」상 경찰관의 무기사용 시 상대방에게 위해를 주어서는 아니 되는 경우로 가장 적절한 것은?",





            "6. " +
                    "「경찰관직무집행법」상 손실보상에 대한 설명으로 틀린 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 보상을 청구할 수 있는 권리는 손실이 있음을 안 날로부터 1년, 손실이 발생한 날로부터 3년간 행사하지 아니하면 시효의 완성으로 소멸한다. " +
                    "\n\n㉡ 소속 경찰공무원의 직무집행으로 인하여 발생한 손실보상청구 사건을 심의하기 위하여 경찰청, 지방경찰청 및 경찰서에 손실보상심의위원회를 설치한다. " +
                    "\n\n㉢ 보상금은 다른 법률에 특별한 규정이 있는 경우를 제외하고는 현금으로 지급하여야 하고, 일시불로 지급하되 예산부족 등의 사유로 일시금으로 지급할 수 없는 특별한 사정이 있는 경우에는 청구인의 동의를 받아 분할하여 지급할 수 있다. " +
                    "\n\n㉣ 물건의 멸실・훼손으로 인한 손실 외의 재산상 손실에 대해서는 직무집행과 상당한 인과관계가 있는 범위에서 보상한다.",



            "7. " +
                    "경찰공무원의 임용에 대한 설명으로 가장 적절하지 않은 것은?" ,





            "8. " +
                    "「국가재정법」상 경찰예산의 집행에 대한 설명으로 가장 적절하지 않은 것은?",




            "9. " +
                    "「보안업무규정」상 비밀에 대한 설명으로 가장 적절하지 않은 것은?",



            "10. " +
                    " 환경설계를 통한 범죄예방(CPTED)에 대한 설명으로 가장 적절하지 않은 것은?",





            "11." +
                    "「가정폭력범죄의 처벌 등에 관한 특례법」상 가정폭력범죄에 대해 사법경찰관이 취할 수 있는 조치에 대한 설명으로 틀린 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 긴급치료가 필요한 피해자를 의료기관으로 인도하여야 한다. " +
                    "\n\n㉡ 피해자의 동의 없이도 피해자를 가정폭력 관련 상담소 또는 보호시설로 인도할 수 있다. " +
                    "\n\n㉢ 가정폭력범죄가 재발될 우려가 있다고 인정하는 경우에는 사법경찰관의 직권으로 법원에 임시조치를 청구할 수 있다. " +
                    "\n\n㉣ 사법경찰관은 가정폭력범죄를 신속히 수사하여 사건을 검사에게 송치하여야 한다. 이 경우 사법경찰관은 해당 사건을 가정보호 사건으로 처리하는 것이 적절한지에 관한 의견을 제시할 수 있다",




            "12." +
                    "「가정폭력범죄의 처벌 등에 관한 특례법」상 가정폭력범죄에 해당하지 않는 것은?",




            "13. " +
                    "「아동학대범죄의 처벌 등에 관한 특례법」상 응급조치에 대한 설명으로 가장 적절하지 않은 것은?",




            "14. " +
                    " 다중범죄의 정책적 치료법 가운데 특정사안의 불만집단에 대한 정보활동을 강화하여 사전에 불만 및 분쟁요인을 찾아내어 해소시켜 주는 방법으로 가장 적절한 것은?",


            "15." +
                    "「도로교통법」상 음주운전 처벌기준에 대한 설명으로 가장 적절하지 않은 것은?",



            "16. " +
                    "「집회 및 시위에 관한 법률」에 대한 설명으로 가장 적절하지 않은 것은?",



            "17. " +
                    "정보의 분류 중 사용목적에 따른 분류로 가장 적절한 것은?",





            "18. " +
                    " 다음은 보안관찰처분대상자와 기간에 대한 설명이다. ( )안에들어갈 말이 바르게 연결된 것은?" +
                    "\n\n\n 보안관찰처분대상자란 보안관찰해당범죄 또는 이와 경합된 범죄로 ( ㉠ ) 이상의 형의 선고를 받고 그 형기 합계가 ( ㉡ ) 이상인 자로서 형의 전부 또는 일부의 집행을 받은 사실이 있는 자를 말하며, 보안관찰처분의 기간은 ( ㉢ )으로 한다.",





            "19. " +
                    "「북한이탈주민의 보호 및 정착지원에 관한 법률」상 다음 설명 중 가장 적절하지 않은 것은?",




            "20. " +
                    "인터폴에서 발행하는 국제수배서에 대한 설명으로 가장 적절하지 않은 것은?",


    };





    public  static String mChoices [][] = {


            //1

            {"형식적 의미의 경찰이란 실정법상 보통경찰기관에 분배되어 있는 임무를 달성하기 위하여 행하여지는 경찰활동을 의미한다.",
                    "정보경찰활동과 사법경찰활동은 형식적 의미의 경찰개념에 해당한다",
                    "실질적 의미의 경찰은 조직을 중심으로 파악된 개념에 해당한다",
                    "실질적 의미의 경찰개념은 행정조직의 일부로서가 아니라, 작용을중심으로 파악한 개념에 해당한다."},



            //2

            {"0개",
                    "1개",
                    "2개",
                    "3개"},


            //3

            {"0개",
                    "1개",
                    "2개",
                    "3개"},

            //4

            {"경찰관서의 장은 대간첩 작전의 수행이나 소요 사태의 진압을 위하여 필요하다고 인정되는 상당한 이유가 있을 때에는 대간첩 작전지역이나 경찰관서·무기고 등 국가중요시설에 대한 접근 또는 통행을 제한하거나 금지할 수 있다.",
                    "경찰관은 범죄행위가 목전에 행하여지려고 하고 있다고 인정될 때에는 이를 예방하기 위하여 관계인에게 필요한 경고를 하고, 그 행위로 인하여 사람의 생명·신체에 위해를 끼치거나 재산에 중대한 손해를 끼칠 우려가 있는 긴급한 경우에는 그 행위를 제지할 수 있다.",
                    "법률에서 정한 절차에 따라 체포·구속된 사람 또는 신체의 자유를 제한하는 판결이나 처분을 받은 사람을 수용하기 위하여 경찰서와 지방해양경비안전관서에 유치장을 둔다.",
                    "경찰관 직무의 범위에 외국 정부기관 및 국제기구와의 국제협력은 규정되어 있지 않다"},


            //5

            {"자기 또는 타인의 생명・신체에 대한 방호",
                    "무장간첩이 투항명령을 받고도 불응하는 때",
                    "「형법」상 정당방위・긴급피난에 해당하는 때",
                    "무기를 소지한 자가 3회 이상 투기・투항명령에 불응하며 항거하는 때"},



            //6

            {"1개",
                    "2개",
                    "3개",
                    "4개"},


            //7

            {"경찰공무원은 임용장 또는 임용통지서에 기재된 일자에 임용된 것으로 보지만, 사망으로 인한 면직은 사망한 다음 날에 면직된 것으로 본다고 경찰공무원법에 명시되어 있다.",
                    "경찰청장은 경찰공무원의 채용시험 또는 경찰간부후보생 공개 경쟁선발시험에서 부정행위를 한 응시자에 대하여는 해당 시험을 정지 또는 무효로 하고, 그 처분이 있은 날부터 5년간 시험응시 자격을 정지한다.",
                    "경찰청장은 순경에서 5년 이상 근속자를 경장으로, 경장에서 6년 이상 근속자를 경사로, 경사에서 7년 6개월 이상 근속자를 경위로, 경위에서 12년 이상 근속자를 경감으로 각각 근속승진 임용 할 수 있다. ",
                    "경정이하의 경찰공무원을 신규채용할 때에는 1년간 시보(試補)로 임용하고, 그 기간이 만료된 다음 날에 정규 경찰공무원으로 임용한다."},


            //8

            {"경찰청장은 예산이 확정된 후 사업운영계획 및 이에 따른 세입 세출예산·계속비와 국고채무부담행위를 포함한 예산배정요구서를 기획재정부장관에게 제출하여야 한다.",
                    "기획재정부장관은 경찰청장에게 예산을 배정한 때에는 감사원에 통지하여야 한다.",
                    "기획재정부장관은 예산집행의 효율성을 높이기 위하여 매년 예산집행에 관한 지침을 작성하여 경찰청장에게 통보하여야 한다.",
                    "경찰청장은 세출예산이 정한 목적 외에 경비를 사용할 수 있다."},

            //9

            {"비밀이란 그 내용이 누설되는 경우 국가안전보장에 유해로운 결과를 초래할 우려가 있는 국가기밀로서 이 영에 의하여 비밀로 분류된 것을 말한다.",
                    "비밀은 그 중요성과 가치의 정도에 따라 Ⅰ급비밀·Ⅱ급비밀 및 Ⅲ급비밀로 구분한다.",
                    "누설되는 경우 대한민국과 외교관계가 단절되고 전쟁을 유발하며,【경찰학개론】 - 경찰학개론 1 -국가의 방위계획·정보활동 및 국가방위상 필요불가결한 과학과 기술의 개발을 위태롭게 하는 등의 우려가 있는 비밀은 이를 Ⅰ급비밀로 한다.",
                    "누설되는 경우 국가안전보장에 손해를 끼칠 우려가 있는 비밀은 이를 Ⅱ급비밀로 한다."},

            //10

            {"CPTED는 주거 및 도시지역의 물리적 환경설계 또는 재설계를= 통해 범죄기회를 차단하고자 하는 기법이다.",
                    "‘자연적 감시’는 건축물이나 시설물의 설계시 가시권을 최대 확보, 외부 침입에 대한 감시 기능을 확대함으로써 범죄행위의 발견가능성을 증가시키고 범죄기회를 감소시킬 수 있는 원리이다.",
                    "‘영역성의 강화’는 지역사회의 설계시 주민들이 모여서 상호의견을 교환하고 유대감을 증대할 수 있는 공공장소를 설치하고 이용 하도록 함으로써 거리의 눈을 활용한 자연적 감시와 접근통제의 기능을 확대하는 원리이다.",
                    "‘자연적 접근통제’는 일정한 지역에 접근하는 사람들을 정해진 공간으로 유도하거나 외부인의 출입을 통제하도록 설계함으로써 접근에 대한 심리적 부담을 증대시켜 범죄를 예방하는 원리이다"},

            //11


            {"1개",
                    "2개",
                    "3개",
                    "4개"},


            //12

            {"공갈죄",
                    "주거ㆍ신체수색죄 ",
                    "약취ㆍ유인죄",
                    "명예훼손죄"},

            //13

            {"현장에 출동하거나 아동학대범죄 현장을 발견한 사법경찰관리 또는 아동보호전문기관의 직원은 피해아동 보호를 위하여 즉시 응급조치를 하여야 한다.",
                    "사법경찰관리나 아동보호전문기관의 직원은 피해아동을 분리· 인도하여 보호하는 경우 지체 없이 피해아동을 인도받은 보호 시설·의료시설을 관할하는 특별시장·광역시장·특별자치시장·도지사·특별자치도지사 또는 시장·군수·구청장에게 그 사실을 통보하여야 한다.",
                    "응급조치는 48시간을 넘을 수 없다.",
                    "사법경찰관리 또는 아동보호전문기관의 직원이 응급조치를 한 경우에는 즉시 응급조치결과보고서를 작성하여야 하며, 아동 보호전문기관의 직원이 응급조치를 한 경우 아동보호전문기관의 장은 작성된 응급조치결과보고서를 지체 없이 관할 경찰서의 장에게 송부하여야 한다. "},




            //14

            {"선수승화법",
                    "전이법",
                    "지연정화법",
                    "경쟁행위법"},


            //15

            {"최초 위반 시 혈중 알코올농도가 0.2%이상인 경우 1년 이상 3년 이하의 징역이나 500만원 이상 1천만원 이하의 벌금",
                    "음주측정에 응하지 않을 시 1년 이상 3년 이하의 징역이나 500만원 이상 1천만원 이하의 벌금",
                    "2회 위반 시 혈중 알코올농도가 0.1%이상 0.2%미만인 경우 1년 이상 3년 이하의 징역이나 500만원 이상 1천만원 이하의 벌금",
                    "3회 이상 위반 시 1년 이상 3년 이하의 징역이나 500만원 이상 1천만원 이하의 벌금"},


            //16

            {"‘주최자’란 자기 이름으로 자기 책임 아래 집회나 시위를 여는 사람이나 단체를 말한다.",
                    "헌법재판소의 결정에 따라 해산된 정당의 목적을 달성하기 위한 집회 또는 시위는 주최하여서는 아니 된다.",
                    "관할경찰관서장은 집회 또는 시위의 시간과 장소가 중복되는 2개 이상의 신고가 있는 경우 그 목적으로 보아 서로 상반되거나 방해가 된다고 인정되면 뒤에 접수된 집회 또는 시위에 대하여 그 집회 또는 시위의 금지를 통고할 수 있다.",
                    "관할경찰관서장은 신고서의 기재 사항에 미비한 점을 발견하면 접수증을 교부한 때부터 24시간 이내에 주최자에게 12시간을 기한으로 그 기재 사항을 보완할 것을 통고할 수 있다."},
            //17

            {"전략정보,전술정보",
                    "적극정보,소극(보안)정보",
                    "기본정보,현용정보,판단정보",
                    "인간정보,기술정보"},



            //18

            {"㉠ 금고 ㉡ 3년 ㉢ 2년",
                    "㉠ 금고 ㉡ 3년 ㉢ 3년",
                    "㉠ 자격정지 ㉡ 2년 ㉢ 2년",
                    "㉠ 자격정지 ㉡ 2년 ㉢ 3년"},




            //19

            {"대한민국은 보호대상자를 인도주의에 입각하여 특별히 보호한다.",
                    "대한민국은 외국에 체류하고 있는 북한이탈주민의 보호 및 지원 등을 위하여 외교적 노력을 다하여야 한다.",
                    "국가정보원장은 북한이탈주민에 대한 보호 및 지원 등을 위하여 북한이탈주민의 실태를 파악하고, 그 결과를 정책에 반영하여야 한다.",
                    "보호대상자는 대한민국의 자유민주적 법질서에 적응하여 건강하고 문화적인 생활을 할 수 있도록 노력하여야 한다."},

            //20

            {"적색수배서는 국제체포수배서로서 범죄인 인도를 목적으로 발행한다",
                    "녹색수배서는 가출인의 소재 확인 또는 기억상실자 등의 신원을 확인할 목적으로 발행한다.",
                    "흑색수배서는 사망자의 신원을 확인할 수 없거나 사망자가 가명을 사용하였을 경우 정확한 신원을 파악할 목적으로 발행한다.",
                    "오렌지수배서는 폭발물 등에 대한 경고목적으로 발행한다"},





    };


    public static String mCorrectAnswers[] =
            //1
            {"실질적 의미의 경찰은 조직을 중심으로 파악된 개념에 해당한다",

                    //2

                    "0개",

                    //3

                    "3개",

                    //4

                    "경찰관 직무의 범위에 외국 정부기관 및 국제기구와의 국제협력은 규정되어 있지 않다",

                    //5
                    "자기 또는 타인의 생명・신체에 대한 방호",


                    //6
                    "2개",

                    //7
                    "경찰공무원은 임용장 또는 임용통지서에 기재된 일자에 임용된 것으로 보지만, 사망으로 인한 면직은 사망한 다음 날에 면직된 것으로 본다고 경찰공무원법에 명시되어 있다.",

                    //8

                    "경찰청장은 세출예산이 정한 목적 외에 경비를 사용할 수 있다.",

                    //9

                    "누설되는 경우 국가안전보장에 손해를 끼칠 우려가 있는 비밀은 이를 Ⅱ급비밀로 한다.",


                    //10

                    "‘영역성의 강화’는 지역사회의 설계시 주민들이 모여서 상호의견을 교환하고 유대감을 증대할 수 있는 공공장소를 설치하고 이용 하도록 함으로써 거리의 눈을 활용한 자연적 감시와 접근통제의 기능을 확대하는 원리이다.",

                    //11

                    "2개",


                    //12
                    "약취ㆍ유인죄",

                    //13
                    "응급조치는 48시간을 넘을 수 없다.",

                    //14
                    "선수승화법",


                    //15
                    "2회 위반 시 혈중 알코올농도가 0.1%이상 0.2%미만인 경우 1년 이상 3년 이하의 징역이나 500만원 이상 1천만원 이하의 벌금",


                    //16
                    "관할경찰관서장은 신고서의 기재 사항에 미비한 점을 발견하면 접수증을 교부한 때부터 24시간 이내에 주최자에게 12시간을 기한으로 그 기재 사항을 보완할 것을 통고할 수 있다.",

                    //17
                    "적극정보,소극(보안)정보",

                    //18
                    "㉠ 금고 ㉡ 3년 ㉢ 2년",

                    //19
                    "국가정보원장은 북한이탈주민에 대한 보호 및 지원 등을 위하여 북한이탈주민의 실태를 파악하고, 그 결과를 정책에 반영하여야 한다.",

                    //20
                    "녹색수배서는 가출인의 소재 확인 또는 기억상실자 등의 신원을 확인할 목적으로 발행한다.",
            };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


