package com.perfect.admin.police1;


public class QuestionLibrary2014_3 {

    //2018 3월 24일  경찰 경찰학개론


    public   static  String mQuestions [] = {



            "1." +
                    "다음은 죄형법정주의를 설명한 것이다. 옳지 않은 것은 모두 \n" +
                    "몇 개인가?(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 식품위생법 제11조 제2항이 과대광고 등의 범위 및 기타\n" +
                    "필요한 사항을 보건복지부령에 위임하고 있는 것은, 과대광고\n" +
                    "등으로 인한 형사처벌에 관한 내용을 법률이 아닌 시행령에\n" +
                    "규정하고 있다고 판단되므로 위임입법의 한계를 벗어난 \n" +
                    "것으로 죄형법정주의에 반한다. " +
                    "\n\n\n㉡ 군형법 제64조 제1항의 상관면전모욕죄의 구성요건의 해석에\n" +
                    "있어 ‘전화통화’를 면전에서의 대화라고 해석하여 처벌하는\n" +
                    "것은 유추해석에 해당되어 죄형법정주의에 반한다. " +
                    "\n\n\n㉢ 공공기관의 운영에 관한 법률 제53조가 공기업의 임직원으로서\n" +
                    "공무원이 아닌 사람은 형법 제129조의 적용에서는 이를 \n" +
                    "공무원으로 본다고 규정하고 있을 뿐 구체적인 공기업의\n" +
                    "지정에 관하여는 하위규범인 기획재정부 장관의 고시에 \n" +
                    "의하도록 규정한 것은 위임입법의 한계를 일탈한 것으로서\n" +
                    "죄형법정주의에 반한다. " +
                    "\n\n\n㉣ 자신의 뇌물수수 혐의에 대한 결백을 주장하기 위하여 \n" +
                    "제3자로부터 사건 관련자들이 주고받은 이메일 출력물을\n" +
                    "교부받아 징계위원회에 제출한 행위를 ‘정보통신망에 \n" +
                    "의하여 처리·보관 또는 전송되는 타인의 비밀’인 이메일의\n" +
                    "내용을 ‘누설하는 행위’에 해당한다고 보는 것은 죄형법정주의\n" +
                    "원칙에 반하는 확장해석이라고 할 수 없다. ㉤ 청소년의 성보호에 관한 법률 제16조에 규정된 반의사\n" +
                    "불벌죄에서 피해자인 청소년에게 의사능력이 있음에도 그 \n" +
                    "처벌을 희망하지 않는다는 의사표시 또는 처벌희망 의사\n" +
                    "표시의 철회에 명문의 근거 없이 법정대리인의 동의가 필요\n" +
                    "하다고 보는 것은 죄형법정주의 내지 유추해석금지의 원칙에\n" +
                    "위배된다.",


            "2." +
                    "다음 중 옳은 것(O)과 옳지 않은 것(X)을 바르게 연결한 것은?\n" +
                    "(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 카지노의 외국인 출입이 허용된 필리핀에서 카지노에 \n" +
                    "들어가 도박을 한 대한민국 국적자에게는 대한민국 형법이\n" +
                    "적용될 수 없다. " +
                    "\n\n\n㉡ 캐나다 시민권자가 캐나다에서 위조사문서를 행사하였다는\n" +
                    "내용으로 기소된 경우 대한민국 법원은 그에 대해 재판권이 없다. " +
                    "\n\n\n㉢ 중국 국적자가 중국에서 대한민국 국적 주식회사의 인장을\n" +
                    "위조한 경우에는 외국인의 국외범으로 대한민국 법원은 그에 \n" +
                    "대해 재판권이 없다. " +
                    "\n\n\n㉣ 외국인이 대한민국 공무원에게 알선한다는 명목으로 금품을\n" +
                    "수수하는 행위가 대한민국 영역 내에서 이루어진 이상, 비록 금품수수의 명목이 된 알선행위를 하는 장소가 대한민국\n" +
                    "영역 외라 하더라도 대한민국 영역 내에서 죄를 범한 것이라고\n" +
                    "하여야 할 것이므로, 구 변호사법(2000.1.28. 법률 제6207호로\n" +
                    "전문개정되기 전의 것) 제90조 제1호가 적용되어야 한다",



            "3." +
                    "다음 중 인과관계가 인정되는 경우가 아닌 것은?(다툼이 \n" +
                    "있으면 판례에 의함)",


            "4. " +
                    " 다음 중 법률의 착오에 정당한 이유가 있는 것으로 가장 적절한\n" +
                    "것은?(다툼이 있으면 판례에 의함)",





            "5. " +
                    "다음은 예비·음모 및 미수에 대한 설명이다. 가장 적절하지 않은\n" +
                    "것은?(다툼이 있으면 판례에 의함)",





            "6. " +
                    " 다음은 자유에 대한 죄를 설명한 것이다. 옳지 않은 것은\n" +
                    "모두 몇 개인가?(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 협박죄가 성립하기 위해서는 행위자가 해악의 내용을 \n" +
                    "실현할 수 있는 위치에 있어야 하고, 고지한 해악을 실제로\n" +
                    "실현할 의도나 욕구가 필요하다. " +
                    "\n\n\n㉡ “앞으로 수박이 없어지면 네 책임으로 한다”고 말한 것은 해악의\n" +
                    "고지라고 보기 어렵고, 가사 다소간의 해악의 고지에 해당\n" +
                    "한다고 가정하더라도 위법성이 없다. " +
                    "\n\n\n㉢ 투자금의 회수를 위해 피해자를 강요하여 물품대금을 \n" +
                    "횡령하였다는 자인서를 받아낸 뒤 이를 근거로 돈을 \n" +
                    "갈취한 경우, 공갈죄 외에 강요죄도 성립한다. " +
                    "\n\n\n㉣ 감금죄는 사람의 행동의 자유를 그 보호법익으로 하여 \n" +
                    "사람이 특정한 구역에서 나가는 것을 불가능하게 하거나\n" +
                    "또는 감히 곤란하게 하는 죄로서 이와 같이 사람이 특정한\n" +
                    "구역에서 나가는 것을 불가능하게 하거나 감히 곤란하게\n" +
                    "하는 그 장해는 물리적, 유형적 장해 뿐만 아니라 심리적, 무형적 장해에 의하여서도 가능하다. ㉤ 미성년자를 유인한 자가 계속하여 미성년자를 불법하게 \n" +
                    "감금하였을 때에는 미성년자유인죄 외에 감금죄가 별도로\n" +
                    "성립한다",



            "7. " +
                    "다음 중 불가벌적 사후행위에 해당하는 것으로 가장 적절한\n" +
                    "것은?(다툼이 있으면 판례에 의함)" ,





            "8. " +
                    "다음은 몰수·추징에 대한 설명이다. 가장 적절하지 않은 것은?\n" +
                    "(다툼이 있으면 판례에 의함)",




            "9. " +
                    " 다음은 업무방해죄에 대한 설명이다. 가장 적절하지 않은 것은?\n" +
                    "(다툼이 있으면 판례에 의함",



            "10. " +
                    "다음은 살인의 죄에 대한 설명이다. 가장 적절하지 않은 것은?\n" +
                    "(다툼이 있으면 판례에 의함)",





            "11." +
                    " 다음은 강간과 추행의 죄에 대한 설명이다. 가장 적절하지 않은\n" +
                    "것은?(다툼이 있으면 판례에 의함)",




            "12." +
                    "다음은 공동정범에 대한 설명이다. 가장 적절하지 않은\n" +
                    "것은?(다툼이 있으면 판례에 의함)",




            "13. " +
                    "다음은 배임의 죄에 대한 설명이다. 옳은 것은 모두 몇 개인가?\n" +
                    " (다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 피해자는 제1순위의 근저당권이 설정될 것으로 알고 금원을 \n" +
                    "대여하고 그런 내용의 근저당권설정에 관한 문서작성을 위촉\n" +
                    "하였는데도 불구하고 피고인이 후순위인 제2 내지 제3번의 \n" +
                    "근저당권설정에 관한 문서를 작성하여 그에 따른 신청으로 \n" +
                    "등기를 경료한 경우, 배임죄가 성립하지 않는다. " +
                    "\n㉡ 피해자 회사의 사업부 영업팀장인 피고인이 체인점들에 \n" +
                    "대한 전매입고 금액을 삭제하여 전산상 회사의 체인점\n" +
                    "들에 대한 외상대금채권이 줄어든 것으로 처리하는 전산\n" +
                    "조작행위를 한 경우, 업무상 배임죄가 성립한다. " +
                    "\n㉢ 배임죄에 있어서 타인의 사무를 처리하는 자라 함은 양자\n" +
                    "간의 신임관계에 기초를 둔 타인의 재산보호 내지 관리\n" +
                    "의무가 있음을 그 본질적 내용으로 하는 것이므로, 배임죄의 \n" +
                    "성립에 있어 행위자가 대외관계에서 타인의 재산을 처분할 \n" +
                    "적법한 대리권이 있음을 요하지 아니한다. " +
                    "\n㉣ 대표이사가 개인의 차용금 채무에 관하여 개인 명의로 \n" +
                    "작성하여 교부한 차용증에 추가로 회사의 법인 인감을 \n" +
                    "날인한 경우 업무상 배임죄가 성립한다. " +
                    "\n㉤ 甲주식회사 대표이사인 피고인이 주주총회 의사록을 허위로\n" +
                    "작성하고 이를 근거로 피고인을 비롯한 임직원들과 주식매수\n" +
                    "선택권부여계약을 체결한 경우, 업무상 배임죄가 성립한다.",




            "14. " +
                    "다음은 절도죄에 대한 설명이다. 가장 적절하지 않은 것은?\n" +
                    " (다툼이 있으면 판례에 의함)",


            "15." +
                    " 다음은 사기죄에 대한 설명이다. 옳지 않은 것은 모두 몇 개인가?\n" +
                    "(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 송금의뢰인과 수취인 사이에 계좌이체 등의 원인이 되는\n" +
                    "법률관계가 존재하지 않음에도 계좌이체에 의하여 수취인이\n" +
                    "이체금액 상당의 예금채권을 취득한 경우, 수취인이 은행에\n" +
                    "예금반환을 청구하여 지급받는 행위는 은행을 피해자로 한 \n" +
                    "사기죄에 해당한다. " +
                    "\n\n㉡ 배당이의 소송의 제1심에서 패소판결을 받고 항소한 자가\n" +
                    "그 항소를 취하하는 것만으로는 사기죄에서 말하는 재산적\n" +
                    "처분행위가 있다고 할 수 없다. " +
                    "\n\n㉢ 친족상도례에 관한 형법 규정은 사기죄를 가중처벌하는 \n" +
                    "특정경제범죄 가중처벌 등에 관한 법률 제3조 제1항 \n" +
                    "위반죄에도 적용된다. " +
                    "\n\n㉣ 출판사 경영자가 출고현황표를 조작하는 방법으로 실제\n" +
                    "출판부수를 속여 작가에게 인세의 일부만을 지급한 경우\n" +
                    "사기죄에 해당한다. " +
                    "\n\n㉤ 자동차의 명의수탁자가 명의신탁 사실을 고지하지 않고, 나아가 자신 소유라는 말을 하면서 자동차를 제3자에게 \n" +
                    "매도하고 이전등록까지 마쳐 주었다고 하더라도, 매수인에\n" +
                    "대한 관계에서 사기죄가 성립하지 않는다.",



            "16. " +
                    "다음은 문서에 관한 죄에 대한 설명이다. 가장 적절하지 않은\n" +
                    "것은?(다툼이 있으면 판례에 의함)",



            "17. " +
                    "다음은 공무집행방해죄에 대한 설명이다. 가장 적절하지 않은\n" +
                    "것은?(다툼이 있으면 판례에 의함)",





            "18. " +
                    " 다음은 뇌물죄에 대한 설명이다. 옳지 않은 것은 모두 몇 개인가?\n" +
                    "(다툼이 있으면 판례에 의함)" +
                    "\n\n\n㉠ 공무원이 직무집행의 의사 없이 타인을 공갈하여 재물을\n" +
                    "교부하게 한 경우에도 재물의 교부자는 뇌물공여죄로 \n" +
                    "처벌된다. " +
                    "\n\n㉡ 뇌물죄에서 말하는 ‘직무’에는 사무분장에 따라 현실적으로\n" +
                    "담당하지 않는 직무라도 법령상 일반적인 직무권한에 \n" +
                    "속하는 직무 등 공무원이 그 직위에 따라 공무로 담당할\n" +
                    "일체의 직무를 포함한다. " +
                    "\n\n㉢ 수의계약을 체결하는 공무원이 해당 공사업자와 적정한 \n" +
                    "금액 이상으로 계약금액을 부풀려서 계약하고 부풀린 \n" +
                    "금액을 자신이 되돌려 받기로 사전에 약정한 다음 그에 \n" +
                    "따라 돈을 수수하였다면 수뢰죄가 성립한다. " +
                    "\n\n㉣ 수수된 금품의 뇌물성을 인정하는 데 특별히 의무위반\n" +
                    "행위나 청탁의 유무 등을 고려할 필요가 없으므로, 뇌물은\n" +
                    "직무에 관하여 수수된 것으로 족하여 개개의 직무행위와\n" +
                    "대가적 관계에 있을 필요는 없으며, 그 직무행위가 특정된\n" +
                    "것일 필요도 없다.",





            "19. " +
                    "다음은 일반교통방해죄에 대한 설명이다. 가장 적절하지 \n" +
                    "않은 것은?(다툼이 있으면 판례에 의함)",




            "20. " +
                    "다음은 무고죄에 대한 설명이다. 가장 적절하지 않은 것은?\n" +
                    "(다툼이 있으면 판례에 의함)",


    };





    public  static String mChoices [][] = {


            //1

            {"0개",
                    "1개",
                    "2개",
                    "3개"},



            //2

            {"㉠ (O), ㉡ (O), ㉢ (O), ㉣ (O)",
                    "㉠ (X), ㉡ (O), ㉢ (O), ㉣ (O)",
                    "㉠ (X), ㉡ (X), ㉢ (O), ㉣ (X)",
                    "㉠ (X), ㉡ (O), ㉢ (X), ㉣ (X)"},


            //3

            {"술을 마시고 찜질방에 들어온 甲이 찜질방 직원 몰래 후문으로 나가 술을 더 마신 다음 후문으로 다시 들어와 발한실에서 잠을 자다가 사망한 경우, 찜질방 직원 및 영업주가 통제·관리하지 않은 부분과 甲의 사망 간의 관계",
                    "운전자가 시동을 끄고 1단 기어가 들어가 있는 상태에서 시동열쇠를 꽂아둔 채 11세 정도의 어린이를 조수석에 남겨두고 차에서 내려온 동안 어린이가 시동열쇠를 돌리며 가속페달을 밟아 사고가 난 경우, 1단 기어를 넣고 열쇠를 꽂아둔 상태에서 차에서 떠난 과실과 사고 발생 간의 관계",
                    "임차인이 자신의 비용으로 설치·사용하던 가스설비의 휴즈 콕크를 아무런 조치 없이 제거하고 이사를 간 후 주밸브가 열려져 가스가 유입되어 폭발사고가 발생한 경우, 임차인의 과실과 가스폭발사고 간의 관계",
                    "피고인들로부터 폭행을 당하고 당구장 3층 화장실에 숨어 있던 피해자가 다시 피고인들로부터 폭행당하지 않으려고 창문 밖으로 숨으려다가 실족하여 사망한 경우, 피고인들의 폭행과 피해자의 사망 간의 관계"},

            //4

            {"식품위생법의 규정에 의하여 즉석판매제조가공 영업을 허가 받은 자가 의약품의 일종인 ‘녹동달오리골드’를 제조하면서 무면허 의약품제조행위가 아니라고 생각한 경우",
                    "한국간행물윤리위원회나 정보통신윤리위원회가 만화에 대하여 심의하여 음란성 등을 이유로 청소년유해매체물로 판정하였을 뿐 더 나아가 시정요구를 하거나 관계기관에 형사처벌 또는 행정처분을 요청하지 않았기 때문에 피고인들의 행위가 죄가 되지 아니하는 것으로 생각한 경우",
                    "‘탐정업이 인·허가 또는 등록사항이 아니다’는 민원사무 담당 공무원의 말을 듣고 신용조사업법이 금지하는 소재탐지나 사생활 조사 등을 한 경우",
                    "광역시의회 의원이 선거구민들에게 의정보고서를 배부하기 앞서 미리 관할 선거관리위원회 소속 공무원들에게 자문을 구하고 그들의 지적에 따라 수정한 의정보고서를 배부한 경우"},


            //5

            {"협박죄(형법 제283조 제1항), 특수도주죄(형법 제146조), 증거인멸죄(형법 제155조 제1항)는 미수범 처벌규정이 있다.",
                    "판례는 예비죄의 공동정범의 성립은 인정하나, 예비죄의 종범의 성립은 부정한다.",
                    "강도예비·음모죄가 성립하기 위해서는 예비·음모 행위자에게 미필적으로라도 ‘강도’를 할 목적이 있음이 인정되어야 하고 그에 이르지 않고 단순히 ‘준강도’할 목적이 있음에 그치는 경우에는 강도예비·음모죄로 처벌할 수 없다.",
                    "피해자를 살해하려고 그의 가슴을 칼로 수회 찔렀으나, 가슴 부위에서 많은 피가 흘러나오는 것을 발견하고 겁을 먹고 그만둔 경우, 자의에 의한 중지미수라고 볼 수 없다."},



            //6

            {"1개",
                    "2개",
                    "3개",
                    "4개"},


            //7

            {"절취한 자기앞수표를 음식대금으로 교부하고 거스름돈을 환불받은 행위",
                    "사람을 살해한 다음 그 범죄의 흔적을 은폐하기 위하여 그 시체를 다른 장소로 옮겨 유기한 행위",
                    "절취한 전당표를 제3자에게 교부하면서 자기 누님의 것이니 찾아 달라고 거짓말을 하여 이를 믿은 제3자가 전당포에 이르러 그 종업원에게 전당표를 제시하여 기망케 하고 전당물을 교부받은 행위",
                    "부정한 이익을 얻을 목적으로 타인의 영업비밀이 담긴 CD를 절취하여 그 영업비밀을 부정사용한 행위"},


            //8

            {"몰수나 추징이 공소사실과 관련이 있다 하더라도 그 공소사실에 관하여 이미 공소시효가 완성되어 유죄의 선고를 할 수 없는 경우에는 몰수나 추징도 할 수 없다.",
                    "대형할인매장에서 수회 상품을 절취하여 자신의 승용차에 싣고 간 경우, 위 승용차는 형법 제48조 제1항 제1호에 정한 범죄행위에 제공한 물건으로 보아 몰수할 수 있다.",
                    "금품의 무상차용을 통하여 위법한 재산상 이익을 취득한 경우 범인이 받은 부정한 이익은 무상으로 대여받은 금품 그 자체이므로 추징의 대상도 금품 그 자체이다.",
                    "변호사법 위반의 범행으로 금품을 취득한 경우 그 범행 과정에서 지출한 비용은 그 금품을 취득하기 위하여 지출한 부수적 비용에 불과하고, 몰수하여야 할 것은 변호사법 위반의 범행으로 취득한 금품 그 자체이므로, 취득한 금품이 이미 처분되어 추징할 금원을 산정할 때 그 금품의 가액에서 위 지출 비용을 공제할 수는 없다."},

            //9

            {"경비원이 상사의 명령에 의하여 일시적으로 수행하는 유인물의 배부행위는 설사 계속적인 직무권한에 속하지 아니한 일시적인 것이라 할지라도 업무방해죄의 업무에 해당한다.",
                    "공무원이 직무상 수행하는 ‘공무’를 방해하는 행위에 대해서는 업무방해로 의율할 수 없다",
                    "피고인이 그가 경영하던 공장을 갑에게 양도하면서 미수 외상대금채권의 수금권을 포기하기로 약정하고도 이를 외상채무자들에게 고지하지 아니하고 외상대금을 수령한 행위는 업무방해죄가 성립한다.",
                    "피고인을 비롯한 전국철도노동조합 집행부가 중앙노동위원회위원장의 직권중재회부결정에도 불구하고 파업에 돌입할 것을 지시하여, 조합원들이 사업장에 출근하지 아니한 채 업무를 거부하여 철도 운행이 중단되도록 함으로써 사용자(한국철도공사)에게 손해를 입힌 경우, 업무방해죄가 성립한다"},

            //10

            {"피고인이 소란을 피우는 피해자를 말리다가 피해자가 욕하는것에 격분하여 예리한 칼로 피해자의 왼쪽 가슴부분에 길이6cm, 깊이 17cm의 상처 등이 나도록 찔러 곧바로 좌측심낭까지 절단된 경우에 피고인에게 살인의 고의가 인정된다.",
                    "피고인이 살인의 범의를 부인할 경우, 범행 당시 살인의 범의가 있었는지 여부는 피고인이 범행에 이르게 된 경위, 범행의 동기, 준비된 흉기의 유무·종류·용법, 공격의 부위와 반복성, 사망의 결과발생 가능성 정도 등 범행 전후의 객관적인 사정을 종합하여 판단할 수 밖에 없다.",
                    "형수를 향하여 살의를 갖고 몽둥이로 힘껏 내리쳤으나 형수의 등에 업힌 조카의 머리부분에 맞아 조카가 현장 에서 즉사한 경우, 조카에 대한 살인죄가 성립한다.",
                    "적재된 임산물에 대한 부정성 여부를 조사하기 위하여 화물자동차의 승강구에 뛰어올라 정차를 명하는 경찰관을 폭행하여 추락시켜 사망케 한 경우 살인의 고의가 인정된다."},

            //11


            {"유부녀인 피해자에 대하여 성교 요구에 불응하면 혼인 외 성관계 사실을 폭로하겠으며 폭력조직 부하들을 동원하여 신체에 위해를 가할 수도 있다는 것을 암시하는 등 협박하여 피해자를 간음한 때에는 강간죄가 성립한다",
                    "강간죄가 성립하려면 가해자의 폭행·협박은 피해자의 항거를 불가능하게 하거나 현저히 곤란하게 할 정도의 것이어야 하고, 상대방에 대하여 폭행 또는 협박을 가하여 추행행위를 하는 경우에 강제추행죄가 성립하려면 그 폭행 또는 협박이 피해자의 항거를 곤란하게 할 정도일 것을 요한다.",
                    "상대방에 대한 폭행행위 자체가 추행행위라고 인정되는 경우도 강제추행죄에 포함되는 것이며, 이 경우에 있어서의 폭행은 반드시 상대방의 의사를 억압할 정도의 것임을 요하지 않고 상대방의 의사에 반하는 유형력의 행사가 있는 이상 그 힘의 대소강약을 불문한다.",
                    "피고인이, 알고 지내던 여성인 피해자 甲이 자신의 머리채를 잡아 폭행을 가하자 보복의 의미에서 甲의 입술, 귀 등을 입으로 깨무는 등의 행위를 한 사안에서, 피고인의 행위가 강제추행죄의 ‘추행’에 해당한다고 볼 수 없다."},


            //12

            {"딱지어음을 발행하였으나 딱지어음의 전전유통경로, 중간 소지인들, 기망방법을 구체적으로 몰랐던 경우에는 사기죄의 공모관계를 인정할 수 없다.",
                    "공동가공의 의사는 타인의 범행을 인식하면서도 이를 제지하지 아니하고 용인하는 것만으로는 부족하고 공동의 의사로 특정한 범죄행위를 하기 위하여 일체가 되어 서로 다른 사람의 행위를 이용하여 자기의 의사를 실행에 옮기는 것을 내용으로 하는 것이어야 한다.",
                    "포괄일죄의 범행 도중에 공동정범으로 범행에 가담한 자는 이미 이루어진 종전의 범행을 알았다 하더라도 그 가담 이후의 범행에 대하여만 공동정범으로 책임을 진다.",
                    "건설 관련 회사의 유일한 지배자가 회사 대표의 지위에서 장기간에 걸쳐 건설공사 현장소장들의 뇌물공여행위를 보고받고 이를 확인·결재하는 등의 방법으로 위 뇌물공여 행위에 관여한 경우, 비록 사전에 구체적인 대상 및 액수를 정하여 뇌물공여를 지시하지 아니하였더라도 뇌물죄의 공동정범의 죄책을 진다."},

            //13

            {"1개",
                    "2개",
                    "3개",
                    "4개"},




            //14

            {"타인의 명의를 모용하여 발급받은 신용카드를 사용하여 현금자동지급기에서 현금대출을 받은 경우 현금대출을 받은 부분에 대해서 절도죄가 성립한다.",
                    "일시사용의 목적으로 소유자의 승낙 없이 오토바이를 타고 가다가 원래 있던 장소로부터 3㎞ 정도 떨어진 장소에 버린 경우 절도죄가 성립하지 않는다.",
                    "법원으로부터 송달된 심문기일소환장은 재산적 가치가 있는 물건으로서 절도죄의 재물에 해당한다.",
                    "타인의 토지상에 권원 없이 감나무를 식재한 자가 감을 수확한 것은 절도죄에 해당한다."},


            //15

            {"1개",
                    "2개",
                    "3개",
                    "4개"},


            //16

            {"문서를 작성할 권한이 있는 공무원을 보조하는 기안담당자인 공무원이 결재를 받지 않고 임의로 허위공문서를 작성한 경우에는 공문서위조죄가 성립한다",
                    "법원이 이혼의사확인서등본 뒤에 이혼신고서를 첨부하고 간인하여 교부하였는데 당사자가 이를 떼어내고 다른 내용의 이혼신고서를 붙여 호적관서에 제출한 경우, 공문서변조 및 변조공문서행사죄가 성립하지 않는다.",
                    "사문서변조에 있어서 그 변조 당시 명의인의 명시적, 묵시적 승낙 없이 한 것이면 변조된 문서가 명의인에게 유리하여 결과적으로 그 의사에 합치한다 하더라도 사문서변조죄의 구성요건을 충족한다",
                    "공립학교 교사가 작성하는 교원의 인적사항과 전출희망 사항 등을 기재하는 부분과 학교장이 작성하는 학교장 의견란 등으로 구성되어 있는 교원실태조사카드의 교사 명의 부분을 명의자의 의사에 반하여 작성한 행위는 공문서위조죄를 구성한다"},
            //17

            {"공무집행방해죄는 공무원의 직무집행이 적법한 경우에 한하여 성립한다",
                    "출입국관리공무원이 관리자의 사전 동의 없이 사업장에 진입하여 불법체류자 단속업무를 개시한 경우, 공무집행행위의 적법성이 부인되어 공무집행방해죄가 성립하지 않는다.",
                    "검문 중이던 경찰관들이 자전거를 이용한 날치기 사건 범인과 흡사한 인상착의의 피고인이 자전거를 타고 다가오는 것을 발견, 정지를 요구하였으나 멈추지 않아, 앞을 가로막고 소속과 성명을 고지한 후 검문에 협조해 달라는 취지로 말하였음에도 불응하고 그대로 전진하자 따라가서 재차 앞을 막고 검문에 응하라고 요구한 경우, 앞을 가로막고 제지한 행위는 불심검문의 한계를 벗어나 위법하므로 적법성을 전제로 하는 공무집행방해죄는 성립하지 않는다.",
                    "불법주차 차량에 불법주차 스티커를 붙였다가 이를 다시 떼어낸 직후에 있는 주차단속 공무원을 폭행한 경우, 공무집행방해죄가 성립한다."},



            //18

            {"1개",
                    "2개",
                    "3개",
                    "4개"},




            //19

            {"주민들에 의하여 공로로 통하는 유일한 통행로로 오랫동안 이용되어 온 폭 2m의 골목길을 자신의 소유라는 이유로 폭 50cm 내지 75cm 가량만 남겨두고 담장을 설치하여 주민들의 통행을 현저히 곤란하게 하였다면 일반교통 방해죄를 구성한다",
                    "전국민주노동조합총연맹 준비위원회가 주관한 도로행진 시위가 사전에 구 집회및시위에관한법률(2007. 5. 11. 법률 제8424호로 전문 개정되기 전의 것)에 따라 옥외집회신고를 마쳤어도, 신고의 범위와 위 법률 제12조에 따른 제한을 현저히 일탈하여 주요도로 전차선을 점거하여 행진 등을 함으로써 교통소통에 현저한 장해를 일으켰다면, 일반교통방해죄를 구성한다.",
                    "피고인 등 약 600명의 노동조합원들이 차도만 설치되어 있을 뿐 보도는 따로 마련되어 있지 아니한 도로 우측의 편도 2차선의 대부분을 차지하면서 대오를 이루어 행진하는 방법으로 시위를 하고 이로 인하여 나머지 편도 2차선으로 상·하행차량이 통행하느라 차량의 소통이 방해된 경우 피고인 등의 시위행위에 대하여 일반교통방해죄를 적용할 수 있다.",
                    "자기 소유의 토지를 포함한 구도로 옆으로 신도로가 개설 되었다고 하더라도 그 토지가 신도로에 의해 대체될 수 없는 상태여서 여전히 일반인과 차량이 통행하고 있는 경우 그 통행을 방해하면 일반교통방해죄에 해당한다."},
            //20

            {"무고죄에 있어서 허위사실이라는 요건은 적극적인 증명이 있어야 하고, 신고사실의 진실성을 인정할 수 없다는 소극적 증명만으로 곧 그 신고사실이 객관적 진실에 반하는 허위사실이라고 단정하여 무고죄의 성립을 인정할 수는 없다.",
                    "피고인 자신이 상대방의 범행에 가담하였음에도 자신의 가담 사실을 숨기고 상대방만을 고소한 경우에 무고죄가 성립한다",
                    "무고죄에 있어서 허위사실 적시의 정도는 수사관서 또는 감독관서에 대하여 수사권 또는 징계권의 발동을 촉구하는 정도의 것이면 충분하고 반드시 범죄구성요건 사실이나 징계요건 사실을 구체적으로 명시하여야 하는 것은 아니다.",
                    "무고죄에 있어서의 신고는 자발적인 것이어야 하고 수사기관 등의 추문에 대하여 허위의 진술을 하는 것은 무고죄를 구성하지 않는 것이지만, 당초 고소장에 기재하지 않는 사실을 수사기관에서 고소보충조서를 받을 때 자진하여 진술하였다면 이 진술부분까지 신고한 것으로 보아야 한다"},





    };


    public static String mCorrectAnswers[] =
            //1
            {"2개",

                    //2

                    "㉠ (X), ㉡ (O), ㉢ (O), ㉣ (O)",

                    //3

                    "술을 마시고 찜질방에 들어온 甲이 찜질방 직원 몰래 후문으로 나가 술을 더 마신 다음 후문으로 다시 들어와 발한실에서 잠을 자다가 사망한 경우, 찜질방 직원 및 영업주가 통제·관리하지 않은 부분과 甲의 사망 간의 관계",

                    //4

                    "광역시의회 의원이 선거구민들에게 의정보고서를 배부하기 앞서 미리 관할 선거관리위원회 소속 공무원들에게 자문을 구하고 그들의 지적에 따라 수정한 의정보고서를 배부한 경우",

                    //5
                    "협박죄(형법 제283조 제1항), 특수도주죄(형법 제146조), 증거인멸죄(형법 제155조 제1항)는 미수범 처벌규정이 있다.",


                    //6
                    "2개",

                    //7
                    "절취한 자기앞수표를 음식대금으로 교부하고 거스름돈을 환불받은 행위",

                    //8

                    "금품의 무상차용을 통하여 위법한 재산상 이익을 취득한 경우 범인이 받은 부정한 이익은 무상으로 대여받은 금품 그 자체이므로 추징의 대상도 금품 그 자체이다.",

                    //9

                    "피고인이 그가 경영하던 공장을 갑에게 양도하면서 미수 외상대금채권의 수금권을 포기하기로 약정하고도 이를 외상채무자들에게 고지하지 아니하고 외상대금을 수령한 행위는 업무방해죄가 성립한다.",


                    //10

                    "적재된 임산물에 대한 부정성 여부를 조사하기 위하여 화물자동차의 승강구에 뛰어올라 정차를 명하는 경찰관을 폭행하여 추락시켜 사망케 한 경우 살인의 고의가 인정된다.",

                    //11

                    "피고인이, 알고 지내던 여성인 피해자 甲이 자신의 머리채를 잡아 폭행을 가하자 보복의 의미에서 甲의 입술, 귀 등을 입으로 깨무는 등의 행위를 한 사안에서, 피고인의 행위가 강제추행죄의 ‘추행’에 해당한다고 볼 수 없다.",


                    //12
                    "딱지어음을 발행하였으나 딱지어음의 전전유통경로, 중간 소지인들, 기망방법을 구체적으로 몰랐던 경우에는 사기죄의 공모관계를 인정할 수 없다.",

                    //13
                    "1개",

                    //14
                    "일시사용의 목적으로 소유자의 승낙 없이 오토바이를 타고 가다가 원래 있던 장소로부터 3㎞ 정도 떨어진 장소에 버린 경우 절도죄가 성립하지 않는다.",


                    //15
                    "2개",


                    //16
                    "공립학교 교사가 작성하는 교원의 인적사항과 전출희망 사항 등을 기재하는 부분과 학교장이 작성하는 학교장 의견란 등으로 구성되어 있는 교원실태조사카드의 교사 명의 부분을 명의자의 의사에 반하여 작성한 행위는 공문서위조죄를 구성한다",

                    //17
                    "검문 중이던 경찰관들이 자전거를 이용한 날치기 사건 범인과 흡사한 인상착의의 피고인이 자전거를 타고 다가오는 것을 발견, 정지를 요구하였으나 멈추지 않아, 앞을 가로막고 소속과 성명을 고지한 후 검문에 협조해 달라는 취지로 말하였음에도 불응하고 그대로 전진하자 따라가서 재차 앞을 막고 검문에 응하라고 요구한 경우, 앞을 가로막고 제지한 행위는 불심검문의 한계를 벗어나 위법하므로 적법성을 전제로 하는 공무집행방해죄는 성립하지 않는다.",

                    //18
                    "2개",

                    //19
                    "피고인 등 약 600명의 노동조합원들이 차도만 설치되어 있을 뿐 보도는 따로 마련되어 있지 아니한 도로 우측의 편도 2차선의 대부분을 차지하면서 대오를 이루어 행진하는 방법으로 시위를 하고 이로 인하여 나머지 편도 2차선으로 상·하행차량이 통행하느라 차량의 소통이 방해된 경우 피고인 등의 시위행위에 대하여 일반교통방해죄를 적용할 수 있다.",

                    //20
                    "피고인 자신이 상대방의 범행에 가담하였음에도 자신의 가담 사실을 숨기고 상대방만을 고소한 경우에 무고죄가 성립한다",
            };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


