package com.perfect.admin.police1;


public class QuestionLibrary2014_5 {

    //2018 3월 24일  경찰 경찰학개론


    public   static  String mQuestions [] = {



            "1." +
                    "다음 보기 중 경찰개념을 설명한 것으로 틀린 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 형식적 의미의 경찰은 모두 실질적 의미의 경찰에 포함된다. " +
                    "\n㉡ 정보경찰의 활동은 실질적 의미의 경찰보다는 형식적 의미의\n" +
                    "경찰과 관련이 깊다. " +
                    "\n㉢ 실질적 의미의 경찰개념은 학문상으로 정립된 개념이며, 프랑스\n" +
                    "행정법학에서 유래하였다. " +
                    "\n㉣ 형식적 의미의 경찰개념에 입각한 경찰활동의 범위는 나라\n" +
                    "마다 차이가 있을 수 있다. ",


            "2." +
                    "다음은 경찰의 부정부패 원인에 대해 설명한 것이다. 가장 \n" +
                    "적절한 것은?",



            "3." +
                    "다음 보기 중 ‘미군정시기’의 경찰에 대해 설명한 것으로 틀린\n" +
                    "것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 경찰의 조직법적·작용법적 정비가 이루어 졌으며, 비경찰화\n" +
                    "작업이 행해져 경찰의 활동영역이 축소되었다. " +
                    "\n㉡ 비경찰화 작용의 일환으로 위생사무를 위생국으로 이관\n" +
                    "하였고, 정보경찰과 고등경찰을 폐지하였다. " +
                    "\n㉢ 1946년 여자경찰제도를 신설하여 14세 미만의 소년범죄와\n" +
                    "여성관련 업무 등을 담당하게 하였다. " +
                    "\n㉣ 1947년 6인의 위원으로 구성된 중앙경찰위원회가 설치되어\n" +
                    "경찰의 민주화 개혁에 성공하였다. " +
                    "\n㉤ 영미법의 영향을 받아 경찰의 이념 및 제도에 민주적 \n" +
                    "요소가 도입되었다. ",


            "4. " +
                    " 다음 보기 중 안전행정부 소속의 ‘소청심사위원회’를 설명한\n" +
                    "것으로 틀린 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 대학에서 행정학·정치학 또는 법률학을 담당한 부교수 \n" +
                    "이상의 직에 5년 이상 근무한 자는 위원이 될 수 있다. " +
                    "\n\n㉡ 위원장 1명을 포함한 5명 이상 7명 이내의 상임위원과 \n" +
                    "상임위원 수의 2분의 1 이상인 비상임위원으로 구성하되, 위원장은 정무직으로 보한다. " +
                    "\n\n㉢ 소청 사건의 결정은 재적위원 3분의 2 이상의 출석과 재적\n" +
                    "위원 과반수의 합의에 따르되, 의견이 나뉠 경우에는 출석\n" +
                    "위원 과반수에 이를 때까지 소청인에게 가장 불리한 의견에\n" +
                    "차례로 유리한 의견을 더하여 그 중 가장 유리한 의견을 \n" +
                    "합의된 의견으로 본다. " +
                    "\n\n㉣ 상임위원의 임기는 3년으로 하며, 연임할 수 없다. ㉤ 상임위원은 다른 직무를 겸할 수 없다. ",





            "5. " +
                    " 다음은 경찰공무원 징계를 설명한 것이다. 가장 적절한 것은?",





            "6. " +
                    "다음은 경찰공무원의 의무를 설명한 것이다. 가장 적절하지 \n" +
                    "않은 것은?",



            "7. " +
                    "다음은「경찰관직무집행법」제4조 보호조치를 설명한 것이다. 가장 적절한 것은?" ,





            "8. " +
                    "다음 중 「보안업무규정 시행규칙」상 비밀 또는 주요시설 및\n" +
                    "자재에 대한 비인가자의 접근을 방지하기 위하여 그 출입에\n" +
                    "안내가 요구되는 보호구역은?",




            "9. " +
                    "다음은 ‘범죄 통제이론’을 설명한 것이다. 가장 적절하지 않은 것은?",



            "10. " +
                    " 다음 보기 중 「지역경찰의 조직 및 운영에 관한 규칙」상\n" +
                    "지역경찰의 근무종류와 그 업무를 연결한 것으로 옳은 \n" +
                    "것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 행정근무 – 방문민원 및 각종 신고사건의 접수 및 처리\n" +
                    "\n㉡ 상황근무 – 요보호자 또는 피의자에 대한 보호·감시\n" +
                    "\n㉢ 상황근무 – 중요 사건·사고 발생시 보고 및 전파\n" +
                    "\n㉣ 순찰근무 – 주민여론 및 범죄첩보 수집\n" +
                    "\n㉤ 경계근무 – 비상 및 작전사태 등 발생시 차량, 선박 등의\n" +
                    "통행 통제",





            "11." +
                    "다음은 다중범죄 진압경비에 대한 설명이다. 가장 적절하지 \n" +
                    "않은 것은?",




            "12." +
                    " 다음 보기 중 「청원경찰법」상 청원경찰을 설명한 것으로 \n" +
                    "틀린 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 청원경찰은 청원경찰의 배치 결정을 받은 자(이하 청원주)와 \n" +
                    "배치된 기관·시설 또는 사업장 등의 구역을 관할하는 경찰\n" +
                    "서장의 감독을 받아 그 경비구역만의 경비를 목적으로 필요한 \n" +
                    "범위에서 「경찰관직무집행법」에 따른 경찰관의 직무를 수행한다. " +
                    "\n\n㉡ 청원경찰은 청원주가 임용하되, 임용을 할 때에는 미리 지방\n" +
                    "경찰청장의 승인을 받아야 한다. " +
                    "\n\n㉢ 지방경찰청장은 청원경찰이 직무를 수행하기 위하여 필요\n" +
                    "하다고 인정하면 청원주의 신청을 받아 관할 경찰서장으로\n" +
                    "하여금 청원경찰에게 무기를 대여하여 지니게 할 수 있다. " +
                    "\n\n㉣ 청원경찰에 대한 징계 종류로는 파면, 해임, 강등, 감봉, 견책이 있다. ㉤ 청원경찰이 직무를 수행할 때 직권을 남용하여 국민에게 해를\n" +
                    "끼친 경우에는 「청원경찰법」제10조에 의하여 1년 이하의\n" +
                    "징역이나 금고에 처한다.",




            "13. " +
                    "3.「도로교통법 시행규칙」상 도로상태가 위험하거나 도로 또는\n" +
                    "그 부근에 위험물이 있는 경우에 필요한 안전조치를 할 수\n" +
                    "있도록 이를 도로사용자에게 알리는 ‘안전표지’는 무엇인가?",




            "14. " +
                    "다음은 「도로교통법 시행규칙」상 제1종 보통운전면허와 제2종 \n" +
                    "보통운전면허로 운전할 수 있는 차량이다. 괄호 안에 들어갈 \n" +
                    "숫자의 총 합은?" +
                    "\n\n\n< 제1종 보통운전면허 >\n" +
                    "\n㉠ 승차정원 ( )인 이하의 긴급자동차(승용 및 승합자동차에 \n" +
                    "한정한다)\n" +
                    "\n㉡ 적재중량 ( )톤 미만의 화물자동차\n" +
                    "\n㉢ 총 중량 ( )톤 미만의 특수자동차(트레일러 및 레커는 \n" +
                    "제외한다)" +
                    "\n\n\n< 제2종 보통운전면허 >\n" +
                    "\n㉠ 승차정원 ( )인 이하의 승합자동차\n" +
                    "\n㉡ 적재중량 ( )톤 이하의 화물자동차",


            "15." +
                    " 다음 중 정보의 분석형태에 따라 분류한 것은?",



            "16. " +
                    " 다음 보기 중「집회 및 시위에 관한 법률」에 대한 설명으로\n" +
                    "옳은 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 옥외집회 또는 시위 장소가 두 곳 이상의 경찰서의 관할에 \n" +
                    "속하는 경우에는 관할 지방경찰청장에게 제출하여야 하고, 두 곳 이상의 지방경찰청 관할에 속하는 경우에는 경찰\n" +
                    "청장에게 제출하여야 한다. " +
                    "\n㉡ 관할 경찰관서장은 「집회 및 시위에 관한 법률」 제6조 \n" +
                    "제1항에 따른 신고서의 기재 사항에 미비한 점을 발견하면\n" +
                    "접수증을 교부한 때부터 24시간 이내에 주최자에게 12시간을\n" +
                    "기한으로 그 기재 사항을 보완할 것을 통고할 수 있다" +
                    "\n㉢ 금지통고를 받은 주최자는 금지통고를 받은 날로부터 10일\n" +
                    "이내에 해당 경찰관서의 바로 위의 상급 경찰관서의 \n" +
                    "장에게 이의를 신청할 수 있다. " +
                    "\n㉣ ‘주최자’라 함은 자기 이름으로 자기 책임 아래 집회 또는\n" +
                    "시위를 개최하는 사람 또는 단체를 말하며, 주최자는 \n" +
                    "질서유지인을 따로 두어 집회 또는 시위의 실행을 맡아 \n" +
                    "관리하도록 위임할 수 있다. " +
                    "\n㉤ 집회 또는 시위의 주최자 및 질서유지인은 특정한 사람\n" +
                    "이나 단체가 집회나 시위에 참가하는 것을 막을 수 있다. 다만, 언론사의 기자는 출입이 보장되어야 하며, 이 경우\n" +
                    "기자는 신분증을 제시하고 기자임을 표시한 완장을 착용\n" +
                    "하여야 한다.",



            "17. " +
                    "다음 보기 중「국가보안법」에 관한 설명으로 틀린 것은 \n" +
                    "모두 몇 개인가?" +
                    "\n\n\n㉠ 「국가보안법」제10조 불고지죄는 법정형이 5년 이하의 \n" +
                    "징역 또는 300만원 이하의 벌금으로 국가보안법 중 \n" +
                    "유일하게 선택형으로 벌금형을 두고 있다. " +
                    "\n㉡ 「국가보안법」의 죄를 범한 후 자수한 때에는 그 형을 \n" +
                    "감경 또는 면제한다. " +
                    "㉢ 공소보류 결정을 받은 자가 공소제기 없이 2년이 경과한\n" +
                    "때에는 소추할 수 없다. " +
                    "\n㉣ 검사 또는 사법경찰관으로부터「국가보안법」에 정한 죄의\n" +
                    "참고인으로 출석을 요구받은 자가 정당한 이유 없이 \n" +
                    "2회 이상 출석요구에 불응한 때에는 관할법원판사의 \n" +
                    "구속영장을 발부받아 구인할 수 있다.",





            "18. " +
                    " 다음은「보안관찰법」상 ‘보안관찰처분’을 설명한 것이다. 가장 적절한 것은?",





            "19. " +
                    "다음의 설명은 ‘범죄인인도원칙’ 중 어떤 원칙에 관한 것인가?" +
                    "\n\n인도청구가 있는 범죄가 청구국과 피청구국 쌍방의 법률에 \n" +
                    "의하여 범죄를 구성하지 않는 경우에는 그 범죄에 관하여 \n" +
                    "범죄인을 인도하지 않는다. ",




            "20. " +
                    " 다음 보기 중 「출입국관리법」상 외국인의 강제퇴거 대상으로\n" +
                    "틀린 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 유효한 여권 또는 사증 없이 입국한 자\n" +
                    "\n㉡ 입국금지 해당사유가 입국 후에 발견되거나 발생한 자\n" +
                    "\n㉢ 체류자격 외의 활동을 하거나 체류기간이 경과한 자\n" +
                    "\n㉣ 상륙허가 없이 상륙하였거나 상륙허가 조건을 위반한 자\n" +
                    "\n㉤ 금고 이상의 형의 선고를 받고 석방된 자",


    };





    public  static String mChoices [][] = {


            //1

            {"1개",
                    "2개",
                    "3개",
                    "4개"},



            //2

            {"전체사회가설 : 대표적으로 니더호퍼, 로벅, 바커 등이 주장한 것으로, ‘미끄러지기 쉬운 경사로 이론’과 관련이 깊다.",
                    "썩은사과가설 : 경찰의 부정부패 현상이 나타나는 원인으로 미국의 윌슨은 “시카고 시민이 경찰을 부패시켰다”고 주장하면서, 시민사회의 부패가 경찰부패의 주원인이라고 보았다",
                    "구조원인가설 : 신임 경찰관들이 그들의 선배 동료들에 의해 만들어진 조직적인 부패의 전통 내에서 사회화됨으로써 부패의 길로 들어선다는 입장이다.",
                    "전체사회가설 : 자질이 없는 경찰관들이 모집단계에서 배제되지 않고 조직 내로 유입됨으로써 경찰의 부패가 나타난다는 이론이다"},


            //3

            {"0개",
                    "1개",
                    "2개",
                    "3개"},

            //4

            {"1개",
                    "2개",
                    "3개",
                    "4개"},


            //5

            {"총경과 경정의 강등 및 정직은 경찰청장이 행한다.",
                    "경무관 이상의 경찰공무원에 대한 징계의결은 「국가공무원법」에 따라 경찰청에 설치된 경찰공무원 중앙징계위원회에서 한다",
                    "징계 등 의결을 요구한 자는 경징계의 징계 등 의결을 통지 받았을 때에는 통지받은 날부터 30일 이내에 징계 등을 집행하여야 한다.",
                    "징계의결 등의 요구는 징계 등의 사유가 발생한 날부터 2년(금품 및 향응 수수, 공금의 횡령·유용의 경우에는 3년)이 지나면 하지 못한다."},



            //6

            {"‘비밀엄수의 의무’에서 비밀의 범위는 자신이 처리하는 직무에 직결된 비밀뿐만 아니라, 직무와 관련하여 알게된 모든 비밀을 포함한다",
                    "거짓보고 금지의무’는 「경찰공무원법」에 명시되어 있다.",
                    "「국가공무원법」상 ‘종교중립의 의무’는 신분상 의무가 아니라 직무상 의무에 속한다.",
                    "「경찰공무원법」상 ‘성실 의무’는 공무원의 기본적 의무로서 모든 의무의 원천이 된다."},


            //7

            {"경찰관은 수상한 거동 기타 주위의 사정을 합리적으로 판단하여 보호조치대상자에 해당함이 명백하며 응급의 구호를 요한다고 믿을 만한 상당한 이유가 있는 자를 발견한 때에는 보건의료기관 또는 공공구호기관에 긴급구호를 요청하거나 경찰관서에 보호하는 등 적당한 조치를 하여야 한다.",
                    "경찰관이 보호조치를 한 때에는 지체 없이 이를 피구호자의 가족·친지 기타 연고자에게 그 사실을 통지하여야 하며, 연고자가 발견되지 아니할 때에는 피보호자를 적당한 공중보건의료기관이나 공공구호기관에 즉시 인계하여야 한다.",
                    "경찰관서에서의 보호조치는 12시간을 초과할 수 없다",
                    "미아·병자·부상자 등으로서 적당한 보호자가 없으며 응급의 구호를 요한다고 인정되면 당해인이 거절하더라도 보호조치가 가능하다."},


            //8

            {"통제구역",
                    "통제지역",
                    "제한지역",
                    "제한구역"},

            //9

            {"‘억제이론’은 인간의 합리적 판단이 범죄 행동에도 적용된다고보아서 폭력과 같은 충동적 범죄에는 적용에 한계가 있다",
                    "치료 및 갱생이론’은 결정론적 인간관에 입각하여 특별예방효과에 중점을 둔다.",
                    "‘일상활동이론’의 범죄발생 3요소는 ‘동기가 부여된 잠재적 범죄자’, ‘적절한 대상’, ‘범행의 기술’이다.",
                    "로버트 샘슨은 지역주민 간의 상호신뢰 또는 연대감과 범죄에 대한 적극적인 개입을 강조하는 ‘집합효율성이론’을 주장하였다. "},

            //10

            {"1개",
                    "2개",
                    "3개",
                    "4개"},

            //11


            {"다중범죄의 특성으로는 부화뇌동적 파급성, 비이성적 단순성, 확신적 행동성, 조직적 연계성이 있다.",
                    "진압의 3대원칙으로는 신속한 해산, 주모자 체포, 재집결 방지가 있다",
                    "진압의 기본원칙 중 군중이 목적지에 집결하기 이전에 중간에서 차단하여 집합을 하지 못하게 하는 방법은 차단·배제이다.",
                    "다중범죄의 정책적 치료법 중 불만집단과 반대되는 대중의견을 크게 부각시켜 불만집단이 위압되어 스스로 해산 및 분산되도록 하는 방법은 전이법이다."},


            //12

            {"0개",
                    "1개",
                    "2개",
                    "3개"},

            //13

            {"주의표지",
                    "규제표지",
                    "지시표지",
                    "보조표지"},




            //14

            {"41",
                    "45",
                    "48",
                    "51"},


            //15

            {"전략정보,전술정보",
                    "적극정보,소극(보안)정보",
                    "정치정보,경제정보,사회정보,군사정보,과학정보",
                    "기본정보,현용정보,판단정보"},


            //16

            {"1개",
                    "2개",
                    "3개",
                    "4개"},
            //17

            {"0개",
                    "1개",
                    "2개",
                    "3개"},



            //18

            {"‘보안관찰처분대상자’라 함은 보안관찰해당범죄 또는 이와 경합된 범죄로 금고 이상의 형의 선고를 받고 그 형기 합계가 2년 이상인 자로서 형의 전부 또는 일부의 집행을 받은 사실이 있는 자를 말한다.",
                    "보안관찰처분의 기간은 2년으로 하며, 법무부장관은 검사의 청구가 있는 때에는 보안관찰처분심의위원회의 의결을 거쳐 그 기간을 갱신할 수 있다.",
                    "보안관찰처분대상자는 출소 후 2개월 이내에 그 거주예정지 관할경찰서장에게 출소사실을 신고하여야 한다.",
                    "검사는 피보안관찰자가 도주하거나 1월 이상 그 소재가 불명한 때에는 보안관찰처분의 집행중지결정을 할 수 있으며, 그 사유가 소멸된 때에는 7일 이내에 그 결정을 취소하여야 한다."},




            //19

            {"쌍방가벌성의 원칙",
                    "특정성의 원칙",
                    "자국민 불인도의 원칙",
                    "상호주의 원칙"},
            //20

            {"0개",
                    "1개",
                    "2개",
                    "3개"},





    };


    public static String mCorrectAnswers[] =
            //1
            {"2개",

                    //2

                    "구조원인가설 : 신임 경찰관들이 그들의 선배 동료들에 의해 만들어진 조직적인 부패의 전통 내에서 사회화됨으로써 부패의 길로 들어선다는 입장이다.",

                    //3

                    "2개",

                    //4

                    "2개",

                    //5
                    "총경과 경정의 강등 및 정직은 경찰청장이 행한다.",


                    //6
                    "「경찰공무원법」상 ‘성실 의무’는 공무원의 기본적 의무로서 모든 의무의 원천이 된다.",

                    //7
                    "경찰관이 보호조치를 한 때에는 지체 없이 이를 피구호자의 가족·친지 기타 연고자에게 그 사실을 통지하여야 하며, 연고자가 발견되지 아니할 때에는 피보호자를 적당한 공중보건의료기관이나 공공구호기관에 즉시 인계하여야 한다.",

                    //8

                    "제한구역",

                    //9

                    "‘일상활동이론’의 범죄발생 3요소는 ‘동기가 부여된 잠재적 범죄자’, ‘적절한 대상’, ‘범행의 기술’이다.",


                    //10

                    "4개",

                    //11

                    "다중범죄의 정책적 치료법 중 불만집단과 반대되는 대중의견을 크게 부각시켜 불만집단이 위압되어 스스로 해산 및 분산되도록 하는 방법은 전이법이다.",


                    //12
                    "2개",

                    //13
                    "주의표지",

                    //14
                    "48",


                    //15
                    "기본정보,현용정보,판단정보",


                    //16
                    "2개",

                    //17
                    "1개",

                    //18
                    "보안관찰처분의 기간은 2년으로 하며, 법무부장관은 검사의 청구가 있는 때에는 보안관찰처분심의위원회의 의결을 거쳐 그 기간을 갱신할 수 있다.",

                    //19
                    "쌍방가벌성의 원칙",

                    //20
                    "0개",
            };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


