package com.perfect.admin.police1;


public class QuestionLibrary2017_5 {

    //2018 3월 24일  경찰 경찰학개론


    public   static  String mQuestions [] = {



            "1." +
                    "경찰의 부정부패 원인에 대한 설명으로 가장 적절한 것은?",


            "2." +
                    "「경찰청 공무원 행동강령」에 대한 설명으로 가장 적절하지 않은 것은?",



            "3." +
                    "「경찰법」 상 경찰위원회에 대한 규정이다. 아래 ㉠부터 ㉣까지의 설명 중 옳고 그름의 표시(O, X)가 바르게 된 것은?" +
                    "\n\n\n㉠경찰위원회는 위원장 1명을 포함한 7명의 위원으로 구성하되, 위원장 및 5명의 위원은 상임으로 하고, 1명의 위원은 비상임으로 한다.\n" +
                    "\n㉡위원 중 3명은 법관의 자격이 있는 사람이어야 한다.\n" +
                    "\n㉢위원은 행정자치부장관의 제청으로 국무총리를 거쳐 대통령이 임명한다.\n" +
                    "\n㉣위원의 임기는 3년으로 하며, 연임할 수 있다. 이 경우 보궐위원의 임기는 전임자 임기의 남은 기간으로 한다.",


            "4. " +
                    "「경찰공무원법」 상 시보임용에 대한 설명 중 가장 적절하지 않은 것은?",





            "5. " +
                    "「질서위반행위규제법」에 대한 설명으로 가장 적절한 것은?",





            "6. " +
                    "「위해성 경찰장비의 사용기준 등에 관한 규정」에 대한 설명으로 가장 적절하지 않은 것은?",



            "7. " +
                    "「경찰공무원법」 상 규정이다. (  )안에 들어갈 숫자를 모두 더한 값은?" +
                    "\n\n\n경찰공무원의 정년은 다음과 같다.\n" +
                    "\n1. 연령정년 : 60세\n" +
                    "\n2. 계급정년 \n" +
                    "\n   치안감 : (  )년     경무관 : (  )년\n" +
                    "\n   총경 : (  )년       경정 : (  )년" ,





            "8. " +
                    "공직 분류 방식 중 계급제와 직위분류제에 대한 설명이다. 가장 적절하지 않은 것은?",




            "9. " +
                    "「공공기관의 정보공개에 관한 법률」에 대한 설명으로 가장 적절하지 않은 것은?",



            "10. " +
                    "「경찰 감찰 규칙」에 대한 설명으로 가장 적절한 것은?",





            "11." +
                    "「경비업법」 상 경비업에 대한 설명이다. 다음 중 옳은 것을 모두 고른 것은?" +
                    "\n\n\n㉠경비업의 업무에는 시설경비, 호송경비, 신변보호, 기계경비, 특수경비가 있다.\n" +
                    "\n㉡신변보호업무는 사람의 생명이나 신체에 대한 위해의 발생을 방지하고 그 신변을 보호하는 업무이다.\n" +
                    "\n㉢시설경비업무는 공항(항공기를 포함) 등 대통령령이 정하는 국가중요시설의 경비 및 도난·화재 그 밖의 위험발생을 방지하는 업무이다.\n" +
                    "\n㉣기계경비업무는 경비대상시설에 설치한 기기에 의하여 감지·송신된 정보를 그 경비대상시설 내의 장소에 설치한 관제시설의 기기로 수신하여 도난·화재 등 위험발생을 방지하는 업무이다.",




            "12." +
                    "「실종아동등의 보호 및 지원에 관한 법률」과 「실종아동등 및 가출인 업무처리 규칙」 상 용어의 설명으로 가장 적절한 것은?",




            "13. " +
                    "「집회 및 시위에 관한 법률 시행령」에 대한 설명이다. 옳은 것을 모두 고른 것은?" +
                    "\n\n\n㉠관할 경찰관서장이 권한을 부여하면 관할 경찰서 경비교통과장도 해산명령의 주체가 될 수 있다.\n" +
                    "\n㉡자진 해산 요청은 직접 집회주최자에게 공개적으로 하여야 한다.\n" +
                    "\n㉢자진 해산 요청에 따르지 아니하는 경우에는 세 번 이상 자진 해산할 것을 명령하고, 참가자들이 해산명령에도 불구하고 해산하지 아니하면 직접 해산시킬 수 있다.\n" +
                    "\n㉣종결선언은 주최자에게 요청하되, 주최자의 소재를 알 수 없는 경우에는 주관자·연락책임자 및 질서유지인에게 하여야 하며 종결선언의 요청은 필요적 절차로 생략할 수 없다.",




            "14. " +
                    "「국민보호와 공공안전을 위한 테러방지법」에 대한 설명으로 가장 적절한 것은?",


            "15." +
                    "「도로교통법」 상 ‘주차금지장소’에 대한 설명으로 가장 적절하지 않은 것은?",



            "16. " +
                    "「도로교통법」 및 「도로교통법 시행규칙」 상 제1종 특수면허로 운전할 수 없는 것을 모두 고른 것은?" +
                    "\n\n\n㉠소방차\n" +
                    "\n㉡구급차\n" +
                    "\n㉢배기량 125cc인 이륜자동차\n" +
                    "\n㉣승차정원 10명인 승합자동차",



            "17. " +
                    "정보의 배포수단에 대한 설명 중 가장 적절하게 연결된 것은?" +
                    "\n\n\n㉠통상 개인적인 대화의 형태로 이루어지며, 질문에 대한 답변이나 토의 형태로 직접 전달하는 방법이다.\n" +
                    "\n㉡정보사용자 또는 다수 인원에게 신속히 전달하는 경우에 이용되는 방법으로 강연식이나 문답식으로 진행되며, 현용정보의 배포수단으로 많이 이용된다.\n" +
                    "\n㉢정보분석관이 가장 많이 활용하는 방법으로 정기간행물에 포함시키는 것이 적절하지 못한 긴급한 정보를 전달하는 데 주로 사용되며, 신속성이 중요하다.\n" +
                    "\n㉣매일 24시간에 걸친 정치, 경제, 사회, 문화 등 제반 정세의 변화를 중점적으로 망라한 보고서로 사전에 고안된 양식에 의해 매일 작성되며, 제한된 범위에서 배포된다.",





            "18. " +
                    "간첩망의 형태에 대한 설명 중 가장 적절한 것은?",





            "19. " +
                    "「보안관찰법」 상 보안관찰 해당범죄가 아닌 것은?",




            "20. " +
                    "「출입국관리법」 제4조에는 국민의 출국 금지 기간에 대하여 정하고 있다. 다음 (  )안에 들어갈 숫자를 모두 더한 값은? (단, 기간연장은 없음)" +
                    "\n\n\n㉠범죄 수사를 위하여 출국이 적당하지 아니하다고 인정되는 사람 : (  )개월 이내\n" +
                    "\n㉡형사재판에 계속 중인 사람 : (  )개월 이내\n" +
                    "\n㉢징역형의 집행이 끝나지 아니한 사람 : (  )개월 이내\n" +
                    "\n㉣소재를 알 수 없어 기소중지결정이 된 사람 : (  )개월 이내\n" +
                    "\n㉤도주 등 특별한 사유가 있어 수사진행이 어려운 사람 : (  )개월 이내",


    };





    public  static String mChoices [][] = {


            //1

            {"미국의 윌슨은 ‘시카고 시민이 경찰을 부패시켰다’며 ‘구조원인 가설’을 주장하였다.",
                    "니더호퍼, 로벅, 바커 등이 주장한 ‘전체사회 가설’은 ‘미끄러지기 쉬운 경사로 이론’과 관련이 깊다.",
                    "셔먼의 ‘미끄러지기 쉬운 경사로 이론’에 의하면 공짜 커피 한 잔도 부패에 해당한다.",
                    "선배경찰의 부패행태로부터 신임경찰이 차츰 사회화되어 신임경찰도 기존 경찰처럼 부패로 물들게 된다는 이론은 ‘구조원인 가설’이다."},



            //2

            {"공무원은 상급자가 자기 또는 타인의 부당한 이익을 위하여 공정한 직무수행을 현저하게 해치는 지시를 하였을 때에는 그 사유를 그 상급자에게 소명하고 지시에 따르지 아니하거나 행동강령책임관과 상담할 수 있다.",
                    "공무원은 자신이 수행하는 직무가 지속적인 만남 또는 연락 등으로 친분관계가 형성되어 공정한 직무수행이 어렵다고 판단되는 자가 직무관련자인 경우에는 그 직무의 회피 여부 등에 관하여 직근 상급자 또는 행동강령책임관과 상담한 후 처리하여야 한다. 다만, 행동강령책임관이 공정한 직무수행에 영향을 받지 아니한다고 판단하여 정하는 단순 민원업무의 경우에는 그러하지 아니하다.",
                    "공무원은 정치인이나 정당 등으로부터 부당한 직무수행을 강요받거나 청탁을 받은 경우에는 소속 기관의 장에게 보고하거나 행동강령책임관과 상담한 후 처리하여야 한다.",
                    "공무원은 직위를 이용하여 다른 공무원의 임용·승진·전보 등 인사에 부당하게 개입해서는 아니 된다."},


            //3

            {"㉠(X) ㉡(X) ㉢(O) ㉣(X)",
                    "㉠(O) ㉡(X) ㉢(X) ㉣(O)",
                    "㉠(X) ㉡(O) ㉢(O) ㉣(O)",
                    "㉠(O) ㉡(O) ㉢(X) ㉣(X)"},

            //4

            {"직한 경찰공무원으로서 퇴직 시에 재직하였던 계급의 채용시험에 합격한 사람을 재임용하는 경우에는 시보임용을 거치지 아니한다.",
                    "경정 이하의 경찰공무원을 신규채용할 때에는 1년간 시보로 임용하고, 그 기간이 만료된 다음 날에 정규 경찰공무원으로 임용한다.",
                    "경찰대학을 졸업한 사람 또는 경찰간부후보생으로서 정하여진 교육을 마친 사람을 경위로 임용하는 경우에는 시보임용을 거치지 아니한다.",
                    "자치경찰공무원을 그 계급에 상응하는 경찰공무원으로 임용하는 경우에는 시보임용을 거쳐야 한다."},


            //5

            {"질서위반행위의 성립과 과태료 처분은 처분 시의 법률에 따른다.",
                    "고의 또는 과실이 없는 질서위반행위에도 과태료를 부과한다.",
                    "2인 이상이 질서위반행위에 가담한 때에는 각자가 질서위반행위를 한 것으로 본다.",
                    "과태료는 행정청의 과태료 부과 처분이나 법원의 과태료 재판이 확정된 후 3년간 징수하지 아니하거나 집행하지 아니하면 시효로 인하여 소멸한다."},



            //6

            {"경찰관은 총기 또는 폭발물을 가지고 대항하는 경우를 제외하고는 14세 미만의 자 또는 임산부에 대하여 권총 또는 소총을 발사하여서는 아니 된다.",
                    "가스차·살수차·특수진압차·물포·석궁·다목적발사기 및 도주차량차단장비는 ‘기타장비’에 포함된다.",
                    "근접분사기·가스분사기·가스발사총(고무탄 발사겸용은 제외) 및 최루탄(그 발사장치를 포함)은 ‘분사기·최루탄등’에 포함된다.",
                    "권총·소총·기관총(기관단총을 포함)·산탄총·유탄발사기·박격포·3인치포·함포·크레모아·수류탄·폭약류 및 도검은 ‘무기’에 포함된다."},


            //7

            {"35",
                    "34",
                    "33",
                    "32"},


            //8

            {"급제는 사람을, 직위분류제는 직무를 중요시한다.",
                    "직위분류제는 계급제보다 권한의 한계가 불명확하다.",
                    "공직을 평생직장으로 이해하는 직업공무원제도의 정착에는 직위분류제보다 계급제가 유리하다.",
                    "우리나라의 공직 분류는 계급제 위주에 직위분류제적 요소를 가미한 혼합형태라고 할 수 있다."},

            //9

            {"공공기관이 보유·관리하는 정보는 국민의 알권리 보장 등을 위하여 이 법에서 정하는 바에 따라 적극적으로 공개하여야 한다.",
                    "청구인이 정보공개와 관련한 공공기관의 결정에 대하여 불복이 있거나 정보공개 청구 후 20일이 경과하도록 정보공개 결정이 없는 때에는 「행정심판법」에서 정하는 바에 따라 행정심판을 청구할 수 있다.",
                    "공공기관은 청구인의 정보공개청구가 있을 때에는 원칙적으로 청구를 받은 날부터 10일 이내에 공개 여부를 결정하여야 한다.",
                    "공공기관은 이의신청을 받은 날부터 7일 이내에 그 이의신청에 대하여 결정하고 그 결과를 청구인에게 지체 없이 문서로 통지하여야 한다. 다만, 부득이한 사유로 정하여진 기간 이내에 결정할 수 없을 때에는 그 기간이 끝나는 날부터 기산하여 7일의 범위에서 연장할 수 있으며, 연장 사유를 청구인에게 통지하여야 한다."},

            //10

            {"감찰관은 심야(오후 10시부터 오전 6시까지를 말한다)에 조사를 하여서는 아니 된다. 다만, 사안에 따라 신속한 조사가 필요하고, 조사대상자로부터 심야조사 동의서를 받은 경우에는 심야에도 조사할 수 있다.",
                    "감찰관은 소속 경찰기관의 관할구역 안에서 활동하는 것을 원칙으로 한다. 다만, 필요한 경우에는 관할구역 밖에서도 활동할 수 있다.",
                    "감찰관은 검찰·경찰, 그 밖의 수사기관으로부터 수사개시 통보를 받은 경우에는 징계의결 요구권자의 결재를 받아 해당기관으로부터 수사결과의 통보를 받을 때까지 감찰조사, 징계의결요구 등의 절차를 진행해야 한다.",
                    "감찰관은 감찰조사를 실시하기 전에 조사대상자에게 의무위반행위 사실의 요지를 알릴 수 없지만 다른 감찰관의 참여를 요구할 수 있음은 고지하여야 한다."},

            //11


            {"없음",
                    "㉠㉡",
                    "㉠㉡㉢",
                    "㉠㉡㉢㉣"},


            //12

            {"‘아동등’이란 실종신고 당시 18세 미만인 아동, 「장애인복지법」 제2조의 장애인 중 지적장애인, 자폐성장애인 또는 정신장애인 및 「치매관리법」 제2조 제2호의 치매환자를 말한다.",
                    "‘발생지’란 실종아동등 및 가출인이 실종·가출 전 최종적으로 목격되었거나 목격되었을 것으로 추정하여 신고자 등이 진술한 장소를 말하며, 신고자 등이 최종 목격 장소를 진술하지 못하거나, 목격되었을 것으로 추정되는 장소가 대중교통시설 등일 경우 또는 실종·가출 발생 후 10일이 경과한 때에는 실종아동등 및 가출인의 실종 전 최종 주거지를 말한다.",
                    "‘발견지’란 실종아동등 또는 가출인을 발견하여 보호 중인 장소를 말하며, 발견한 장소와 보호 중인 장소가 서로 다른 경우에는 발견한 장소를 말한다.",
                    "‘장기실종아동등’이란 보호자로부터 신고를 접수한 지 48시간이 경과한 후에도 발견되지 않은 찾는실종아동등을 말한다."},

            //13

            {"㉠㉡",
                    "㉠㉢",
                    "㉡㉢",
                    "㉢㉣"},




            //14

            {"국가테러대책위원회 위원장은 대통령으로 한다.",
                    "‘테러단체’란 국제연합(UN)이 지정한 테러단체를 말한다.",
                    "‘테러위험인물’이란 테러를 실행·계획·준비하거나 테러에 참가할 목적으로 국적국이 아닌 국가의 테러단체에 가입하거나 가입하기 위하여 이동 또는 이동을 시도하는 내국인·외국인을 말한다.",
                    "국가정보원장은 테러위험인물에 대하여 출입국·금융거래 및 통신이용 등 관련 정보를 수집하여야 한다."},


            //15

            {"터널 안 및 다리 위",
                    "화재경보기로부터 3미터 이내인 곳",
                    "소방용 기계·기구가 설치된 곳으로부터 5미터 이내인 곳",
                    "도로공사를 하고 있는 경우에는 그 공사 구역의 양쪽 가장자리로부터 10미터 이내인 곳"},


            //16

            {"없음",
                    "㉠㉡",
                    "㉠㉡㉢",
                    "㉠㉡㉢㉣"},
            //17

            {"㉠ 비공식적 방법  ㉡ 브리핑  ㉢ 메모  ㉣ 일일정보보고서",
                    "㉠ 비공식적 방법  ㉡ 브리핑  ㉢ 전신  ㉣ 특별보고서",
                    "㉠ 브리핑  ㉡ 비공식적 방법  ㉢ 메모  ㉣ 특별보고서",
                    "㉠ 브리핑  ㉡ 비공식적 방법  ㉢ 전신  ㉣ 일일정보보고서"},



            //18

            {"단일형은 간첩이 단일 특수 목적을 수행하기 위해 동조자를 포섭하지 않고 단독으로 활동하는 점조직으로 대남간첩이 가장 많이 사용하며, 간첩 상호간에 종적·횡적 연락의 차단으로 보안 유지 및 신속한 활동이 가능하며 활동 범위가 넓고 공작 성과가 높다는 장점이 있다.",
                    "삼각형은 지하당조직에서 주로 사용하는 간첩망 형태로, 지하당 구축을 하명받은 간첩이 3명 이내의 행동공작원을 포섭하여 직접 지휘하고 포섭된 공작원 간의 횡적 연락을 차단시키는 활동 조직이다.",
                    "피라미드형은 간첩 밑에 주공작원 2~3명을 두고, 주공작원은 그 밑에 각각 2~3명의 행동공작원을 두는 조직형태로 일시에 많은 공작을 입체적으로 수행할 수 있어 활동 범위가 넓고 조직 구성에 많은 시간이 소요되지 않는다는 장점이 있다.",
                    "레포형은 삼각형 조직에 있어서 간첩과 주공작원 간, 행동공작원 상호간에 연락원을 두고 종·횡으로 연결하는 형태이다."},




            //19

            {"「형법」 상 내란죄",
                    "「군형법」 상 일반이적죄",
                    "「국가보안법」 상 목적수행죄",
                    "「국가보안법」 상 금품수수죄"},
            //20

            {"10",
                    "16",
                    "19",
                    "20"},





    };


    public static String mCorrectAnswers[] =
            //1
            {"선배경찰의 부패행태로부터 신임경찰이 차츰 사회화되어 신임경찰도 기존 경찰처럼 부패로 물들게 된다는 이론은 ‘구조원인 가설’이다.",

                    //2

                    "공무원은 자신이 수행하는 직무가 지속적인 만남 또는 연락 등으로 친분관계가 형성되어 공정한 직무수행이 어렵다고 판단되는 자가 직무관련자인 경우에는 그 직무의 회피 여부 등에 관하여 직근 상급자 또는 행동강령책임관과 상담한 후 처리하여야 한다. 다만, 행동강령책임관이 공정한 직무수행에 영향을 받지 아니한다고 판단하여 정하는 단순 민원업무의 경우에는 그러하지 아니하다.",

                    //3

                    "㉠(X) ㉡(X) ㉢(O) ㉣(X)",

                    //4

                    "자치경찰공무원을 그 계급에 상응하는 경찰공무원으로 임용하는 경우에는 시보임용을 거쳐야 한다.",

                    //5
                    "2인 이상이 질서위반행위에 가담한 때에는 각자가 질서위반행위를 한 것으로 본다.",


                    //6
                    "근접분사기·가스분사기·가스발사총(고무탄 발사겸용은 제외) 및 최루탄(그 발사장치를 포함)은 ‘분사기·최루탄등’에 포함된다.",

                    //7
                    "35",

                    //8

                    "직위분류제는 계급제보다 권한의 한계가 불명확하다.",

                    //9

                    "공공기관은 이의신청을 받은 날부터 7일 이내에 그 이의신청에 대하여 결정하고 그 결과를 청구인에게 지체 없이 문서로 통지하여야 한다. 다만, 부득이한 사유로 정하여진 기간 이내에 결정할 수 없을 때에는 그 기간이 끝나는 날부터 기산하여 7일의 범위에서 연장할 수 있으며, 연장 사유를 청구인에게 통지하여야 한다.",


                    //10

                    "감찰관은 소속 경찰기관의 관할구역 안에서 활동하는 것을 원칙으로 한다. 다만, 필요한 경우에는 관할구역 밖에서도 활동할 수 있다.",

                    //11

                    "㉠㉡",


                    //12
                    "‘장기실종아동등’이란 보호자로부터 신고를 접수한 지 48시간이 경과한 후에도 발견되지 않은 찾는실종아동등을 말한다.",

                    //13
                    "㉠㉢",

                    //14
                    "‘테러단체’란 국제연합(UN)이 지정한 테러단체를 말한다.",


                    //15
                    "도로공사를 하고 있는 경우에는 그 공사 구역의 양쪽 가장자리로부터 10미터 이내인 곳",


                    //16
                    "㉠㉡",

                    //17
                    "㉠ 비공식적 방법  ㉡ 브리핑  ㉢ 메모  ㉣ 일일정보보고서",

                    //18
                    "삼각형은 지하당조직에서 주로 사용하는 간첩망 형태로, 지하당 구축을 하명받은 간첩이 3명 이내의 행동공작원을 포섭하여 직접 지휘하고 포섭된 공작원 간의 횡적 연락을 차단시키는 활동 조직이다.",

                    //19
                    "「형법」 상 내란죄",

                    //20
                    "19",
            };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


