package com.perfect.admin.police1;


public class QuestionLibrary2018_3 {

       //2018 3월 24일  경찰 형법


    public   static  String mQuestions [] = {
            "1. " +
                    "죄형법정주의에 대한 설명으로 가장 적절한 것은?(다툼이 있는 경우 판례에 의함)",
            "2." +
                    "부작위범에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",
            "3." +
                    "다음 설명 중 옳고 그름의 표시(O, X)가 바르게 된 것은?(다툼이 있는 경우 판례에 의하되, 주거침입죄는 논외로 함)" +
                    "\n\n ㉠甲이 乙에 대하여 상해를 교사하였는데 乙이 이를 넘어 살인을 실행한 경우에, 甲에게 피해자의 사망이라는 결과에 대하여 과실 내지 예견가능성이 있는 때에는 상해치사죄가 성립한다. \n" +
                    "\n㉡甲은 乙을 살해하기 위하여 乙의 집으로 갔으나, 乙은 집에 없고 乙의 처 丙이 자신을 알아보자 丙을 야구방망이로 강타하여 실신시킨 후 이불을 뒤집어 씌우고 석유를 뿌려 방화함으로써 乙의 집을 전소케 하고 丙을 사망케 한 경우, 甲은 현주건조물방화치사죄가 성립한다. \n" +
                    "\n㉢甲은 현주건조물에 방화를 한 후 불이 붙은 집에서 빠져 나오려는 乙이 탈출하지 못하도록 방문 앞에 버티어 서서 지킨 결과 乙을 소사케 한 경우, 甲은 현주건조물방화죄와 살인죄의 실체적 경합이 성립한다.  \n" +
                    "\n㉣甲이 乙의 재물을 강취한 뒤 乙을 살해할 의사로 乙의 집에 방화하여 乙을 살해한 행위는 강도살인죄와 현주건조물방화치사죄의 실체적 경합이 성립한다.  ",
            "4. " +
                    "위법성조각사유에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함) ",
            "5. " +
                    "미수에 대한 설명 중 옳은 것을 모두 고른 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n·㉠甲은 乙과 합동하여 피해자를 텐트 안으로 끌고 간 후 甲, 乙 순으로 성관계를 하기로 하고 乙은 위 텐트 밖으로 나와 주변에서 망을 보고 甲은 피해자의 옷을 모두 벗기고 피해자의 반항을 억압한 후 피해자를 1회 간음하여 강간하고, 이어 乙이 위 텐트 안으로 들어가 피해자를 강간하려 하였으나 피해자가 반항을 하며 강간을 하지 말아 달라고 사정을 하여 강간을 하지 않았다면 乙에 대하여는 중지미수가 인정된다. \n" +
                    "\n㉡피고인이 장롱 안에 있는 옷가지에 불을 놓아 건물을 소훼하려 하였으나 불길이 치솟는 것을 보고 겁이 나서 물을 부어 불을 끈 것이라면 중지미수라고 볼 수 없다.\n" +
                    "\n㉢실행의 수단 또는 대상의 착오로 인하여 결과의 발생이 불가능하더라도 위험성이 있는 때에는 처벌한다. 단, 형을 감경 또는 면제한다.\n" +
                    "\n㉣필로폰을 매수하려는 자에게서 필로폰을 구해 달라는 부탁과 함께 돈을 지급받았다고 하더라도, 당시 필로폰을 소지 또는 입수한 상태에 있었거나 그것이 가능하였다는 등 매매행위에 근접·밀착한 상태에서 대금을 지급받은 것이 아니라 단순히 필로폰을 구해 달라는 부탁과 함께 대금 명목으로 돈을 지급받은 것에 불과한 경우에는 필로폰 매매행위의 실행의 착수에 이른 것으로 볼 수 없다. " ,





            "6. " +
                    "실행의 착수시기 또는 기수에 대한 설명 중 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",

            "7. " +
                    "간접정범에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)" ,
            "8. " +
                    "공범과 신분에 대한 설명으로 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",
            "9. " +
                    "죄수에 대한 설명으로 옳은 것을 모두 고른 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n ㉠피고인이 강취한 현금카드를 사용하여 현금자동지급기에서 현금을 인출한 행위는 강도죄와는 별도로 절도죄가 성립한다.\n" +
                    "\n㉡열차승차권을 절취한 자가 역직원에게 자기의 소유인 양 속여 현금과 교환한 경우에 절도죄 외에 사기죄가 성립한다.\n" +
                    "\n㉢전기통신금융사기(이른바 보이스피싱 범죄)의 범인이 피해자를 기망하여 피해자의 자금을 사기이용계좌로 송금·이체받은 후 사기이용계좌에서 현금을 인출한 행위는 사기의 피해자에 대하여 별도의 횡령죄를 구성한다.\n" +
                    "\n㉣乙 종중으로부터 토지를 명의신탁받아 보관 중이던 甲이 개인 채무 변제에 사용할 목적으로 위 토지에 근저당권을 설정한 후에 다시 위 토지를 丙에게 매도한 경우, 甲의 토지 매도행위는 별도의 횡령죄를 구성한다",
            "10. " +
                    "선고유예제도에 대한 설명으로 옳은 것을 모두 고른 것은?(다툼이 있는 경우 판례에 의함)" +
                    " \n\n\n㉠선고유예는 집행유예와 마찬가지로 법원이 유예기간을 정하여야 한다.\n" +
                    "\n\n㉡주형에 대하여 선고를 유예하는 경우에는 그 부가할 몰수 추징에 대하여도 선고를 유예할 수 있으나, 그 주형에 대하여 선고를 유예하지 아니하면서 이에 부가할 몰수 추징에 대하여서만 선고를 유예할 수는 없다.\n" +
                    "\n\n㉢ 피고인이 범죄사실을 자백하지 않고 부인한 경우에는 선고유예의 요건 중 ‘개전의 정상이 현저한 때’에 해당하지 않으므로 언제나 선고유예를 할 수 없다.\n" +
                    "\n\n㉣선고유예의 실효사유인 ‘형의 선고유예를 받은 자가 자격정지 이상의 형에 처한 전과가 발견된 때’란 형의 선고유예의 판결이 확정된 후에 전과가 발견된 경우를 말한다. " ,





            "11." +
                    "협박죄에 대한 설명 중 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",
            "12." +
                    "명예훼손죄에 대한 설명 중 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",
            "13. " +
                    "친족상도례에 대한 설명 중 옳고 그름의 표시(O, X)가 바르게 된 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n ㉠사돈지간인 자를 기망하여 재물을 편취한 경우에는 친족상도례가 적용된다.\n" +
                    "\n㉡법원을 기망하여 제3자로부터 재물을 편취한 경우에 피해자인 제3자와 사기죄를 범한 자가 직계혈족 관계에 있을 때에는 그 범인에 대하여 형을 면제하여야 한다. \n" +
                    "\n㉢횡령범인이 위탁자가 소유자를 위해 보관하고 있는 물건을 위탁자로부터 보관받아 이를 횡령한 경우에 횡령범인이 피해물건의 소유자와는 친족관계가 있으나 피해물건의 위탁자와는 친족관계가 없다면 친족상도례 규정이 적용되지 않는다.\n" +
                    "\n㉣손자가 할아버지 소유의 농업협동조합 예금통장을 절취하여 이를 현금자동지급기에 넣고 조작하는 방법으로 예금 잔고를 자신의 거래 은행계좌로 이체한 경우에 컴퓨터 등 사용사기죄는 친족간의 범행에 해당하여 친족상도례가 적용된다.",
            "14. " +
                    "횡령의 죄에 대한 설명 중 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",
            "15" +
                    "배임의 죄에 대한 설명 중 옳고 그름의 표시(O, X)가 바르게 된 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n㉠자기소유의 동산에 대해 매수인과 매매계약을 체결한 매도인이 중도금까지 지급받은 상태에서 그 목적물을 제3자에 대한 자기의 채무변제에 갈음하여 그 제3자에게 양도해 버린 경우에는 기존 매수인에 대한 배임죄가 성립한다.\n" +
                    "\n㉡금융기관의 임직원이 보통예금계좌에 입금된 예금주의 예금을 무단으로 인출한 경우에 그 임직원은 예금주와의 사이에서 그의 재산관리에 관한 사무를 처리하는 자의 지위에 있다고 할 것이므로, 그러한 예금인출행위는 예금주에 대한 관계에서 업무상배임죄를 구성한다. \n" +
                    "\n㉢피고인이 자신의 모(母) 명의를 빌려 자동차를 매수하면서 피해자 甲 주식회사에서 필요한 자금을 대출받고 자동차에 저당권을 설정하였는데, 저당권자인 甲 회사의 동의 없이 이를 성명불상의 제3자에게 양도담보로 제공하였다면 피고인의 행위는 적어도 미필적으로나마 甲 회사의 자동차에 대한 추급권 행사가 불가능하게 될 수 있음을 알면서도 그 담보가치를 실질적으로 상실시키는 것으로서 배임죄가 성립되는 특별한 사정이 있는 경우에 해당한다.\n" +
                    "\n㉣배임죄에 있어서 타인의 사무를 처리하는 자라 함은 양자간의 신임관계에 기초를 둔 타인의 재산보호 내지 관리의무가 있음을 그 본질적 내용으로 하는 것이므로, 배임죄의 성립에 있어 행위자가 대외관계에서 타인의 재산을 처분할 적법한 대리권이 있음을 요하지 아니한다.",

            "16. " +
                    "가증권에 관한 죄에 대한 설명 중 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",
            "17. " +
                    "문서에 관한 죄에 대한 설명 중 옳고 그름의 표시(O, X)가 바르게 된 것은?(다툼이 있는 경우 판례에 의함)" +
                    "\n\n\n ㉠타인 명의의 문서를 위조하여 행사하였다고 하더라도 그 명의인이 실재하지 않는 허무인이거나 또는 문서의 작성일자 전에 이미 사망한 경우에는 사문서위조죄 및 동행사죄가 성립하지 않는다.\n" +
                    "\n㉡법원이 이혼의사확인서등본 뒤에 이혼신고서를 첨부하고 간인하여 교부하였는데 당사자가 이혼의사확인서등본과 간인으로 연결된 이혼신고서를 떼어내고 원래 이혼신고서의 내용과는 다른 이혼신고서를 작성하여 이혼의사확인서등본과 함께 호적관서에 제출한 경우, 공문서변조 및 변조공문서행사죄가 성립하지 않는다. \n " +
                    "\n㉢다른 공무원 등이 작성권자의 결재를 받지 않고 직인 등을 보관하는 담당자를 기망하여 작성권자의 직인을 날인하도록 하여 공문서를 완성한 때에는 공문서위조죄가 성립한다.\n" +
                    "\n㉣주식회사의 지배인이 자신을 그 회사의 대표이사로 표시하여 연대보증채무를 부담하는 취지의 회사 명의의 차용증을 작성·교부한 경우, 그 문서에 일부 허위 내용이 포함되거나 위 연대보증행위가 회사의 이익에 반하는 것이더라도 사문서위조 및 위조사문서행사에 해당하지 않는다.",
            "18. " +
                    "뇌물의 죄에 대한 설명 중 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",
            "19. " +
                    "공무방해에 관한 죄에 대한 설명 중 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",
            "20. " +
                    "위증의 죄 및 무고의 죄에 대한 설명 중 가장 적절하지 않은 것은?(다툼이 있는 경우 판례에 의함)",


    };





    public  static String mChoices [][] = {


         //1~5

            {"행위 당시의 판례에 의하면 처벌대상이 되지 아니하는 것으로 해석되었던 행위를 재판 시에 해석을 달리하여 처벌하는 것은 형벌불소급의 원칙에 반한다.",
                    "｢공직선거법｣ 제262조의 ‘자수’를 통상 관용적으로 사용되는 용례와는 달리 범행발각 전에 자수한 경우로 한정하여 해석하여도 유추해석금지의 원칙에 위반되지 않는다.",
                    "약국 개설자가 아니면 의약품을 판매하거나 판매 목적으로 취득할 수 없다\uDB82\uDC53고 규정한 구 ｢약사법｣ 제44조 제1항의 ‘판매’에 무상으로 의약품을 양도하는 ‘수여’를 포함시키는 해석은 죄형법정주의에 위배된다.",
                    "｢항공보안법｣ 제42조(항공기 항로 변경죄)의 ‘항로’에 항공기가 지상에서 이동하는 경로도 포함된다고 해석하는 것은 죄형법정주의에 반한다."},




            {"작위의무는 법적인 의무이어야 하므로 단순한 도덕상 또는 종교상의 의무는 포함되지 않으나 작위의무가 법적인 의무인 한 성문법이건 불문법이건 상관이 없고 또 공법이건 사법이건 불문하므로, 법령, 법률행위, 선행행위로 인한 경우는 물론이고 기타 신의성실의 원칙이나 사회 상규 혹은 조리상 작위의무가 기대되는 경우에도 법적인 작위의무는 있다.",
                    "보호자가 의학적 권고에도 불구하고 치료를 요하는 환자의 퇴원을 간청하여 담당 전문의와 주치의가 치료중단 및 퇴원을 허용하는 조치를 취함으로써 환자를 사망에 이르게 한 경우, 담당 전문의와 주치의의 행위는 부작위에 의한 살인방조죄가 성립한다.",
                    "부작위범 사이의 공동정범은 다수의 부작위범에게 공통된 의무가 부여되어 있고 그 의무를 공통으로 이행할 수 있을 때에만 성립한다.",
                    "부진정 부작위범의 고의는 반드시 구성요건적 결과발생에 대한 목적이나 계획적인 범행의도가 있어야 하는 것은 아니고 법익침해의 결과발생을 방지할 법적 작위의무를 가지고 있는 자가 그 의무를 이행함으로써 그 결과발생을 쉽게 방지할 수 있었음을 예견하고도 결과의 발생을 용인하고 이를 방관한 채 그 의무를 이행하지 아니한다는 인식을 하면 족하며, 이러한 작위의무자의 예견 또는 인식 등은 확정적인 것은 물론 불확정적인 것이라도 미필적 고의로 인정될 수 있다."},


            {"㉠(O)        ㉡(O)        ㉢(O)        ㉣(O)",
                    "㉠(X)        ㉡(X)        ㉢(X)        ㉣(O)",
                    "㉠(O)        ㉡(X)        ㉢(X)        ㉣(X)",
                    "㉠(O)        ㉡(O)        ㉢(O)        ㉣(X)"},


            {"정당방위의 성립요건으로서의 방어행위에는 순수한 수비적 방어뿐 아니라 적극적 반격을 포함하는 반격방어의 형태도 포함되나, 그 방어행위는 자기 또는 타인의 법익침해를 방위하기 위한 행위로서 상당한 이유가 있어야 한다.",
                    "신문기자인 피고인이 고소인에게 2회에 걸쳐 증여세 포탈에 대한 취재를 요구하면서 이에 응하지 않으면 자신이 취재한 내용대로 보도하겠다고 말한 것은 정당행위에 해당한다. ",
                    "검사가 참고인 조사를 받는 줄 알고 검찰청에 자진출석한 변호사사무실 사무장을 합리적 근거 없이 긴급체포하자 그 변호사가 이를 제지하는 과정에서 위 검사에게 상해를 가한 것은 정당방위에 해당한다. ",
                    "국회의원인 피고인이, 구 국가안전기획부 내 정보수집팀이 대기업 고위관계자와 중앙일간지 사주 간의 사적 대화를 불법 녹음한 자료를 입수한 후 그 대화내용과 위 대기업으로부터 이른바 떡값 명목의 금품을 수수하였다는 검사들의 실명이 게재된 보도자료를 작성하여 자신의 인터넷 홈페이지에 게재한 경우에는 정당행위에 해당한다."},


            {"㉠㉡",
                    "㉠㉢",
                    "㉡㉣",
                    "㉢㉣"},




      //6~10

            {"위장결혼의 당사자 및 중국 측 브로커와의 공모 하에 허위로 결혼사진을 찍고, 혼인신고에 필요한 서류를 준비하여 위장결혼의 당사자에게 건네준 것만으로는 아직 공전자기록등불실기재죄에 있어서 실행에 착수한 것으로 볼 수 없다.",
                    "피고인이 방화의 의사로 뿌린 휘발유가 인화성이 강한 상태로 주택 주변과 피해자의 몸에 적지 않게 살포되어 있는 사정을 알면서도 라이터를 켜 불꽃을 일으킴으로써 피해자의 몸에 불이 붙은 경우, 비록 외부적 사정에 의하여 불이 방화 목적물인 주택 자체에 옮겨 붙지는 아니하였다 하더라도 현존건조물방화죄의 실행의 착수가 있었다고 볼 수 있다.",
                    "금융기관 직원이 전산단말기를 이용하여 다른 공범들이 지정한 특정계좌에 돈이 입금된 것처럼 허위의 정보를 입력하는 방법으로 위 계좌로 입금되도록 한 경우, 그 후 그러한 입금이 취소되어 현실적으로 인출되지 못하였다면 컴퓨터 등 사용사기죄의 미수에 해당한다.",
                    "피고인이 지하철 환승에스컬레이터 내에서 짧은 치마를 입고 있는 피해자의 뒤에 서서 카메라폰으로 성적 수치심을 느낄 수 있는 치마 속 신체 부위를 피해자 의사에 반하여 동영상 촬영 중 경찰관에게 발각되어 저장버튼을 누르지 않고 촬영을 종료하였더라도 동영상 촬영을 시작하여 일정한 시간이 경과하였다면 구 ｢성폭력범죄의 처벌 및 피해자보호 등에 관한 법률｣상 ‘카메라 등 이용 촬영죄’의 기수에 해당한다. "},


            {"인신구속에 관한 직무를 행하는 자 또는 이를 보조하는 자가 피해자를 구속하기 위하여 진술조서 등을 허위로 작성한 후 이를 기록에 첨부하여 구속영장을 신청하고, 진술조서 등이 허위로 작성된 정을 모르는 검사와 영장전담판사를 기망하여 구속영장을 발부받은 후 그 영장에 의하여 피해자를 구금하였다면 직권남용감금죄가 성립한다.",
                    "공무원 아닌 자가 관공서에 허위 내용의 증명원을 제출하여 그 내용이 허위인 정을 모르는 담당공무원으로부터 그 증명원 내용과 같은 증명서를 발급받은 경우, 공문서위조죄의 간접정범이 성립한다.",
                    "범죄는 ‘어느 행위로 인하여 처벌되지 아니하는 자’를 이용하여서도 이를 실행할 수 있으므로, 내란죄의 경우에도 ‘국헌문란의 목적’을 가진 자가 그러한 목적이 없는 자를 이용하여 이를 실행할 수 있다.",
                    "신용카드를 제시받은 상점점원이 그 카드의 금액란을 정정기재하였다 하더라도 그것이 카드소지인이 위 점원에게 자신이 위 금액을 정정기재할 수 있는 권리가 있는 양 기망하여 이루어졌다면 이는 간접정범에 의한 유가증권변조죄가 성립한다."},


            {"업무상 타인의 사무를 처리하는 자가 그러한 신분관계가 없는 자와 공모하여 업무상배임죄를 저질렀다면 그러한 신분관계가 없는 자에 대하여는 ｢형법｣ 제33조 단서에 의하여 단순배임죄가 성립한다.",
                    "｢공직선거법｣에서 규정하는 각 기부행위제한 위반죄의 주체 및 각 기부행위의 주체로 인정되지 아니하는 자가 주체자 등과 공모하여 기부행위를 한 경우, 주체자에 해당하는 법조 위반죄의 공동정범으로 처벌할 수 없다.",
                    "의료인일지라도 의료인 아닌 자의 의료행위에 공모하여 가공하면｢의료법｣상 무면허의료행위의 공동정범으로서의 책임을 진다.",
                    "도박의 습벽이 있는 자가 도박의 습벽이 없는 타인의 도박을 방조하면 상습도박방조의 죄가 성립한다. "},


            {"㉠㉡",
                    "㉡㉢",
                    "㉠㉣",
                    "㉢㉣"},


            {"㉠㉡",
                    "㉡㉣",
                    "㉠㉢",
                    "㉢㉣"},


            //11~15


            {"협박죄는 자연인만을 그 대상으로 예정하고 있을 뿐 법인은 협박죄의 객체가 될 수 없다.",
                    "협박죄의 미수범 처벌조항은 해악의 고지가 현실적으로 상대방에게 도달하지 아니한 경우나, 도달은 하였으나 상대방이 이를 지각하지 못하였거나 고지된 해악의 의미를 인식하지 못한 경우 등에 적용될 뿐이다.",
                    "피고인이 혼자 술을 마시던 중 甲 정당이 국회에서 예산안을 강행처리하였다는 것에 화가 나서 공중전화를 이용하여 경찰서에 여러 차례 전화를 걸어 전화를 받은 각 경찰관에게 경찰서 관할구역 내에 있는 甲 정당의 당사를 폭파하겠다는 말을 한 경우, 피고인의 행위는 각 경찰관에 대한 협박죄를 구성한다.피고인이 혼자 술을 마시던 중 甲 정당이 국회에서 예산안을 강행처리하였다는 것에 화가 나서 공중전화를 이용하여 경찰서에 여러 차례 전화를 걸어 전화를 받은 각 경찰관에게 경찰서 관할구역 내에 있는 甲 정당의 당사를 폭파하겠다는 말을 한 경우, 피고인의 행위는 각 경찰관에 대한 협박죄를 구성한다.",
                    "피해자 본인이나 그 친족뿐만 아니라 그 밖의 제3자에 대한 법익 침해를 내용으로 하는 해악을 고지하는 것이라고 하더라도 피해자 본인과 제3자가 밀접한 관계에 있어 그 해악의 내용이 피해자 본인에게 공포심을 일으킬 만한 정도의 것이라면 협박죄가 성립할 수 있다. 이 때 제3자에는 자연인뿐만 아니라 법인도 포함된다."},

            {"개인 블로그의 비공개 대화방에서 상대방으로부터 비밀을 지키겠다는 말을 듣고 일대일로 대화하였다고 하더라도, 그 사정만으로 대화 상대방이 대화내용을 불특정 또는 다수에게 전파할 가능성이 없다고 할 수 없으므로 공연성을 인정할 여지가 있다.",
                    "전국교직원노동조합 소속 교사가 작성·배포한 보도자료가 전체적으로 그 기재 내용이 진실하고 공공의 이익을 위한 것이라도 보도자료의 일부에 사실과 다른 기재가 있으면 명예훼손죄의 위법성이 조각되지 않는다.",
                    "기자를 통해 사실을 적시하는 경우에는 기사화되어 보도되어야만 적시된 사실이 외부에 공표된다고 보아야 할 것이므로 기자가 취재를 한 상태에서 아직 기사화하여 보도하지 아니한 경우에는 공연성이 없다.",
                    "명예훼손죄가 성립하기 위하여는 사실의 적시가 있어야 하는데, 여기에서 적시의 대상이 되는 사실이란 현실적으로 발생하고 증명할 수 있는 과거 또는 현재의 사실을 말하며, 장래의 일을 적시하더라도 그것이 과거 또는 현재의 사실을 기초로 하거나 이에 대한 주장을 포함하는 경우에는 명예훼손죄가 성립한다."},

            {"㉠(X)       ㉡(O)          ㉢(O)          ㉣(X)",
                    "㉠(X)       ㉡(X)          ㉢(O)          ㉣(X)",
                    "㉠(O)       ㉡(X)          ㉢(X)          ㉣(O)",
                    "㉠(X)       ㉡(O)          ㉢(X)          ㉣(X)"},


            {"부동산을 공동으로 상속한 자들 중 1인이 상속 부동산을 혼자 점유하던 중 다른 공동상속인의 상속지분을 임의로 처분하여도 횡령죄가 성립하지 아니한다.",
                    "주상복합상가의 매수인들로부터 우수상인 유치비 명목으로 금원을 납부받아 보관하던 중 그 용도와 무관하게 일반경비로 사용한 경우 횡령죄가 성립한다.",
                    "甲 주식회사 대표이사인 피고인이 자신의 채권자 乙에게 차용금에 대한 담보로 甲 회사 명의 정기예금에 질권을 설정하여 주었는데, 그 후 乙이 차용금과 정기예금의 변제기가 모두 도래한 이후 피고인의 동의하에 정기예금 계좌에 입금되어 있던 甲 회사 자금을 전액 인출하였다면 피고인의 행위는 배임죄와 별도로 횡령죄까지 성립한다.",
                    "명의신탁자가 매수한 부동산에 관하여 ｢부동산 실권리자명의 등기에 관한 법률｣을 위반하여 명의수탁자와 맺은 명의신탁약정에 따라 매도인에게서 바로 명의수탁자 명의로 소유권이전등기를 마친 이른바 중간생략등기형 명의신탁을 한 경우, 명의수탁자가 신탁받은 부동산을 임의로 처분하여도 명의신탁자에 대한 관계에서 횡령죄가 성립하지 아니한다."},

            {"㉠(X)      ㉡(O)          ㉢(O)          ㉣(X)",
                    "㉠(X)      ㉡(X)          ㉢(O)          ㉣(O)",
                    "㉠(O)      ㉡(O)          ㉢(X)          ㉣(X)",
                    "㉠(X)      ㉡(X)          ㉢(X)          ㉣(O)"},

            //16~20

            {"자기앞수표의 발행인이 수표의뢰인으로부터 수표자금을 입금받지 아니한 채 자기앞수표를 발행한 경우에는 허위유가증권작성죄가 성립한다.",
                    "｢형법｣ 제214조의 유가증권이 되기 위해서는 재산권이 증권에 화체된다는 것과 그 권리의 행사와 처분에 증권의 점유를 필요로 한다는 두 가지 요소를 갖추면 족하지 반드시 유통성을 가질 필요는 없다.",
                    "이미 타인에 의하여 위조된 약속어음의 기재사항을 권한 없이 변경하였다고 하더라도 유가증권변조죄는 성립하지 않는다.",
                    "타인이 위조한 액면과 지급기일이 백지로 된 약속어음을 구입하여 행사의 목적으로 백지인 액면란에 금액을 기입하여 그 위조어음을 완성하는 행위는 백지어음 형태의 위조행위와 별개의 유가증권위조죄를 구성한다."},


            {"㉠(O)      ㉡(O)          ㉢(O)          ㉣(O)",
                    "㉠(O)      ㉡(X)          ㉢(O)          ㉣(X)",
                    "㉠(X)      ㉡(O)          ㉢(X)          ㉣(O)",
                    "㉠(X)      ㉡(O)          ㉢(O)          ㉣(O)"},


            {"뇌물죄에서 뇌물의 내용인 이익이라 함은 금전, 물품 기타의 재산적 이익뿐만 아니라 사람의 수요․욕망을 충족시키기에 족한 일체의 유형·무형의 이익을 포함하며, 제공된 것이 성적 욕구의 충족이라고 하여 달리 볼 것이 아니다.",
                    "구 해양수산부 해운정책과 소속 공무원인 피고인이 甲 해운회사의 대표이사 등에게서 중국의 선박운항허가 담당부서가 관장하는 중국 국적선사의 선박에 대한 운항허가를 받을 수 있도록 노력해 달라는 부탁을 받고 돈을 받은 경우, 뇌물수수죄가 성립한다.",
                    "음주운전을 적발하여 단속에 관련된 제반 서류를 작성한 후 운전면허 취소업무를 담당하는 직원에게 이를 인계하는 업무를 담당하는 경찰관이 피단속자로부터 운전면허가 취소되지 않도록 하여 달라는 청탁을 받고 금원을 교부받은 경우, 뇌물수수죄가 성립한다.",
                    "임용될 당시 공무원법상 임용결격자에 해당하여 임용행위는 무효였지만 그 후 공무원으로 계속 근무하면서 직무에 관하여 뇌물을 수수한 경우, 수뢰죄가 성립한다."},


            {"동일한 공무를 집행하는 여럿의 공무원에 대하여 폭행·협박 행위를 한 경우에는 공무를 집행하는 공무원의 수에 따라 여럿의 공무집행방해죄가 성립하고, 위와 같은 폭행·협박 행위가 동일한 장소에서 동일한 기회에 이루어진 것으로서 사회관념상 1개의 행위로 평가되는 경우에는 여럿의 공무집행방해죄는 상상적 경합의 관계에 있다.",
                    "불법주차 차량에 불법주차 스티커를 붙였다가 이를 다시 떼어 낸 직후에 있는 주차단속 공무원을 폭행한 경우, 공무집행방해죄가 성립한다.",
                    "음주운전을 하다가 교통사고를 야기한 후 그 형사처벌을 면하기 위하여 타인의 혈액을 자신의 혈액인 것처럼 교통사고 조사 경찰관에게 제출하여 감정하도록 한 경우, 위계에 의한 공무집행방해죄가 성립하지 않는다.",
                    "변호사가 접견을 핑계로 수용자를 위하여 휴대전화와 증권거래용 단말기를 구치소 내로 몰래 반입하여 이용하게 한 행위는 위계에 의한 공무집행방해죄에 해당한다.\n"},


            {"｢헌법｣ 제12조 제2항에 정한 불이익 진술의 강요금지 원칙을 구체화한 자기부죄거부특권에 관한 것이거나 기타 증언거부사유가 있음에도 증인이 증언거부권을 고지받지 못함으로 인하여 그 증언거부권을 행사하는 데 사실상 장애가 초래되었다고 볼 수 있는 경우에는 증언거부권자가 위증을 하였을지라도 위증죄가 성립하지 않는다.",
                    "위증죄를 범한 자가 그 공술한 사건의 재판 또는 징계처분이 확정되기 전에 자백 또는 자수한 때에는 그 형을 감경 또는 면제한다.",
                    "무고죄에 있어 신고한 사실이 객관적 사실에 반하는 허위사실이라는 요건은 신고사실의 진실성을 인정할 수 없다는 소극적 증명만으로 충분하다.",
                    "피고인이 사립대학교 교수인 甲, 乙로 하여금 징계처분을 받게 할 목적으로 국민권익위원회에서 운영하는 범정부 국민포털인 국민신문고에 민원을 제기한 경우, 무고죄가 성립하지 않는다."},





    };


    public static String mCorrectAnswers[] =
            {"｢항공보안법｣ 제42조(항공기 항로 변경죄)의 ‘항로’에 항공기가 지상에서 이동하는 경로도 포함된다고 해석하는 것은 죄형법정주의에 반한다.",
            "보호자가 의학적 권고에도 불구하고 치료를 요하는 환자의 퇴원을 간청하여 담당 전문의와 주치의가 치료중단 및 퇴원을 허용하는 조치를 취함으로써 환자를 사망에 이르게 한 경우, 담당 전문의와 주치의의 행위는 부작위에 의한 살인방조죄가 성립한다.",
            "㉠(O)        ㉡(O)        ㉢(O)        ㉣(X)",
            "국회의원인 피고인이, 구 국가안전기획부 내 정보수집팀이 대기업 고위관계자와 중앙일간지 사주 간의 사적 대화를 불법 녹음한 자료를 입수한 후 그 대화내용과 위 대기업으로부터 이른바 떡값 명목의 금품을 수수하였다는 검사들의 실명이 게재된 보도자료를 작성하여 자신의 인터넷 홈페이지에 게재한 경우에는 정당행위에 해당한다.",
            "㉡㉣",


            "금융기관 직원이 전산단말기를 이용하여 다른 공범들이 지정한 특정계좌에 돈이 입금된 것처럼 허위의 정보를 입력하는 방법으로 위 계좌로 입금되도록 한 경우, 그 후 그러한 입금이 취소되어 현실적으로 인출되지 못하였다면 컴퓨터 등 사용사기죄의 미수에 해당한다.",
            "공무원 아닌 자가 관공서에 허위 내용의 증명원을 제출하여 그 내용이 허위인 정을 모르는 담당공무원으로부터 그 증명원 내용과 같은 증명서를 발급받은 경우, 공문서위조죄의 간접정범이 성립한다.",
            "업무상 타인의 사무를 처리하는 자가 그러한 신분관계가 없는 자와 공모하여 업무상배임죄를 저질렀다면 그러한 신분관계가 없는 자에 대하여는 ｢형법｣ 제33조 단서에 의하여 단순배임죄가 성립한다.",
            "㉠㉣",
            "㉡㉣",

                    "피고인이 혼자 술을 마시던 중 甲 정당이 국회에서 예산안을 강행처리하였다는 것에 화가 나서 공중전화를 이용하여 경찰서에 여러 차례 전화를 걸어 전화를 받은 각 경찰관에게 경찰서 관할구역 내에 있는 甲 정당의 당사를 폭파하겠다는 말을 한 경우, 피고인의 행위는 각 경찰관에 대한 협박죄를 구성한다.피고인이 혼자 술을 마시던 중 甲 정당이 국회에서 예산안을 강행처리하였다는 것에 화가 나서 공중전화를 이용하여 경찰서에 여러 차례 전화를 걸어 전화를 받은 각 경찰관에게 경찰서 관할구역 내에 있는 甲 정당의 당사를 폭파하겠다는 말을 한 경우, 피고인의 행위는 각 경찰관에 대한 협박죄를 구성한다.",
                    "전국교직원노동조합 소속 교사가 작성·배포한 보도자료가 전체적으로 그 기재 내용이 진실하고 공공의 이익을 위한 것이라도 보도자료의 일부에 사실과 다른 기재가 있으면 명예훼손죄의 위법성이 조각되지 않는다.",
                    "㉠(X)       ㉡(O)          ㉢(O)          ㉣(X)",
                    "甲 주식회사 대표이사인 피고인이 자신의 채권자 乙에게 차용금에 대한 담보로 甲 회사 명의 정기예금에 질권을 설정하여 주었는데, 그 후 乙이 차용금과 정기예금의 변제기가 모두 도래한 이후 피고인의 동의하에 정기예금 계좌에 입금되어 있던 甲 회사 자금을 전액 인출하였다면 피고인의 행위는 배임죄와 별도로 횡령죄까지 성립한다.",
                    "㉠(X)      ㉡(X)          ㉢(O)          ㉣(O)",

                    "자기앞수표의 발행인이 수표의뢰인으로부터 수표자금을 입금받지 아니한 채 자기앞수표를 발행한 경우에는 허위유가증권작성죄가 성립한다.",
                    "㉠(X)      ㉡(O)          ㉢(O)          ㉣(O)",
                    "구 해양수산부 해운정책과 소속 공무원인 피고인이 甲 해운회사의 대표이사 등에게서 중국의 선박운항허가 담당부서가 관장하는 중국 국적선사의 선박에 대한 운항허가를 받을 수 있도록 노력해 달라는 부탁을 받고 돈을 받은 경우, 뇌물수수죄가 성립한다.",
                    "음주운전을 하다가 교통사고를 야기한 후 그 형사처벌을 면하기 위하여 타인의 혈액을 자신의 혈액인 것처럼 교통사고 조사 경찰관에게 제출하여 감정하도록 한 경우, 위계에 의한 공무집행방해죄가 성립하지 않는다.",
                    "무고죄에 있어 신고한 사실이 객관적 사실에 반하는 허위사실이라는 요건은 신고사실의 진실성을 인정할 수 없다는 소극적 증명만으로 충분하다.",
    };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


