package com.perfect.admin.police1;


public class QuestionLibrary2016_5 {

    //2018 3월 24일  경찰 경찰학개론


    public   static  String mQuestions [] = {



            "1." +
                    "다음 중 경찰의 권한과 책임의 소재에 따라 구분한 것으로 가장 적절한 것은?",


            "2." +
                    "다음의 내용이 설명하는 경찰의 부정부패이론으로 가장 적절한 것은?" +
                    "\n\n\n 부정부패의 원인은 자질이 없는 경찰관들이 모집단계에서 배제되지 못하고 조직 내에 유입됨으로써 전체경찰이 부패할 가능성이 있다고 보면서, 부정부패의 원인을 조직의 체계보다는 개인적 결함으로 보고 있다.",



            "3." +
                    "「경찰법」상 지방경찰에 관한 설명으로 가장 적절하지 않은 것은?",


            "4. " +
                    "경찰공무원법」상 경찰공무원의 임용결격사유에 관한 설명으로 옳은 것은 모두 몇 개인가?" +
                    "\n\n\n ㉠ 피성년후견인 또는 피한정후견인 \n" +
                    "\n㉡ 파산선고를 받고 복권되지 아니한 사람\n" +
                    "\n㉢ 자격정지 이상의 형을 선고받은 사람\n" +
                    "\n㉣ 자격정지 이상의 형의 선고유예를 선고받고 그 유예기간 중에 있는 사람\n" +
                    "㉤징계에 의하여 파면 또는 해임처분을 받은 사람",





            "5. " +
                    "「경찰공무원법」상 징계에 관한 다음 설명 중 가장 적절하지  않은 것은?",





            "6. " +
                    "「국가공무원법」상 공무원의 복무에 관한 다음 설명 중 가장 적절하지 않은 것은?",



            "7. " +
                    "「경찰관 직무집행법」상 경찰장비에 관한 다음 설명 중 가장 적절하지 않은 것은?" ,





            "8. " +
                    "「위해성 경찰장비의 사용기준 등에 관한 규정」에 대한 설명으로 가장 적절하지 않은 것은?",




            "9. " +
                    "「보안업무규정」상 비밀보호에 관한 설명으로 틀린 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 각급기관의 장은 비밀의 분류·취급·유통 및 이관 등의 모든 과정에서 비밀이 누설되거나 유출되지 아니하도록 보안대책을 수립하여 시행하여야 한다.\n" +
                    "\n㉡ 비밀은 해당 등급의 비밀취급 인가를 받은 사람만 취급할 수 있다.\n" +
                    "\n㉢ 비밀은 적절히 보호할 수 있는 최고등급으로 분류하되, 과도하거나 과소하게 분류해서는 아니 된다.\n" +
                    "\n㉣ 비밀은 그 자체의 내용과 가치의 정도에 따라 분류하여야 하며, 다른 비밀과 관련해서 분류해서는 아니 된다.\n" +
                    "\n㉤ 경찰청장은 Ⅱ급 및 Ⅲ급비밀 취급 인가권자이다.",



            "10. " +
                    "「공공기관의 정보공개에 관한 법률」상 불복절차에 관한 다음 설명 중 가장 적절하지 않은 것은?",





            "11." +
                    "「경비업법」상 경비업무의 종류에 대한 정의로 가장 적절하지 않은 것은?",




            "12." +
                    "「가정폭력범죄의 처벌 등에 관한 특례법」상 가정폭력 범죄에 해당하는 것은 모두 몇 개인가?" +
                    "\n\n\n ㉠ 살인  ㉡ 폭행  ㉢ 중상해  ㉣ 영아유기  ㉤ 특수공갈",




            "13. " +
                    "범죄첩보는 수사첩보의 한 내용으로서 범죄수사상 참고가 될 만한 제반사항을 의미하는 것으로 수사의 단서가 될 수 있는 것은 물론 범죄로의 이행이 예상되는 사안이나 이미 발생한 범죄에 관한 사항 등이 모두 대상이 된다. 다음 중 범죄첩보의 특징을 설명한 것으로 가장 적절하지 않은 것은?",




            "14. " +
                    "「통합방위법」상 국가중요시설에 관한 다음 설명 중 가장 적절하지 않은 것은?",


            "15." +
                    "「도로교통법」상 주차금지 장소로 옳은 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 소방용 기계·기구가 설치된 곳으로부터 5미터 이내인 곳\n" +
                    "\n㉡ 터널 안 및 다리 위\n" +
                    "\n㉢ 화재경보기로부터 3미터 이내인 곳\n" +
                    "\n㉣도로공사를 하고 있는 경우에는 그 공사구역의 양쪽 가장 자리로부터 5미터 이내인 곳 ",



            "16. " +
                    "「도로교통법」및 동법 시행규칙 상 제1종 보통면허로 운전할 수 있는 것은 모두 몇 개인가?" +
                    "\n\n\n㉠ 승용자동차\n" +
                    "\n㉡ 승차정원 15인 이하의 승합자동차\n" +
                    "\n㉢ 원동기장치자전거\n" +
                    "\n㉣ 총중량 10톤 미만의 특수자동차(트레일러 및 레커를 포함한다)\n" +
                    "\n㉤ 승차정원 12인 이하의 긴급자동차(승용 및 승합자동차에 한정한다)",



            "17. " +
                    "「집회 및 시위에 관한 법률」에서 사용하는 용어의 정의로 가장 적절하지 않은 것은?",





            "18. " +
                    "대상국의 기밀 탐지, 전복, 태업 등을 효과적으로 수행하기 위한 지하조직형태를 간첩망이라 한다. 다음의 내용이 설명하는 간첩망의 형태를 가장 적절하게 나열한 것은?" +
                    "\n\n\n㉠ 지하당 구축에 흔히 사용하는 형태로, 간첩이 3명 이내의 행동공작원을 포섭하여 직접 지휘하고 공작원 간 횡적 연락을 차단시키는 활동조직\n" +
                    "\n㉡ 간첩이 주공작원 2~3명을 두고, 주공작원은 그 밑에 각각 2~3명의 행동공작원을 두는 조직형태\n" +
                    "\n㉢ 합법적 신분을 이용하여 적국의 이념이나 사상에 동조하도록 유도하여 공작목표를 달성하기 위한 조직형태",





            "19. " +
                    "「출입국관리법」및 동법 시행령 상 다음의 내용이 설명하는 외국인의 체류자격으로 가장 적절하게 나열한 것은?" +
                    "\n\n\n㉠ 수익이 따르는 음악, 미술, 문학 등의 예술활동과 수익을 목적으로 하는 연예, 연주, 연극, 운동경기, 광고·패션 모델, 그 밖에 이에 준하는 활동을 하려는 사람\n" +
                    "\n㉡ 법무부장관이 정하는 자격요건을 갖춘 외국인으로서 외국어전문학원, 초등학교 이상의 교육기관 및 부설어학연구소," +
                    " 방송사 및 기업체 부설 어학연수원, 그 밖에 이에 준하는 기관 또는 단체에서 외국어 회화지도에 종사하려는 사람",




            "20. " +
                    "「언론중재 및 피해구제 등에 관한 법률」상 언론중재위원회(이하 “중재위원회”라 한다)의 설치에 관한 내용으로 가장 적절하지 않은 것은?",


    };





    public  static String mChoices [][] = {


            //1

            {"국가경찰과 자치경찰",
                    "예방경찰과 진압경찰",
                    "보안경찰과 협의의 행정경찰",
                    "질서경찰과 봉사경찰"},



            //2

            {"전체사회 가설",
                    "구조원인 가설",
                    "썩은 사과 가설",
                    "미끄러지기 쉬운 경사로 이론"},


            //3

            {"지방경찰청장은 경찰청장의 지휘·감독을 받아 관할구역의 국가 경찰사무를 관장하고 소속 공무원 및 소속 국가경찰기관의 장을 지휘·감독한다.",
                    "지방행정과 치안행정의 업무조정과 그 밖에 필요한 사항을 협의ㆍ조정하기 위하여 시·도지사(제주특별자치도지사는 제외한다) 소속으로 치안행정협의회를 둔다.",
                    "치안행정협의회의 조직·운영과 그 밖에 필요한 사항은 경찰청 훈령으로 정한다.",
                    "경찰서장 소속으로 지구대 또는 파출소를 두고, 그 설치기준은 치안수요·교통·지리 등 관할구역의 특성을 고려하여 행정자치부령으로 정한다."},

            //4

            {"2개",
                    "3개",
                    "4개",
                    "5개"},


            //5

            {"경무관 이상의 경찰공무원에 대한 징계의결은 ｢국가공무원법｣에 따라 국무총리 소속으로 설치된 징계위원회에서 한다.",
                    "총경 이하의 경찰공무원에 대한 징계의결을 하기 위하여 대통령령으로 정하는 경찰기관 및 해양경비안전관서에 경찰공무원 징계위원회를 둔다.",
                    "경찰청 소속 경무관 이상의 강등 및 정직과 경정 이상의 파면 및 해임은 행정자치부장관의 제청으로 국무총리를 거쳐 대통령이 한다.",
                    "국민안전처 소속 경무관 이상의 강등 및 정직과 경정 이상의 파면 및 해임은 국민안전처장관의 제청으로 국무총리를 거쳐 대통령이 한다."},



            //6

            {"공무원은 노동운동이나 그 밖에 공무 외의 일을 위한 집단 행위를 하여서는 아니 된다. 또한, 사실상 노무에 종사하는 공무원도 포함한다.",
                    "공무원이 외국 정부로부터 영예나 증여를 받을 경우에는 대통령의 허가를 받아야 한다.",
                    "공무원은 공무 외에 영리를 목적으로 하는 업무에 종사하지 못하며 소속 기관장의 허가 없이 다른 직무를 겸할 수 없다.",
                    "공무원은 정당이나 그 밖의 정치단체의 결성에 관여하거나 이에 가입할 수 없다."},


            //7

            {"경찰관은 직무수행 중 경찰장비를 사용할 수 있다. 다만, 사람의 생명이나 신체에 위해를 끼칠 수 있는 경찰장비(이하“위해성 경찰장비”라 한다)를 사용할 때에는 필요한 안전교육과 안전검사를 받은 후 사용하여야 한다.",
                    "경찰청장은 위해성 경찰장비를 새로 도입하려는 경우에는 대통령령으로 정하는 바에 따라 안전성 검사를 실시하여 그 안전성 검사의 결과보고서를 국회 소관 상임위원회에 제출하여야 한다. 이 경우 안전성 검사에는 외부 전문가를 참여시킬 수 있다.",
                    "경찰관이 휴대하여 범인 검거와 범죄 진압 등의 직무 수행에 사용하는 수갑, 포승, 경찰봉, 방패는 “경찰장구”에 해당한다.",
                    "경찰관은 현행범이나 사형ㆍ무기 또는 장기 3년 이상의 징역이나 금고에 해당하는 죄를 범한 범인의 체포 또는 도주 방지를 위한 직무를 수행하기 위해서 필요하다고 인정되는 상당한 이유가 있을 때에는 그 사태를 합리적으로 판단하여 필요한 한도에서 경찰장구를 사용할 수 있다."},


            //8

            {"경찰관은 불법집회·시위로 인하여 발생할 수 있는 타인 또는 경찰관의 생명·신체의 위해와 재산·공공시설의 위험을 방지하기 위하여 필요한 때에는 최소한의 범위안에서 경찰봉 또는 호신용경봉을 사용할 수 있다.",
                    "경찰관은 14세 이하의 자 또는 임산부에 대하여 전자충격기 또는 전자방패를 사용하여서는 아니된다.",
                    "경찰관은 전극침 발사장치가 있는 전자충격기를 사용하는 경우 상대방의 얼굴을 향하여 전극침을 발사하여서는 아니된다.",
                    "경찰관은 최루탄발사기로 최루탄을 발사하는 경우 30도 이상의 발사각을 유지하여야 하고, 가스차·살수차 또는 특수진압차의 최루탄발사대로 최루탄을 발사하는 경우에는 15도 이상의 발사각을 유지하여야 한다."},

            //9

            {"1개",
                    "2개",
                    "3개",
                    "4개"},

            //10

            {"공공기관은 이의신청을 받은 날부터 10일 이내에 그 이의신청에 대하여 결정하고 그 결과를 청구인에게 지체 없이 문서로 통지하여야 한다. 다만, 부득이한 사유로 정하여진 기간 이내에 결정할 수 없을 때에는 그 기간이 끝나는 날의 다음 날부터 기산하여 10일의 범위에서 연장할 수 있으며, 연장 사유를 청구인에게 통지하여야 한다.",
                    "청구인이 정보공개와 관련한 공공기관의 결정에 대하여 불복이 있거나 정보공개 청구 후 20일이 경과하도록 정보공개 결정이 없는 때에는 ｢행정심판법｣에서 정하는 바에 따라 행정심판을 청구할 수 있다.",
                    "청구인은 이의신청 절차를 거치지 아니하고 행정심판을 청구할 수 있다.",
                    "청구인이 정보공개와 관련한 공공기관의 결정에 대하여 불복이 있거나 정보공개 청구 후 20일이 경과하도록 정보공개 결정이 없는 때에는 ｢행정소송법｣에서 정하는 바에 따라 행정소송을 제기할 수 있다."},

            //11


            {"특수경비업무 - 공항(항공기를 포함한다) 등 대통령령이 정하는 국가중요시설의 경비 및 도난·화재 그 밖의 위험발생을 방지하는 업무를 말한다.",
                    "기계경비업무 - 경비대상시설에 설치한 기기에 의하여 감지·송신된 정보를 그 경비대상시설내의 장소에 설치한 관제시설의 기기로 수신하여 도난·화재 등 위험 발생을 방지하는 업무를 말한다.",
                    "시설경비업무 - 경비를 필요로 하는 시설 및 장소에서의 도난·화재 그 밖의 혼잡 등으로 인한 위험발생을 방지하는 업무를 말한다.",
                    "신변보호업무 - 사람의 생명이나 신체에 대한 위해의 발생을 방지하고 그 신변을 보호하는 업무를 말한다."},


            //12

            {"1개",
                    "2개",
                    "3개",
                    "4개"},

            //13

            {"결과지향성 - 범죄첩보는 수사 후 현출되는 결과가 있어야 한다.",
                    "혼합성 - 범죄첩보는 그 속에 하나의 원인과 결과가 내포되어 있어야 한다.",
                    "가치변화성 - 범죄첩보는 시간이 경과함에 따라 가치가 감소한다.",
                    "결합성 - 범죄첩보는 여러 첩보가 서로 결합되어 이루어진다."},




            //14

            {"국가중요시설의 관리자(소유자를 포함한다. 이하 같다)는 경비·보안 및 방호책임을 지며, 통합방위사태에 대비하여 자체방호계획을 수립하여야 한다. 이 경우 국가중요시설의 관리자는 자체방호계획을 수립하기 위하여 필요하면 지방경찰청장 또는 지역군사령관에게 협조를 요청할 수 있다.",
                    "지방경찰청장 또는 지역군사령관은 통합방위사태에 대비하여 국가중요시설에 대한 방호지원계획을 수립·시행하여야 한다.",
                    "국가중요시설의 평시 경비·보안활동에 대한 지도·감독은 관계 행정기관의 장과 국가정보원장이 수행한다.",
                    "국가중요시설은 경찰청장이 관계 행정기관의 장 및 국가정보원장과 협의하여 지정한다."},


            //15

            {"1개",
                    "2개",
                    "3개",
                    "4개"},


            //16

            {"2개",
                    "3개",
                    "4개",
                    "5개"},
            //17

            {"“시위”란 여러 사람이 공동의 목적을 가지고 도로, 광장, 공원 등 일반인이 자유로이 통행할 수 있는 장소를 행진하거나 위력 또는 기세를 보여, 불특정한 여러 사람의 의견에 영향을 주거나 제압을 가하는 행위를 말한다.",
                    "“주관자”란 자기 이름으로 자기 책임 아래 집회나 시위를 여는 사람이나 단체를 말한다. 주관자는 주최자를 따로 두어 집회 또는 시위의 실행을 맡아 관리하도록 위임할 수 있다. 이 경우 주최자는 그 위임의 범위 안에서 주관자로 본다.",
                    "“질서유지인”이란 주최자가 자신을 보좌하여 집회 또는 시위의 질서를 유지하게 할 목적으로 임명한 자를 말한다.",
                    "“옥외집회”란 천장이 없거나 사방이 폐쇄되지 아니한 장소에서 여는 집회를 말한다."},



            //18

            {"㉠ 삼각형      ㉡ 피라미드형    ㉢ 서클형",
                    "㉠ 삼각형      ㉡ 피라미드형      ㉢ 레포형",
                    "㉠ 피라미드형  ㉡ 삼각형          ㉢ 서클형",
                    "㉠ 피라미드형  ㉡ 삼각형          ㉢ 레포형"},




            //19

            {"㉠ D-1   ㉡ A-2",
                    "㉠ D-1   ㉡ E-2",
                    "㉠ E-6  ㉡ A-2",
                    "㉠ E-6   ㉡ E-2"},
            //20

            {"중재위원회는 40명 이상 90명 이내의 중재위원으로 구성한다.",
                    "중재위원회에 위원장 1명과 2명 이내의 부위원장 및 2명 이내의 감사를 두며, 각각 중재위원 중에서 호선한다.",
                    "위원장, 부위원장, 감사 및 중재위원의 임기는 각각 2년으로 하며, 연임할 수 없다.",
                    "중재위원회의 회의는 재적위원 과반수의 출석과 출석위원 과반수의 찬성으로 의결한다."},





    };


    public static String mCorrectAnswers[] =
            //1
            {"국가경찰과 자치경찰",

                    //2

                    "썩은 사과 가설",

                    //3

                    "치안행정협의회의 조직·운영과 그 밖에 필요한 사항은 경찰청 훈령으로 정한다.",

                    //4

                    "5개",

                    //5
                    "경찰청 소속 경무관 이상의 강등 및 정직과 경정 이상의 파면 및 해임은 행정자치부장관의 제청으로 국무총리를 거쳐 대통령이 한다.",


                    //6
                    "공무원은 노동운동이나 그 밖에 공무 외의 일을 위한 집단 행위를 하여서는 아니 된다. 또한, 사실상 노무에 종사하는 공무원도 포함한다.",

                    //7
                    "경찰청장은 위해성 경찰장비를 새로 도입하려는 경우에는 대통령령으로 정하는 바에 따라 안전성 검사를 실시하여 그 안전성 검사의 결과보고서를 국회 소관 상임위원회에 제출하여야 한다. 이 경우 안전성 검사에는 외부 전문가를 참여시킬 수 있다.",

                    //8

                    "경찰관은 14세 이하의 자 또는 임산부에 대하여 전자충격기 또는 전자방패를 사용하여서는 아니된다.",

                    //9

                    "1개",


                    //10

                    "공공기관은 이의신청을 받은 날부터 10일 이내에 그 이의신청에 대하여 결정하고 그 결과를 청구인에게 지체 없이 문서로 통지하여야 한다. 다만, 부득이한 사유로 정하여진 기간 이내에 결정할 수 없을 때에는 그 기간이 끝나는 날의 다음 날부터 기산하여 10일의 범위에서 연장할 수 있으며, 연장 사유를 청구인에게 통지하여야 한다.",

                    //11

                    "기계경비업무 - 경비대상시설에 설치한 기기에 의하여 감지·송신된 정보를 그 경비대상시설내의 장소에 설치한 관제시설의 기기로 수신하여 도난·화재 등 위험 발생을 방지하는 업무를 말한다.",


                    //12
                    "4개",

                    //13
                    "가치변화성 - 범죄첩보는 시간이 경과함에 따라 가치가 감소한다.",

                    //14
                    "국가중요시설은 경찰청장이 관계 행정기관의 장 및 국가정보원장과 협의하여 지정한다.",


                    //15
                    "4개",


                    //16
                    "4개",

                    //17
                    "“주관자”란 자기 이름으로 자기 책임 아래 집회나 시위를 여는 사람이나 단체를 말한다. 주관자는 주최자를 따로 두어 집회 또는 시위의 실행을 맡아 관리하도록 위임할 수 있다. 이 경우 주최자는 그 위임의 범위 안에서 주관자로 본다.",

                    //18
                    "㉠ 삼각형      ㉡ 피라미드형    ㉢ 서클형",

                    //19
                    "㉠ E-6   ㉡ E-2",

                    //20
                    "위원장, 부위원장, 감사 및 중재위원의 임기는 각각 2년으로 하며, 연임할 수 없다.",
            };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }
    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }


}


